{
    "DataRevision": 1372801141,
    "Preliminary": false,
    "Event": "RE 2013",
    "Name": "RE 2013",
    "Description": "",
    "Location": "Rio de Janeiro, Brazil",
    "Sponsors": "",
    "URL": "http://www.re13.org/",
    "MultiTrack": "false",
    "Organization": {
        "General Chairs": [
        ],
        "PC Chairs": [
        ]
    },
    "SocialFeeds": [
    ],
    "VenueInfo": {
        "Name": "",
        "GPS": {
            "Latitude": 0,
            "Longitude": 0
        }
    },
    "InfoPage": {
        "xaml": "foo",
        "Elements": [
            {
                "XamlName": "ConferenceCenterMap",
                "Type": "Map",
                "GPS": {
                    "Latitude": 0,
                    "Longitude": 0
                },
                "MapLabel": ""
            },
            {
                "XamlName": "LicenseButton",
                "Type": "WebLink",
                "URL": "http://research.microsoft.com/en-US/projects/confapp/terms.aspx"
            },
            {
                "XamlName": "PrivacyButton",
                "Type": "WebLink",
                "URL": "http://privacy.microsoft.com/en-us/default.msp"
            }
        ]
    },
    "SessionPriorities": [
        "Award",
        "Invited Talk",
        "Other"
    ],
    "Items": [
        {
            "Title": "Message from the Chairs",
            "Type": "Frontmatter",
            "Key": "re13foreword-fm001-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DOrlena+Gotel%2C+Julio+Cesar+Sampaio+do+Prado+Leite%2C+and+Alistair+Mavin+%22Message+from+the+Chairs%22",
            "URLvideo": "",
            "PersonsString": "Orlena Gotel, Julio Cesar Sampaio do Prado Leite, and Alistair Mavin",
            "AffiliationsString": "PUC Rio, Brazil; ",
            "Authors": [
                "Orlena Gotel @ n.n., n.n.",
                "Julio Cesar Sampaio do Prado Leite @ PUC Rio, Brazil",
                "Alistair Mavin @"
            ],
            "Affiliations": [
                "n.n., n.n.",
                "PUC Rio, Brazil;"
            ],
            "Abstract": "Welcome to the 21st IEEE International Requirements Engineering Conference (RE’13). Given a thriving Ibero-American community of Requirements Engineering researchers and practitioners, it is with great pride that Latin America hosts the Requirements Engineering conference for the very first time. RE’13 will be held in Brasil, on the campus of Pontifícia Universidade Católica do Rio de Janeiro (PUC-Rio), just steps away from the famous beaches of Ipanema and Copacabana. As the Requirements Engineering community celebrates its 21st birthday, the ‘Marvelous City’ (‘Cidade Maravilhosa’) offers us a unique stage.  To mark this important coming of age, the theme for RE’13 is ‘RE@21: Keeping Requirements on Track’. We seek to investigate whether the field of Requirements Engineering has made its transition from adolescence into adulthood, and we hope to guide its onward journey; are we addressing the ‘right’ problems and are we providing ‘effective’ solutions? RE’13 is a timely opportunity for researchers, practitioners, educators, and students to come together to reflect and discuss our progress as a community, and to identify the important challenges still to be tackled.",
            "Award": ""
        },
        {
            "Title": "Requirements Engineering as Information Search and Idea Discovery (Keynote)",
            "Type": "Keynote Paper (up to 10 pages)",
            "Key": "re13keynotes-k1-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DNeil+Maiden+%22Requirements+Engineering+as+Information+Search+and+Idea+Discovery+%28Keynote%29%22",
            "URLvideo": "",
            "PersonsString": "Neil Maiden",
            "AffiliationsString": "City University London, UK",
            "Authors": [
                "Neil Maiden @ City University London, UK"
            ],
            "Affiliations": [
                "City University London, UK"
            ],
            "Abstract": "Creativity has been the subject of considerable research over the last 60 years. This keynote will argue that most requirements work is creative but not recognized as such. It will summarize recent applications of creativity theories and techniques to requirements work, then posit the general case that most requirements activities involve information search and idea discovery, and hence can be characterized as creative. Requirements research reported over the 21 years of this conference series will be reframed using theories of creativity as information search and idea discovery to support this argument, alongside macro-economic drivers and the shifting landscape of computing and design disciplines and conferences. The keynote will end with a call for researchers and practitioners at RE@21 to reframe requirements work as creative endeavors.",
            "Award": ""
        },
        {
            "Title": "Starchitects and Jack-Hammers: Requirements Engineering Challenges and Practices in the Construction Industry (Keynote)",
            "Type": "Keynote Paper (up to 10 pages)",
            "Key": "re13keynotes-k2-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DFiona+Cousins+%22Starchitects+and+Jack-Hammers%3A+Requirements+Engineering+Challenges+and+Practices+in+the+Construction+Industry+%28Keynote%29%22",
            "URLvideo": "",
            "PersonsString": "Fiona Cousins",
            "AffiliationsString": "Arup, USA",
            "Authors": [
                "Fiona Cousins @ Arup, USA"
            ],
            "Affiliations": [
                "Arup, USA"
            ],
            "Abstract": "Our built environment is a marvel of engineering. It is the continuously evolving product of collaboration between civil engineers, mechanical engineers, electrical engineers, architects, owners, governments, voters, contractors and more. Many of the requirements–related challenges that are commonly encountered in the engineering of software systems have been around for centuries in the construction industry.  This keynote seeks to describe those requirements engineering problems that are intrinsic to the development of complex twenty-first century buildings and to explain the practices that have evolved to address them. It will highlight those requirements-related challenges that the construction industry is still grappling with and some new challenges that are emerging. The keynote will be illustrated with examples of complex building projects from Arup. The objective is to explore the potential synergies and the possible transfer of practical ideas between some of the oldest engineering disciplines and one of the youngest.",
            "Award": ""
        },
        {
            "Title": "Brasilian Perspectives on Software Production (Keynote Panel)",
            "Type": "Keynote Paper (up to 10 pages)",
            "Key": "re13keynotes-k3-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DKarin+K.+Breitman%2C+Roberto+Leite%2C+and+Jaime+S%C3%A1bat+%22Brasilian+Perspectives+on+Software+Production+%28Keynote+Panel%29%22",
            "URLvideo": "",
            "PersonsString": "Karin K. Breitman, Roberto Leite, and Jaime Sábat",
            "AffiliationsString": "EMC, Brazil; Siemens Chemtech, Brazil; Accenture, Brazil",
            "Authors": [
                "Karin K. Breitman @ EMC, Brazil",
                "Roberto Leite @ Siemens Chemtech, Brazil",
                "Jaime Sábat @ Accenture, Brazil"
            ],
            "Affiliations": [
                "EMC, Brazil",
                "Siemens Chemtech, Brazil",
                "Accenture, Brazil"
            ],
            "Abstract": "This keynote panel will explore different perspectives on software production from three very experienced leaders in large companies in Brasil. The panelists will present a blend of industrial research and industrial development experiences, and their requirements engineering challenges will be discussed. The keynote panel will be moderated by Julio Cesar Leite of PUC-Rio, the General Chair of RE’13.",
            "Award": ""
        },
        {
            "Title": "Automated Text Mining for Requirements Analysis of Policy Documents",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p085-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAaron+K.+Massey%2C+Jacob+Eisenstein%2C+Annie+I.+Ant%C3%B3n%2C+and+Peter+P.+Swire+%22Automated+Text+Mining+for+Requirements+Analysis+of+Policy+Documents%22",
            "URLvideo": "",
            "PersonsString": "Aaron K. Massey, Jacob Eisenstein, Annie I. Antón, and Peter P. Swire",
            "AffiliationsString": "Georgia Tech, USA; Ohio State University, USA",
            "Authors": [
                "Aaron K. Massey @ Georgia Tech, USA",
                "Jacob Eisenstein @ Georgia Tech, USA",
                "Annie I. Antón @ Georgia Tech, USA",
                "Peter P. Swire @ Ohio State University, USA"
            ],
            "Affiliations": [
                "Georgia Tech, USA",
                "Georgia Tech, USA",
                "Georgia Tech, USA",
                "Ohio State University, USA"
            ],
            "Abstract": "Businesses and organizations in jurisdictions around the world are required by law to provide their customers and users with information about their business practices in the form of policy documents. Requirements engineers analyze these documents as sources of requirements, but this analysis is a time-consuming and mostly manual process. Moreover, policy documents contain legalese and present readability challenges to requirements engineers seeking to analyze them. In this paper, we perform a large-scale analysis of 2,061 policy documents, including policy documents from the Google Top 1000 most visited websites and the Fortune 500 companies, for three purposes: (1) to assess the readability of these policy documents for requirements engineers; (2) to determine if automated text mining can indicate whether a policy document contains requirements expressed as either privacy protections or vulnerabilities; and (3) to establish the generalizability of prior work in the identification of privacy protections and vulnerabilities from privacy policies to other policy documents. Our results suggest that this requirements analysis technique, developed on a small set of policy documents in two domains, may generalize to other domains.",
            "Award": ""
        },
        {
            "Title": "Formal Analysis of Privacy Requirements Specifications for Multi-tier Applications",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p111-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DTravis+D.+Breaux+and+Ashwini+Rao+%22Formal+Analysis+of+Privacy+Requirements+Specifications+for+Multi-tier+Applications%22",
            "URLvideo": "",
            "PersonsString": "Travis D. Breaux and Ashwini Rao",
            "AffiliationsString": "CMU, USA",
            "Authors": [
                "Travis D. Breaux @ CMU, USA",
                "Ashwini Rao @ CMU, USA"
            ],
            "Affiliations": [
                "CMU, USA",
                "CMU, USA"
            ],
            "Abstract": "Companies require data from multiple sources to develop new information systems, such as social networking, ecommerce and location-based services. Systems rely on complex, multi-stakeholder data supply-chains to deliver value. These data supply-chains have complex privacy requirements: privacy policies affecting multiple stakeholders (e.g. user, developer, company, government) regulate the collection, use and sharing of data over multiple jurisdictions (e.g. California, United States, Europe). Increasingly, regulators expect companies to ensure consistency between company privacy policies and company data practices. To address this problem, we propose a methodology to map policy requirements in natural language to a formal representation in Description Logic. Using the formal representation, we reason about conflicting requirements within a single policy and among multiple policies in a data supply chain. Further, we enable tracing data flows within the supply-chain. We derive our methodology from an exploratory case study of Facebook platform policy. We demonstrate the feasibility of our approach in an evaluation involving Facebook, Zynga and AOL-Advertising policies. Our results identify three conflicts that exist between Facebook and Zynga policies, and one conflict within the AOL Advertising policy.",
            "Award": ""
        },
        {
            "Title": "An Empirical Investigation of Software Engineers' Ability to Classify Legal Cross-References",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p048-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJeremy+C.+Maxwell%2C+Annie+I.+Ant%C3%B3n%2C+and+Julie+B.+Earp+%22An+Empirical+Investigation+of+Software+Engineers%27+Ability+to+Classify+Legal+Cross-References%22",
            "URLvideo": "",
            "PersonsString": "Jeremy C. Maxwell, Annie I. Antón, and Julie B. Earp",
            "AffiliationsString": "North Carolina State University, USA; Georgia Tech, USA",
            "Authors": [
                "Jeremy C. Maxwell @ North Carolina State University, USA",
                "Annie I. Antón @ Georgia Tech, USA",
                "Julie B. Earp @ North Carolina State University, USA"
            ],
            "Affiliations": [
                "North Carolina State University, USA",
                "Georgia Tech, USA",
                "North Carolina State University, USA"
            ],
            "Abstract": "Requirements engineers often have to develop software for regulated domains. These regulations often contain cross-references to other laws. Cross-references can introduce exceptions or definitions, constrain existing requirements, or even conflict with other compliance requirements. To develop compliant software, requirements engineers must understand the impact these cross-references have on their software. In this paper, we present an empirical study in which we measure the ability of software practitioners to classify cross-references using our previously developed cross-reference taxonomy. We discover that software practitioners are not well equipped to understand the impact of cross-references on their software.",
            "Award": ""
        },
        {
            "Title": "Supporting Requirements Traceability through Refactoring",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p119-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAnas+Mahmoud+and+Nan+Niu+%22Supporting+Requirements+Traceability+through+Refactoring%22",
            "URLvideo": "",
            "PersonsString": "Anas Mahmoud and Nan Niu",
            "AffiliationsString": "Mississippi State University, USA",
            "Authors": [
                "Anas Mahmoud @ Mississippi State University, USA",
                "Nan Niu @ Mississippi State University, USA"
            ],
            "Affiliations": [
                "Mississippi State University, USA",
                "Mississippi State University, USA"
            ],
            "Abstract": "Modern traceability tools employ information retrieval (IR) methods to generate candidate traceability links. These methods track textual signs embedded in the system to establish relationships between software artifacts. However, as software systems evolve, new and inconsistent terminology finds its way into the system’s taxonomy, thus corrupting its lexical structure and distorting its traceability tracks. In this paper, we argue that the distorted lexical tracks of the system can be systematically re-established through refactoring, a set of behavior-preserving transformations for keeping the system quality under control during evolution. To test this novel hypothesis, we investigate the effect of integrating various types of refactoring on the performance of requirements-to-code automated tracing methods. In particular, we identify the problems of missing, misplaced, and duplicated signs in software artifacts, and then examine to what extent refactorings that restore, move, and remove textual information can overcome these problems respectively.We conduct our experimental analysis using three datasets from different application domains. Results show that restoring textual information in the system has a positive impact on tracing. In contrast, refactorings that remove redundant information impact tracing negatively. Refactorings that move information among the system modules are found to have no significant effect. Our findings address several issues related to code and requirements evolution, as well as refactoring as a mechanism to enhance the practicality of automated tracing tools.",
            "Award": ""
        },
        {
            "Title": "Foundations for an Expert System in Domain-Specific Traceability",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p006-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJin+Guo%2C+Jane+Cleland-Huang%2C+and+Brian+Berenbach+%22Foundations+for+an+Expert+System+in+Domain-Specific+Traceability%22",
            "URLvideo": "",
            "PersonsString": "Jin Guo, Jane Cleland-Huang, and Brian Berenbach",
            "AffiliationsString": "DePaul University, USA; Siemens, USA",
            "Authors": [
                "Jin Guo @ DePaul University, USA",
                "Jane Cleland-Huang @ DePaul University, USA",
                "Brian Berenbach @ Siemens, USA"
            ],
            "Affiliations": [
                "DePaul University, USA",
                "DePaul University, USA",
                "Siemens, USA"
            ],
            "Abstract": "Attempts to utilize information retrieval techniques to fully automate the creation of traceability links have been hindered by terminology mismatches between source and target artifacts. Therefore, current trace retrieval algorithms tend to produce imprecise and incomplete results. In this paper we address this mismatch by proposing an expert system which integrates a knowledge base of domain concepts and their relationships, a set of logic rules for defining relationships between artifacts based on these rules, and a process for mapping artifacts into a structure against which the rules can be applied. This paper lays down the core foundations needed to integrate an expert system into the automated tracing process. We construct a knowledge base and inference rules for part of a large industrial project in the transportation domain and empirically show that our approach significantly improves precision and recall of the generated trace links.",
            "Award": ""
        },
        {
            "Title": "Application of Reinforcement Learning to Requirements Engineering: Requirements Tracing",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p036-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DHakim+Sultanov+and+Jane+Huffman+Hayes+%22Application+of+Reinforcement+Learning+to+Requirements+Engineering%3A+Requirements+Tracing%22",
            "URLvideo": "",
            "PersonsString": "Hakim Sultanov and Jane Huffman Hayes",
            "AffiliationsString": "University of Kentucky, USA",
            "Authors": [
                "Hakim Sultanov @ University of Kentucky, USA",
                "Jane Huffman Hayes @ University of Kentucky, USA"
            ],
            "Affiliations": [
                "University of Kentucky, USA",
                "University of Kentucky, USA"
            ],
            "Abstract": "Abstract—We posit that machine learning can be applied to effectively address requirements engineering problems. Specifically, we present a requirements traceability method based on the machine learning technique Reinforcement Learning (RL). The RL method demonstrates a rather targeted generation of candidate links between textual requirements artifacts (high level requirements traced to low level requirements, for example). This work also presents the utilization of synonyms in the context of common textual segments. The technique has been validated using two real-world datasets from two problem domains. Our technique demonstrated statistically significant better results than the Information Retrieval technique.",
            "Award": ""
        },
        {
            "Title": "On Requirements Verification for Model Refinements",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p021-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DCarlo+Ghezzi%2C+Claudio+Menghi%2C+Amir+Molzam+Sharifloo%2C+and+Paola+Spoletini+%22On+Requirements+Verification+for+Model+Refinements%22",
            "URLvideo": "http%3A%2F%2Fyoutu.be%2Fr18v_lZ-utY",
            "PersonsString": "Carlo Ghezzi, Claudio Menghi, Amir Molzam Sharifloo, and Paola Spoletini",
            "AffiliationsString": "Politecnico di Milano, Italy; Universita dell’Insubria, Italy",
            "Authors": [
                "Carlo Ghezzi @ Politecnico di Milano, Italy",
                "Claudio Menghi @ Politecnico di Milano, Italy",
                "Amir Molzam Sharifloo @ Politecnico di Milano, Italy",
                "Paola Spoletini @ Universita dell’Insubria, Italy"
            ],
            "Affiliations": [
                "Politecnico di Milano, Italy",
                "Politecnico di Milano, Italy",
                "Politecnico di Milano, Italy",
                "Universita dell’Insubria, Italy"
            ],
            "Abstract": "Conventional formal verification techniques rely on the assumption that a system’s specification is completely available so that the analysis can say whether or not a set of properties will be satisfied. On the contrary, modern development lifecycles call for agile—incremental and iterative— approaches to tame the boosting complexity of modern software systems and reduce development risks. We focus here on requirements verification performed in the early exploratory stages on high-level models and we discuss how this can be integrated into an agile approach. We present a new technique to model-check incomplete high-level specifications against formally specified requirements. We do this in the context of incomplete hierarchical Statecharts, verified against qCTL properties. Our approach supports step-wise specification and refinement verification. Verification can be incremental, that is alternative refinements may be separately explored and verification is only replayed for the modified parts. The results are presented by introducing the formalisms, the model-checking algorithm, and the tool we have implemented.",
            "Award": ""
        },
        {
            "Title": "Distributing Refinements of a System-Level Partial Behavior Model",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p030-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DIvo+Krka+and+Nenad+Medvidovic+%22Distributing+Refinements+of+a+System-Level+Partial+Behavior+Model%22",
            "URLvideo": "",
            "PersonsString": "Ivo Krka and Nenad Medvidovic",
            "AffiliationsString": "University of Southern California, USA",
            "Authors": [
                "Ivo Krka @ University of Southern California, USA",
                "Nenad Medvidovic @ University of Southern California, USA"
            ],
            "Affiliations": [
                "University of Southern California, USA",
                "University of Southern California, USA"
            ],
            "Abstract": "Early in a system’s life cycle, a system’s behavior is typically partially specified using scenarios, invariants, and temporal properties. These specifications prohibit or require certain behaviors, while leaving other behaviors uncategorized into either of those. Engineers refine the specification by eliciting more requirements to finally arrive at a complete behavioral description. Partial-behavior models have been utilized as a formal foundation for capturing partial system specifications. Mapping the requirements to partial behavior models enables automated analyses (e.g., requirements consistency checking) and helps to elicit new requirements. Under the current practices, software systems are reasoned about and their behavior specified exclusively at the system level, disregarding of the fact that a system typically consists of interacting components. However, exclusively refining a behavior specification at the system-level runs the risk of arriving at an inconsistent specification, i.e. one that is not realizable as a composition of the system’s components. To address this problem, we propose a framework that provides the lacking support: a newly specified requirement implicitly refines the system’s underlying partial behavior model; our framework maps the new requirement to components by automatically distributing the system model refinements to the components’ underlying models. By doing so, our framework prevents requirements inconsistencies and helps to identify further necessary requirements. We discuss the framework’s soundness and correctness, and demonstrate its features on a case study previously used in related literature.",
            "Award": ""
        },
        {
            "Title": "A Mode-Based Pattern for Feature Requirements, and a Generic Feature Interface",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p018-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDavid+Dietrich+and+Joanne+M.+Atlee+%22A+Mode-Based+Pattern+for+Feature+Requirements%2C+and+a+Generic+Feature+Interface%22",
            "URLvideo": "",
            "PersonsString": "David Dietrich and Joanne M. Atlee",
            "AffiliationsString": "University of Waterloo, Canada",
            "Authors": [
                "David Dietrich @ University of Waterloo, Canada",
                "Joanne M. Atlee @ University of Waterloo, Canada"
            ],
            "Affiliations": [
                "University of Waterloo, Canada",
                "University of Waterloo, Canada"
            ],
            "Abstract": "In this paper, we propose a pattern for decomposing and structuring the model of a feature's behavioural requirements, based on modes of operation (e.g., Active, Inactive, Failed) that are common to features in multiple domains. Interestingly, the highest-level modes of the pattern can serve as a generic behavioural interface for all features that adhere to the pattern. We have applied the pattern in modelling the behavioural requirements of 19 automotive features that were specified in 5 production-grade requirements documents. We found that the pattern was applicable to all 19 features, and that our proposed generic feature interface was applicable to 50 out of 57 inter-feature references.",
            "Award": ""
        },
        {
            "Title": "Requirements Elicitation: Towards the Unknown Unknowns",
            "Type": "Full Paper (10 pp + 3 pp refs, survey paper)",
            "Key": "re13rt-p020-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAlistair+Sutcliffe+and+Pete+Sawyer+%22Requirements+Elicitation%3A+Towards+the+Unknown+Unknowns%22",
            "URLvideo": "",
            "PersonsString": "Alistair Sutcliffe and Pete Sawyer",
            "AffiliationsString": "University of Lancaster, UK",
            "Authors": [
                "Alistair Sutcliffe @ University of Lancaster, UK",
                "Pete Sawyer @ University of Lancaster, UK"
            ],
            "Affiliations": [
                "University of Lancaster, UK",
                "University of Lancaster, UK"
            ],
            "Abstract": "Requirements elicitation research is reviewed using a framework categorising the relative ‘knowness’ of requirements specification and Common Ground discourse theory. The main contribution of this survey is to review requirements elicitation from the perspective of this framework and propose a road map of research to tackle outstanding elicitation problems involving tacit knowledge. Elicitation techniques (interviews, scenarios, prototypes, etc.) are investigated, followed by representations, models and support tools. The survey results suggest that elicitation techniques appear to be relatively mature, although new areas of creative requirements are emerging. Representations and models are also well established although there is potential for more sophisticated modelling of domain knowledge. While model-checking tools continue to become more elaborate, more growth is apparent in NL tools such as text mining and IR which help to categorize and disambiguate requirements. Social collaboration support is a relatively new area that facilitates categorisation, prioritisation and matching collections of requirements for product line versions. A road map for future requirements elicitation research is proposed investigating the prospects for techniques, models and tools in green-field domains where few solutions exist, contrasted with brown-field domains where collections of requirements and products already exist. The paper concludes with remarks on the possibility of elicitation tackling the most difficult question of ‘unknown unknown’ requirements.",
            "Award": ""
        },
        {
            "Title": "How Cloud Providers Elicit Consumer Requirements: An Exploratory Study of Nineteen Companies",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p084-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DIrina+Todoran%2C+Norbert+Seyff%2C+and+Martin+Glinz+%22How+Cloud+Providers+Elicit+Consumer+Requirements%3A+An+Exploratory+Study+of+Nineteen+Companies%22",
            "URLvideo": "",
            "PersonsString": "Irina Todoran, Norbert Seyff, and Martin Glinz",
            "AffiliationsString": "University of Zurich, Switzerland",
            "Authors": [
                "Irina Todoran @ University of Zurich, Switzerland",
                "Norbert Seyff @ University of Zurich, Switzerland",
                "Martin Glinz @ University of Zurich, Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "Requirements elicitation is widely seen as a crucial step towards delivering successful software. In the context of emerging cloud systems, the question is whether and how the elicitation process differs from that used for traditional systems, and if the current methods suffice. We interviewed 19 cloud providers to gain an in-depth understanding of the state of practice with regard to the adoption and implementation of existing elicitation methods. The results of this exploratory study show that, whereas a few cloud providers try to implement and adapt traditional methods, the large majority uses ad-hoc approaches for identifying consumer needs. There are various causes for this situation, ranging from consumer reachability issues and previous failed attempts, to a complete lack of development strategy. The study suggests that only a small number of the current techniques can be applied successfully in cloud systems, hence showing a need to research new ways of supporting cloud providers. The main contribution of this work lies in revealing what elicitation methods are used by cloud providers and clarifying the challenges related to requirements elicitation posed by the cloud paradigm. Further, we identify some key features for cloud-specific elicitation methods.",
            "Award": ""
        },
        {
            "Title": "Visual Notation Design 2.0: Towards User Comprehensible Requirements Engineering Notations",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p141-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DPatrice+Caire%2C+Nicolas+Genon%2C+Patrick+Heymans%2C+and+Daniel+L.+Moody+%22Visual+Notation+Design+2.0%3A+Towards+User+Comprehensible+Requirements+Engineering+Notations%22",
            "URLvideo": "",
            "PersonsString": "Patrice Caire, Nicolas Genon, Patrick Heymans, and Daniel L. Moody",
            "AffiliationsString": "University of Luxembourg, Luxembourg; University of Namur, Belgium; Ozemantics, Australia",
            "Authors": [
                "Patrice Caire @ University of Luxembourg, Luxembourg",
                "Nicolas Genon @ University of Namur, Belgium",
                "Patrick Heymans @ University of Namur, Belgium",
                "Daniel L. Moody @ Ozemantics, Australia"
            ],
            "Affiliations": [
                "University of Luxembourg, Luxembourg",
                "University of Namur, Belgium",
                "University of Namur, Belgium",
                "Ozemantics, Australia"
            ],
            "Abstract": "The success of requirements engineering depends critically on effective communication between business analysts and end users, yet empirical studies show that business stakeholders understand RE notations very poorly. This paper proposes a novel approach to designing RE visual notations that actively involves naïve users in the process. We use i*, one of the most influential RE notations, to demonstrate the approach, but the same approach could be applied to any RE notation. We present the results of 5 related empirical studies that show that novices outperform experts in designing symbols that are comprehensible to novices: the differences are both statistically significant and practically meaningful. Symbols designed by novices increased semantic transparency (their ability to be spontaneously interpreted by other novices) by almost 300% compared to the existing i* notation. The results challenge the conventional wisdom about visual notation design: that it should be conducted by a small group of experts; our research suggests that it should instead be conducted by large numbers of novices. The approach is consistent with Web 2.0, in that it harnesses the collective intelligence of end users and actively involves them in the notation design process as “prosumers” rather than passive consumers. We believe this approach has the potential to radically change the way visual notations are designed in the future.",
            "Award": ""
        },
        {
            "Title": "User Feedback in the AppStore: An Empirical Study",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p091-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDennis+Pagano+and+Walid+Maalej+%22User+Feedback+in+the+AppStore%3A+An+Empirical+Study%22",
            "URLvideo": "",
            "PersonsString": "Dennis Pagano and Walid Maalej",
            "AffiliationsString": "TU Munich, Germany; University of Hamburg, Germany",
            "Authors": [
                "Dennis Pagano @ TU Munich, Germany",
                "Walid Maalej @ University of Hamburg, Germany"
            ],
            "Affiliations": [
                "TU Munich, Germany",
                "University of Hamburg, Germany"
            ],
            "Abstract": "Application distribution platforms - or app stores - such as Google Play or Apple AppStore allow users to submit feedback in form of ratings and reviews to downloaded applications. In the last few years, these platforms have become very popular to both application developers and users. However, their real potential for and impact on requirements engineering processes are not yet well understood. This paper reports on an exploratory study, which analyzes over one million reviews from the Apple AppStore. We investigated how and when users provide feedback, inspected the feedback content, and analyzed its impact on the user community. We found that most of the feedback is provided shortly after new releases, with a quickly decreasing frequency over time. Reviews typically contain multiple topics, such as user experience, bug reports, and feature requests. The quality and constructiveness vary widely, from helpful advices and innovative ideas to insulting offenses. Feedback content has an impact on download numbers: positive messages usually lead to better ratings and vice versa. Negative feedback such as shortcomings is typically destructive and misses context details and user experience. We discuss our findings and their impact on software and requirements engineering teams.",
            "Award": ""
        },
        {
            "Title": "Learning from Evolution History to Predict Future Requirement Changes",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p057-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLin+Shi%2C+Qing+Wang%2C+and+Mingshu+Li+%22Learning+from+Evolution+History+to+Predict+Future+Requirement+Changes%22",
            "URLvideo": "",
            "PersonsString": "Lin Shi, Qing Wang, and Mingshu Li",
            "AffiliationsString": "ISCAS, China; UCAS, China",
            "Authors": [
                "Lin Shi @ ISCAS, China / UCAS, China",
                "Qing Wang @ ISCAS, China",
                "Mingshu Li @ ISCAS, China"
            ],
            "Affiliations": [
                "ISCAS, China / UCAS, China",
                "ISCAS, China",
                "ISCAS, China"
            ],
            "Abstract": "Managing the costs and risks of evolution is a challenging problem in the RE community. The challenge lies in the difficulty of analyzing and assessing the proneness to requirement changes across multiple versions, especially when the scale of requirements is large. In this paper, we define a series of metrics to characterize historic evolution information, and propose a novel method for predicting requirements that are likely to evolve in the future based on the metrics. We apply the prediction method to analyze the product updates history through a case study. The empirical results show that this method can provide a tradeoff solution that narrows down the scope of change analysis to a small set of requirements, but it still can retrieve nearly half of the future changes. The results indicate that the defined metrics are sensitive to the history of requirements evolution, and the prediction method can reach a valuable outcome for requirement engineers to balance their workload and risks.",
            "Award": ""
        },
        {
            "Title": "Assessing Regulatory Change through Legal Requirements Coverage Modeling",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p038-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDavid+G.+Gordon+and+Travis+D.+Breaux+%22Assessing+Regulatory+Change+through+Legal+Requirements+Coverage+Modeling%22",
            "URLvideo": "",
            "PersonsString": "David G. Gordon and Travis D. Breaux",
            "AffiliationsString": "CMU, USA",
            "Authors": [
                "David G. Gordon @ CMU, USA",
                "Travis D. Breaux @ CMU, USA"
            ],
            "Affiliations": [
                "CMU, USA",
                "CMU, USA"
            ],
            "Abstract": "Developing global markets offer companies new opportunities to manufacture and sell information technology (IT) products in ways unforeseen by current laws and regulations. This innovation leads to changing requirements due to changes in product features, laws, or the locality where the product is sold or manufactured. To help developers rationalize these changes, we introduce a preliminary framework and method that can be used by requirements engineers and their legal teams to identify relevant legal requirements and trace changes in requirements coverage. The framework includes a method to translate IT regulations into a legal requirements coverage model used to make coverage assertions about existing or planned IT systems. We evaluated the framework in a case study using three IT laws: California’s Confidentiality of Medical Records Act, the U.S. Health Information Portability and Accountability Act (HIPAA) and amendments from the Health Information Technology for Economic and Clinical Health (HITECH) Act, and the India 2011 Information Technology Rules. Further, we demonstrate the framework using three scenarios: new product features are proposed; product-related services are outsourced abroad; and regulations change to address changes in the market.",
            "Award": ""
        },
        {
            "Title": "A Goal Model Elaboration for Localizing Changes in Software Evolution",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p005-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DHiroyuki+Nakagawa%2C+Akihiko+Ohsuga%2C+and+Shinichi+Honiden+%22A+Goal+Model+Elaboration+for+Localizing+Changes+in+Software+Evolution%22",
            "URLvideo": "",
            "PersonsString": "Hiroyuki Nakagawa, Akihiko Ohsuga, and Shinichi Honiden",
            "AffiliationsString": "University of Electro-Communications, Japan; NII, Japan",
            "Authors": [
                "Hiroyuki Nakagawa @ University of Electro-Communications, Japan",
                "Akihiko Ohsuga @ University of Electro-Communications, Japan",
                "Shinichi Honiden @ NII, Japan"
            ],
            "Affiliations": [
                "University of Electro-Communications, Japan",
                "University of Electro-Communications, Japan",
                "NII, Japan"
            ],
            "Abstract": "Software evolution is an essential activity that adapts existing software to changes in requirements. Localizing the impact of changes is one of the most efficient strategies for successful evolution. We exploit requirements descriptions in order to extract loosely coupled components and localize changes for evolution. We define a process of elaboration for the goal model that extracts a set of control loops from the requirements descriptions as components that constitute extensible systems. We regard control loops to be independent components that prevent the impact of a change from spreading outside them. To support the elaboration, we introduce two patterns: one to extract control loops from the goal model and another to detect possible conflicts between control loops. We experimentally evaluated our approach in two types of software development and the results demonstrate that our elaboration technique helps us to analyze the impact of changes in the source code and prevent the complexity of the code from increasing.",
            "Award": ""
        },
        {
            "Title": "Ongoing Software Development without Classical Requirements",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p123-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DThomas+A.+Alspaugh+and+Walt+Scacchi+%22Ongoing+Software+Development+without+Classical+Requirements%22",
            "URLvideo": "",
            "PersonsString": "Thomas A. Alspaugh and Walt Scacchi",
            "AffiliationsString": "UC Irvine, USA",
            "Authors": [
                "Thomas A. Alspaugh @ UC Irvine, USA",
                "Walt Scacchi @ UC Irvine, USA"
            ],
            "Affiliations": [
                "UC Irvine, USA",
                "UC Irvine, USA"
            ],
            "Abstract": "Many prominent open source software (OSS) development projects produce systems without overt requirements artifacts or processes, contrary to expectations resulting from classical software development experience and research, and a growing number of critical software systems are evolved and sustained in this way yet provide quality and rich functional capabilities to users and integrators that accept them without question. We examine data from several OSS projects to investigate this conundrum, and discuss the results of research into OSS outcomes that sheds light on the consequences of this approach to software requirements in terms of risk of development failure and quality of the resulting system.",
            "Award": ""
        },
        {
            "Title": "Assumption-Based Risk Identification Method (ARM) in Dynamic Service Provisioning",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p076-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAlireza+Zarghami%2C+Eelco+Vriezekolk%2C+Mohammad+Zarifi+Eslami%2C+Marten+van+Sinderen%2C+and+Roel+Wieringa+%22Assumption-Based+Risk+Identification+Method+%28ARM%29+in+Dynamic+Service+Provisioning%22",
            "URLvideo": "",
            "PersonsString": "Alireza Zarghami, Eelco Vriezekolk, Mohammad Zarifi Eslami, Marten van Sinderen, and Roel Wieringa",
            "AffiliationsString": "University of Twente, Netherlands",
            "Authors": [
                "Alireza Zarghami @ University of Twente, Netherlands",
                "Eelco Vriezekolk @ University of Twente, Netherlands",
                "Mohammad Zarifi Eslami @ University of Twente, Netherlands",
                "Marten van Sinderen @ University of Twente, Netherlands",
                "Roel Wieringa @ University of Twente, Netherlands"
            ],
            "Affiliations": [
                "University of Twente, Netherlands",
                "University of Twente, Netherlands",
                "University of Twente, Netherlands",
                "University of Twente, Netherlands",
                "University of Twente, Netherlands"
            ],
            "Abstract": "In this paper we consider service-oriented applications composed of component services provided by different, economically independent service providers. As in all composite applications, the component services are composed and configured to meet requirements for the composite application. However, in a field experiment of composite service-oriented applications we found that, although the services as actually delivered by the service providers meet their requirements, there is still a mismatch across service providers due to unstated assumptions, and that this mismatch causes an incorrect composite application to be delivered to end-users. Identifying and analyzing these initially unstated assumptions turns requirements engineering for service-oriented applications into risk analysis. In this paper, we describe a field experiment with an experimental service-oriented homecare system, in which unexpected behavior of the system turned up unstated assumptions about the contributing service providers. We then present an assumptions-driven risk identification method that can help identifying these risks, and we show how we applied this method in the second iteration of the field experiment. The method adapts some techniques from problem frame diagrams to identify relevant assumptions on service providers. The method is informal, and takes the view from nowhere in that it does not result in a specification of the component services, but for every component service delivers a set of assumptions that the service must satisfy in order to contribute to the overall system requirements. We end the paper with a discussion of generalizability of this method.",
            "Award": ""
        },
        {
            "Title": "Can Requirements Dependency Network Be Used as Early Indicator of Software Integration Bugs?",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p115-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJunjie+Wang%2C+Juan+Li%2C+Qing+Wang%2C+Da+Yang%2C+He+Zhang%2C+and+Mingshu+Li+%22Can+Requirements+Dependency+Network+Be+Used+as+Early+Indicator+of+Software+Integration+Bugs%3F%22",
            "URLvideo": "",
            "PersonsString": "Junjie Wang, Juan Li, Qing Wang, Da Yang, He Zhang, and Mingshu Li",
            "AffiliationsString": "ISCAS, China; UCAS, China; University of East London, UK",
            "Authors": [
                "Junjie Wang @ ISCAS, China / UCAS, China",
                "Juan Li @ ISCAS, China",
                "Qing Wang @ ISCAS, China",
                "Da Yang @ ISCAS, China",
                "He Zhang @ University of East London, UK",
                "Mingshu Li @ ISCAS, China"
            ],
            "Affiliations": [
                "ISCAS, China / UCAS, China",
                "ISCAS, China",
                "ISCAS, China",
                "ISCAS, China",
                "University of East London, UK",
                "ISCAS, China"
            ],
            "Abstract": "Complexity, cohesion and coupling have been recognized as prominent indicators for software quality. One characterization of software complexity is the existence of dependency relationship. Moreover, degree of dependency reflects the cohesion and coupling between software elements. Dependencies on design and implementation phase have been proven as important predictors for software bugs. We empirically investigated how requirements dependencies correlate with and predict software integration bugs, which can provide early estimate regarding software quality, therefore facilitate decision making early in the software lifecycle. We conducted network analysis on requirements dependency networks of two commercial software projects. We then performed correlation analysis between network measures (e.g., degree, closeness) and number of bugs. Afterwards, bug prediction models were built using these network measures. Significant correlation is observed between most of our network measures and number of bugs. These network measures can predict the number of bugs with high accuracy and sensitivity. We further identified the significant predictors for bug prediction. Besides, the indication effect of network measures on bug number varies among different types of requirements dependency. These observations show that requirements dependency network can be used as an early indicator of software integration bugs.",
            "Award": ""
        },
        {
            "Title": "An Empirical Study on Project-Specific Traceability Strategies",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p132-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DPatrick+Rempel%2C+Patrick+M%C3%A4der%2C+and+Tobias+Kuschke+%22An+Empirical+Study+on+Project-Specific+Traceability+Strategies%22",
            "URLvideo": "",
            "PersonsString": "Patrick Rempel, Patrick Mäder, and Tobias Kuschke",
            "AffiliationsString": "TU Ilmenau, Germany",
            "Authors": [
                "Patrick Rempel @ TU Ilmenau, Germany",
                "Patrick Mäder @ TU Ilmenau, Germany",
                "Tobias Kuschke @ TU Ilmenau, Germany"
            ],
            "Affiliations": [
                "TU Ilmenau, Germany",
                "TU Ilmenau, Germany",
                "TU Ilmenau, Germany"
            ],
            "Abstract": "Effective requirements traceability supports practitioners in reaching higher project maturity and better product quality. Researchers argue that effective traceability barely happens by chance or through ad-hoc efforts and that traceability should be explicitly defined upfront. However, in a previous study we found that practitioners rarely follow explicit traceability strategies. We were interested in the reason for this discrepancy. Are practitioners able to reach effective traceability without an explicit definition? More specifically, how suitable is requirements traceability that is not strategically planned in supporting a project's development process. Our interview study involved practitioners from 17 companies. These practitioners were familiar with the development process, the existing traceability and the goals of the project they reported about. For each project, we first modeled a traceability strategy based on the gathered information. Second, we examined and modeled the applied software engineering processes of each project. Thereby, we focused on executed tasks, involved actors, and pursued goals. Finally, we analyzed the quality and suitability of a project's traceability strategy. We report common problems across the analyzed traceability strategies and their possible causes. The overall quality and mismatch of analyzed traceability suggests that an upfront-defined traceability strategy is indeed required. Furthermore, we show that the decision for or against traceability relations between artifacts requires a detailed understanding of the project's engineering process and goals; emphasizing the need for a goal-oriented procedure to assess existing and define new traceability strategies. requirements traceability; traceability strategy; interview study;",
            "Award": ""
        },
        {
            "Title": "Keeping Requirements on Track via Visual Analytics",
            "Type": "Full Paper (10 pp)",
            "Key": "re13rt-p127-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DNan+Niu%2C+Sandeep+Reddivari%2C+and+Zhangji+Chen+%22Keeping+Requirements+on+Track+via+Visual+Analytics%22",
            "URLvideo": "",
            "PersonsString": "Nan Niu, Sandeep Reddivari, and Zhangji Chen",
            "AffiliationsString": "Mississippi State University, USA",
            "Authors": [
                "Nan Niu @ Mississippi State University, USA",
                "Sandeep Reddivari @ Mississippi State University, USA",
                "Zhangji Chen @ Mississippi State University, USA"
            ],
            "Affiliations": [
                "Mississippi State University, USA",
                "Mississippi State University, USA",
                "Mississippi State University, USA"
            ],
            "Abstract": "For many software projects, keeping requirements on track needs an effective and efficient path from data to decision. Visual analytics creates such a path that enables the human to extract insights by interacting with the relevant information. While various requirements visualization techniques exist, few have produced end-to-end values to practitioners. In this paper, we advance the literature on visual requirements analytics by characterizing its key components and relationships. This allows us to not only assess existing approaches, but also create tool enhancements in a principled manner. We evaluate our enhanced tool supports through a case study where massive, heterogeneous, and dynamic requirements are processed, visualized, and analyzed. In particular, our study illuminates how increased interactivity of requirements visualization could lead to actionable decisions.",
            "Award": ""
        },
        {
            "Title": "A History of the International Requirements Engineering Conference (RE) (RE@21)",
            "Type": "RE@21 Paper (6pp + 1 p refs)",
            "Key": "re13rt-p022-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DNancy+R.+Mead+%22A+History+of+the+International+Requirements+Engineering+Conference+%28RE%29+%28RE%4021%29%22",
            "URLvideo": "",
            "PersonsString": "Nancy R. Mead",
            "AffiliationsString": "SEI, USA",
            "Authors": [
                "Nancy R. Mead @ SEI, USA"
            ],
            "Affiliations": [
                "SEI, USA"
            ],
            "Abstract": "This paper traces the history of the International Requirements Engineering Conference from its beginnings to the present, with suggestions for future considerations. Other requirements engineering events and activities are also discussed. A timeline of major milestones is included, along with a brief discussion of requirements engineering research activities that occurred in parallel with the conference.",
            "Award": ""
        },
        {
            "Title": "A Review of Traceability Research at the Requirements Engineering Conference (RE@21)",
            "Type": "RE@21 Paper (6 pp + 2 pp refs)",
            "Key": "re13rt-p144-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DSunil+Nair%2C+Jose+Luis+de+la+Vara%2C+and+Sagar+Sen+%22A+Review+of+Traceability+Research+at+the+Requirements+Engineering+Conference+%28RE%4021%29%22",
            "URLvideo": "",
            "PersonsString": "Sunil Nair, Jose Luis de la Vara, and Sagar Sen",
            "AffiliationsString": "Simula Research Laboratory, Norway",
            "Authors": [
                "Sunil Nair @ Simula Research Laboratory, Norway",
                "Jose Luis de la Vara @ Simula Research Laboratory, Norway",
                "Sagar Sen @ Simula Research Laboratory, Norway"
            ],
            "Affiliations": [
                "Simula Research Laboratory, Norway",
                "Simula Research Laboratory, Norway",
                "Simula Research Laboratory, Norway"
            ],
            "Abstract": "Traceability between development artefacts and mainly from and to requirements plays a major role in system lifecycle, supporting activities such as system validation, change impact analysis, and regulation compliance. Many researchers have been working on this topic and have published their work throughout editions of the Requirements Engineering Conference. This paper aims to analyse the research on traceability published in the past 20 years of this conference and provide insights into its contribution to the traceability area. We have selected and reviewed 70 papers in the proceedings of the conference and summarised several aspects of traceability that have been addressed and by whom. The paper also discusses the evolution of the topic at the conference, compares the results with those reported in other publications, and proposes aspects on which further research should be conducted.",
            "Award": ""
        },
        {
            "Title": "Models in the RE Series (RE@21)",
            "Type": "RE@21 Paper (6 pp + 3 pp refs)",
            "Key": "re13rt-p065-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DStephen+J.+Morris+%22Models+in+the+RE+Series+%28RE%4021%29%22",
            "URLvideo": "",
            "PersonsString": "Stephen J. Morris",
            "AffiliationsString": "City University London, UK",
            "Authors": [
                "Stephen J. Morris @ City University London, UK"
            ],
            "Affiliations": [
                "City University London, UK"
            ],
            "Abstract": "This paper reports on the use and importance of models in the RE series of conferences based on the results of an analysis of the use of the word 'model' and of other words with 'model…' as their stem in the main bodies of the texts of published papers. The 620 papers examined contained 18,066 instances of these words. The words identified were divided into 'general terms' for models (505), 'special names' for models (215) and names for the 'nature and characteristics' of models and modelling (120). The large numbers are a clear indicator of the overall importance which the model has as a dominant concept and as a still proliferating artifact in the practice of those participating in the series. The three groups of names represent social conventions adopted for communication and continuity, the third providing a pragmatically rather than theoretically based overview of the factors affecting models and modelling. The conclusions use evidence from the study to suggest questions that may improve general practice and form the basis of more specific model declaration.",
            "Award": ""
        },
        {
            "Title": "A Vision for Generic Concern-Oriented Requirements Reuse (RE@21)",
            "Type": "RE@21 Paper (6 pp + 6 pp refs)",
            "Key": "re13rt-p108-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DGunter+Mussbacher+and+J%C3%B6rg+Kienzle+%22A+Vision+for+Generic+Concern-Oriented+Requirements+Reuse+%28RE%4021%29%22",
            "URLvideo": "",
            "PersonsString": "Gunter Mussbacher and Jörg Kienzle",
            "AffiliationsString": "University of Ottawa, Canada; McGill University, Canada",
            "Authors": [
                "Gunter Mussbacher @ University of Ottawa, Canada",
                "Jörg Kienzle @ McGill University, Canada"
            ],
            "Affiliations": [
                "University of Ottawa, Canada",
                "McGill University, Canada"
            ],
            "Abstract": "Reuse is a powerful tool for improving the productivity of software development. The paper puts forward arguments in favor of generic requirements reuse rooted in the vision that effectiveness requires a focus on coordinated composition of reusable artifacts across the whole software development life cycle. A survey of publications on requirements reuse from the International Requirements Engineering (RE) Conference series determines the research landscape in this area over the last twenty years, assessing the hypothesis that there is no or little research reported at RE about generic reuse of requirements models that spans the software development life cycle. The paper then outlines, for the RE community, a research agenda associated with the presented vision for such an approach to requirements reuse that builds on concern-orientation, i.e., the ability to modularize and compose important requirements concerns throughout the software development life cycle, and model-driven engineering principles. In addition, early research results are briefly presented that illustrate favorably the feasibility of such an approach.",
            "Award": ""
        },
        {
            "Title": "Requirements Reviews Revisited: Residual Challenges and Open Research Questions",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p010-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DFrank+Salger+%22Requirements+Reviews+Revisited%3A+Residual+Challenges+and+Open+Research+Questions%22",
            "URLvideo": "",
            "PersonsString": "Frank Salger",
            "AffiliationsString": "City of Munich, Germany",
            "Authors": [
                "Frank Salger @ City of Munich, Germany"
            ],
            "Affiliations": [
                "City of Munich, Germany"
            ],
            "Abstract": "It is widely accepted that early reviews on requirements specifications (RS) are an effective and efficient quality assurance technique. So why are they still not applied all over the software industry? In this paper we pinpoint that this is due to five major challenges: 1) Software requirements are based on flawed 'upstream' requirements and reviews on RS are thus in vain. 2) The impact of sociological issues related to reviews is underestimated. 3) Important quality aspects of RS escape reviews. 4) The goal of applying reviews is not made clear and different review approaches are mixed. 5) Incremental software development poses specific challenges to applying reviews on RS. In this paper we argue that in order to solve these five challenges research on reviews must take a more holistic approach, stretching to pre-project phases and incorporating various other disciplines in order to add more value for the software industry. The paper also offers preliminary solutions to the discussed challenges and sketches open research questions of high relevance for the software industry.",
            "Award": ""
        },
        {
            "Title": "Challenges in Balancing the Amount of Solution Information in Requirement Specifications for Embedded Products",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p032-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJuha+Savolainen%2C+Dagn%C3%BD+Hauksd%C3%B3ttir%2C+and+Mike+Mannion+%22Challenges+in+Balancing+the+Amount+of+Solution+Information+in+Requirement+Specifications+for+Embedded+Products%22",
            "URLvideo": "",
            "PersonsString": "Juha Savolainen, Dagný Hauksdóttir, and Mike Mannion",
            "AffiliationsString": "Danfoss Power Electronics, Denmark; DTU, Denmark; Glasgow Caledonian University, UK",
            "Authors": [
                "Juha Savolainen @ Danfoss Power Electronics, Denmark",
                "Dagný Hauksdóttir @ DTU, Denmark",
                "Mike Mannion @ Glasgow Caledonian University, UK"
            ],
            "Affiliations": [
                "Danfoss Power Electronics, Denmark",
                "DTU, Denmark",
                "Glasgow Caledonian University, UK"
            ],
            "Abstract": "Requirements are traditionally viewed as being free of the details of an envisioned solution and specified using purely problem domain entities. Preventing premature design in the requirements permits the available design space not to be restricted too early which might inhibit innovative designs. In practice, on many industrial projects, separating the problem and solution domain entities can be difficult, and arguably there are benefits for not doing so. Many customers feel more confident describing their requirements, often as the difference between the existing products and their needs, some customers have such intimate knowledge of their products that their requirements tend to be very specific, and if the customer knows the exact solution needed that naturally will reduce the cost of the requirements elicitation as well as design activities. Practitioners are challenged to understand when having solution information in requirements is sensible and when it should be avoided. In this research challenge paper, we advocate that researchers should identify different contexts and corresponding criteria that practitioners can use to evaluate when requirements specifications may include design information. To understand the research challenge we present experiences from real projects and suggest possible factors that affect when design information may be viable in requirements specifications.",
            "Award": ""
        },
        {
            "Title": "Towards a Systematic Requirement-Based Test Generation Framework: Industrial Challenges and Needs",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p013-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DShokoofeh+Hesari%2C+Razieh+Behjati%2C+and+Tao+Yue+%22Towards+a+Systematic+Requirement-Based+Test+Generation+Framework%3A+Industrial+Challenges+and+Needs%22",
            "URLvideo": "",
            "PersonsString": "Shokoofeh Hesari, Razieh Behjati, and Tao Yue",
            "AffiliationsString": "Simula Research Laboratory, Norway; University of Oslo, Norway",
            "Authors": [
                "Shokoofeh Hesari @ Simula Research Laboratory, Norway / University of Oslo, Norway",
                "Razieh Behjati @ Simula Research Laboratory, Norway",
                "Tao Yue @ Simula Research Laboratory, Norway"
            ],
            "Affiliations": [
                "Simula Research Laboratory, Norway / University of Oslo, Norway",
                "Simula Research Laboratory, Norway",
                "Simula Research Laboratory, Norway"
            ],
            "Abstract": "Requirement-based test generation (RBTG) is a verification and validation technique, which ensures the conformance of a final product with its requirements. In collaboration with an industry partner, we studied and analyzed their current practice of applying RBTG in the context of developing a family of subsea oil and gas production systems, which are cyber-physical systems. The company aims at improving their current RBTG practice by enhancing the reuse of test artifacts across different products. Due to the complexity of developing such systems and being in the context of system product-line engineering, achieving this goal requires a systematic approach for RBTG. As the first step to this end, we conducted a domain analysis with the industry partner to characterize their current practice of applying RBTG and to identify their needs and challenges. In this paper, we report results of the domain analysis. Moreover, we discuss the limitations of employing existing RBTG approaches in an industrial setting and suggest directions for improvement.",
            "Award": ""
        },
        {
            "Title": "Why Feature Dependencies Challenge the Requirements Engineering of Automotive Systems: An Empirical Study",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p031-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAndreas+Vogelsang+and+Steffen+Fuhrmann+%22Why+Feature+Dependencies+Challenge+the+Requirements+Engineering+of+Automotive+Systems%3A+An+Empirical+Study%22",
            "URLvideo": "",
            "PersonsString": "Andreas Vogelsang and Steffen Fuhrmann",
            "AffiliationsString": "TU Munich, Germany; BMW, Germany",
            "Authors": [
                "Andreas Vogelsang @ TU Munich, Germany",
                "Steffen Fuhrmann @ BMW, Germany"
            ],
            "Affiliations": [
                "TU Munich, Germany",
                "BMW, Germany"
            ],
            "Abstract": "Functional dependencies and feature interactions in automotive software systems are a major source of erroneous and deficient behavior. To overcome these problems, many approaches exist that focus on modeling these functional dependencies in early stages of system design. However, there are only few empirical studies that report on the extent of such dependencies in industrial software systems and how they are considered in an industrial development context. In this paper, we analyze the functional architecture of a real automotive software system with the aim to assess the extent, awareness and importance of interactions between features of a future vehicle. Our results show that within the functional architecture at least 85% of the analyzed vehicle features depend on each other. They furthermore show that the developers are not aware of a large number of these dependencies when they are modeled solely on an architectural level. Therefore, the developers mention the need for a more precise specification of feature interactions, e.g., for the execution of comprehensive impact analyses. These results challenge the current development methods and emphasize the need for an extensive modeling of features and their dependencies in requirements engineering. Keywords: functional specifications; feature interaction; modelbased development; automotive; empirical studies",
            "Award": ""
        },
        {
            "Title": "Early Phase Telemedicine Requirements Elicitation in Collaboration with Medical Practitioners",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p008-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DNekane+Larburu%2C+Ing+Widya%2C+Richard+G.+A.+Bults%2C+Hermie+J.+Hermens%2C+and+Carlo+Napolitano+%22Early+Phase+Telemedicine+Requirements+Elicitation+in+Collaboration+with+Medical+Practitioners%22",
            "URLvideo": "",
            "PersonsString": "Nekane Larburu, Ing Widya, Richard G. A. Bults, Hermie J. Hermens, and Carlo Napolitano",
            "AffiliationsString": "University of Twente, Netherlands; IRCCCS Fondazione Salvarore Maugeri, Italy",
            "Authors": [
                "Nekane Larburu @ University of Twente, Netherlands",
                "Ing Widya @ University of Twente, Netherlands",
                "Richard G. A. Bults @ University of Twente, Netherlands",
                "Hermie J. Hermens @ University of Twente, Netherlands",
                "Carlo Napolitano @ IRCCCS Fondazione Salvarore Maugeri, Italy"
            ],
            "Affiliations": [
                "University of Twente, Netherlands",
                "University of Twente, Netherlands",
                "University of Twente, Netherlands",
                "University of Twente, Netherlands",
                "IRCCCS Fondazione Salvarore Maugeri, Italy"
            ],
            "Abstract": "Abstract—Ubiquity of Information and Communication Technology enables innovative telemedicine treatment applications for disease management of ambulant patients. Development of new treatment applications must comply with medical protocols and ‘way of working’ to obtain safety and efficacy evidence before acceptance and use by medical practitioners. Usually, medical researchers design new treatment applications and engineers elicit application requirements in collaboration with these researchers to bridge the knowledge and ‘way of working’ gaps between them. This paper presents an elicitation method for new telemedicine applications in a collaborative setting of time-constraint medical practitioners and requirements engineers if the medical researcher is absent. Engineers compensate this lack of resources through cross-disciplinary studies and use of pathophysiological models in the absence of medical evidence. The paper discusses the application of a mixed elicitation method presented in earlier work in the addressed setting. The method applies a scenario based user needs analysis augmented by domain activity and user-system interaction analysis. The elicitation is conducted in a separation of concerns fashion combined with collaboration handshake protocols to align domain activities and user-system interactions. Later phase elicitation of user-system interaction requirements may apply known methods and is not addressed. Index Terms— Telemedicine requirements elicitation, scenario and model-based elicitation method.",
            "Award": ""
        },
        {
            "Title": "An Industrial Case Study of the Impact of Domain Ignorance on the Effectiveness of Requirements Idea Generation during Requirements Elicitation",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p016-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAli+Niknafs+and+Daniel+M.+Berry+%22An+Industrial+Case+Study+of+the+Impact+of+Domain+Ignorance+on+the+Effectiveness+of+Requirements+Idea+Generation+during+Requirements+Elicitation%22",
            "URLvideo": "",
            "PersonsString": "Ali Niknafs and Daniel M. Berry",
            "AffiliationsString": "University of Waterloo, Canada",
            "Authors": [
                "Ali Niknafs @ University of Waterloo, Canada",
                "Daniel M. Berry @ University of Waterloo, Canada"
            ],
            "Affiliations": [
                "University of Waterloo, Canada",
                "University of Waterloo, Canada"
            ],
            "Abstract": "One of the factors that is supposed to have a significant effect on an individual's effectiveness during requirements engineering activities is knowledge of the problem being solved by the system to be built, i.e., domain knowledge. Nevertheless, domain knowledge is a double-edged sword. While in-depth domain knowledge facilitates understanding the details of the problem, in-depth domain knowledge can promote falling for tacit assumptions of the domain and overlooking the obvious. On the other hand, lack of domain knowledge can facilitate more innovative out-of-the-domain-box idea generation.  This paper describes a case study carried out in industry of the idea generation part of a requirements idea brainstorming session conducted by a team deliberately constructed with four domain experts supplied by the company participating in the case study and with four domain ignorants supplied by the authors. The results support the conclusion that having a team consisting of a mix of domain experts and domain ignorants improves the effectiveness of the idea generation part of requirements idea brainstorming.",
            "Award": ""
        },
        {
            "Title": "The Impact of Requirements on Software Quality across Three Product Generations",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p009-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJohn+Terzakis+%22The+Impact+of+Requirements+on+Software+Quality+across+Three+Product+Generations%22",
            "URLvideo": "",
            "PersonsString": "John Terzakis",
            "AffiliationsString": "Intel, USA",
            "Authors": [
                "John Terzakis @ Intel, USA"
            ],
            "Affiliations": [
                "Intel, USA"
            ],
            "Abstract": "Abstract--In a previous case study, we presented data demonstrating the impact that a well-written and well-reviewed set of requirements had on software defects and other quality indicators between two generations of an Intel product. The first generation was coded from an unorganized collection of requirements that were reviewed infrequently and informally. In contrast, the second was developed based on a set of requirements stored in a Requirements Management database and formally reviewed at each revision. Quality indicators for the second software product all improved dramatically even with the increased complexity of the newer product. This paper will recap that study and then present data from a subsequent Intel case study revealing that quality enhancements continued on the third generation of the product. The third generation software was designed and coded using the final set of requirements from the second version as a starting point. Key product differentiators included changes to operate with a new Intel processor, the introduction of new hardware platforms and the addition of approximately fifty new features. Software development methodologies were nearly identical, with only the change to a continuous build process for source code check-in added. Despite the enhanced functionality and complexity in the third generation software, requirements defects, software defects, software sightings, feature commit vs. delivery (feature variance), defect closure efficiency rates, and number of days from project commit to customer release all improved from the second to the third generation of the software.  Index terms-Requirements specification, requirements defects, reviews, software defects, software quality, multi-generational software products.",
            "Award": ""
        },
        {
            "Title": "Requirements Clinic: Third Party Inspection Methodology and Practice for Improving the Quality of Software Requirements Specifications",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p017-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DShinobu+Saito%2C+Mutsuki+Takeuchi%2C+Masatoshi+Hiraoka%2C+Tsuyoshi+Kitani%2C+and+Mikio+Aoyama+%22Requirements+Clinic%3A+Third+Party+Inspection+Methodology+and+Practice+for+Improving+the+Quality+of+Software+Requirements+Specifications%22",
            "URLvideo": "",
            "PersonsString": "Shinobu Saito, Mutsuki Takeuchi, Masatoshi Hiraoka, Tsuyoshi Kitani, and Mikio Aoyama",
            "AffiliationsString": "NTT DATA, Japan; Nanzan University, Japan",
            "Authors": [
                "Shinobu Saito @ NTT DATA, Japan",
                "Mutsuki Takeuchi @ NTT DATA, Japan",
                "Masatoshi Hiraoka @ NTT DATA, Japan",
                "Tsuyoshi Kitani @ NTT DATA, Japan",
                "Mikio Aoyama @ Nanzan University, Japan"
            ],
            "Affiliations": [
                "NTT DATA, Japan",
                "NTT DATA, Japan",
                "NTT DATA, Japan",
                "NTT DATA, Japan",
                "Nanzan University, Japan"
            ],
            "Abstract": "We have been involved in a number of large-scale software development projects, which might lead to loss of millions of dollars if failed. The quality of SRS (Software Requirements Specification) is the key to success of the software development. Review and inspection are common practices for the verification and validation of SRS. However, verification techniques used in projects might be characterized as ad hoc. In this article, we propose requirements clinic, a third party inspection methodology for improving the quality of the SRS. In order to systematically inspect a SRS, we developed a perspective-based inspection methodology based on PQM (Pragmatic Quality Model) of SRS. PQM is derived from IEEE Std. 830 from the perspective of pragmatic quality. To inspect a SRS according to PQM, we identified 198 inspection points, which lead to a quality score between 0 and 100. The requirements clinic advises to the requirements engineering team by a comprehensive quality inspection report including quality score, benchmark and SRS patterns for improvement. Since 2010, we have been practicing the methodology to a variety of development projects, and revealed an average of 10.6 ROI in 12 projects. We also discuss the feasibility of the methodology and lessons learned from the practices.",
            "Award": ""
        },
        {
            "Title": "Using Defect Taxonomies for Requirements Validation in Industrial Projects",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p012-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMichael+Felderer+and+Armin+Beer+%22Using+Defect+Taxonomies+for+Requirements+Validation+in+Industrial+Projects%22",
            "URLvideo": "",
            "PersonsString": "Michael Felderer and Armin Beer",
            "AffiliationsString": "University of Innsbruck, Austria; QE LaB Business Services, Austria; Beer Test Consulting, Austria",
            "Authors": [
                "Michael Felderer @ University of Innsbruck, Austria / QE LaB Business Services, Austria",
                "Armin Beer @ Beer Test Consulting, Austria"
            ],
            "Affiliations": [
                "University of Innsbruck, Austria / QE LaB Business Services, Austria",
                "Beer Test Consulting, Austria"
            ],
            "Abstract": "Quality of requirements is of great importance for the software development lifecycle as it influences all steps of software development. To ensure various quality attributes, suitable requirements validation techniques such as reviews or testing are essential. In this paper, we show how defect taxonomies can improve requirements reviews and testing. We point out how defect taxonomies can be seamlessly integrated into the requirements engineering process and discuss requirements validation with defect taxonomies as well as its benefits and the lessons learned with reference to industrial projects of a public health insurance institution where this approach has been successfully applied.",
            "Award": ""
        },
        {
            "Title": "Requirements Engineering for the Uganda Police Force Crime Records Management System",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p007-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAndrew+Muyanja%2C+Paul+Isaac+Musasizi%2C+Catherine+Nassimbwa%2C+Sandy+Stevens+Tickodri-Togboa%2C+Edward+Kale+Kayihura%2C+and+Amos+Ngabirano+%22Requirements+Engineering+for+the+Uganda+Police+Force+Crime+Records+Management+System%22",
            "URLvideo": "",
            "PersonsString": "Andrew Muyanja, Paul Isaac Musasizi, Catherine Nassimbwa, Sandy Stevens Tickodri-Togboa, Edward Kale Kayihura, and Amos Ngabirano",
            "AffiliationsString": "Makerere University, Uganda; Uganda Police Force, Uganda",
            "Authors": [
                "Andrew Muyanja @ Makerere University, Uganda",
                "Paul Isaac Musasizi @ Makerere University, Uganda",
                "Catherine Nassimbwa @ Makerere University, Uganda",
                "Sandy Stevens Tickodri-Togboa @ Makerere University, Uganda",
                "Edward Kale Kayihura @ Uganda Police Force, Uganda",
                "Amos Ngabirano @ Uganda Police Force, Uganda"
            ],
            "Affiliations": [
                "Makerere University, Uganda",
                "Makerere University, Uganda",
                "Makerere University, Uganda",
                "Makerere University, Uganda",
                "Uganda Police Force, Uganda",
                "Uganda Police Force, Uganda"
            ],
            "Abstract": "Abstract—This paper presents the requirements engineering process for the Uganda Police Force Crime Records Management System. The system was envisioned to substantially improve the performance of the crime records management function of the Uganda Police Force through strengthening the pertinent processes. The requirements engineering process involved definition of the system context and goals, requirements elicitation, analysis and specification. The process was championed by the ARMS Project, Makerere University. Following the successful requirements engineering process, the ARMS Project together with the Uganda Police Force embarked on a two year project to design, construct and deploy the envisioned Crime Records Management System at selected police sites in Uganda. The key challenges faced during the requirements engineering process, such as changes in the composition of the Uganda Police Force project team, requirements traceability, and low representation of business process owners, are also presented.",
            "Award": ""
        },
        {
            "Title": "The Integration of an RE Method and AHP: A Pilot Study in a Large Swiss Bank",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p021-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DArash+Golnam%2C+Gil+Regev%2C+Alain+Wegmann%2C+and+Sofia+Kyriakopoulou+%22The+Integration+of+an+RE+Method+and+AHP%3A+A+Pilot+Study+in+a+Large+Swiss+Bank%22",
            "URLvideo": "",
            "PersonsString": "Arash Golnam, Gil Regev, Alain Wegmann, and Sofia Kyriakopoulou",
            "AffiliationsString": "EPFL, Switzerland; Credit Suisse, Switzerland",
            "Authors": [
                "Arash Golnam @ EPFL, Switzerland",
                "Gil Regev @ EPFL, Switzerland",
                "Alain Wegmann @ EPFL, Switzerland",
                "Sofia Kyriakopoulou @ Credit Suisse, Switzerland"
            ],
            "Affiliations": [
                "EPFL, Switzerland",
                "EPFL, Switzerland",
                "EPFL, Switzerland",
                "Credit Suisse, Switzerland"
            ],
            "Abstract": "This paper reports on a pilot study of the integration between the Systemic Enterprise Architecture Method (SEAM) and the Analytic Hierarchy Process (AHP) in a requirements engineering project. The objective of the project, conducted in one of the major banks in Switzerland, was to select a common SOA tool that could satisfy the needs of two of the bank’s main business units, investment and private banking. SEAM provided help in identifying stakeholders, eliciting their requirements, and analyzing these requirements. The resulting requirements were then grouped and translated into selection criteria for the alternative SOA tools. Based on these criteria, the stakeholders chose the tool to be purchased using AHP. We describe the project, the challenges we faced and the lessons learned. These relate to the nature and traceability of requirements, to the requirements elicitation process and to the relations between the bank’s business units.",
            "Award": ""
        },
        {
            "Title": "Automatic Extraction of Glossary Terms from Natural Language Requirements",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p020-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAnurag+Dwarakanath%2C+Roshni+R.+Ramnani%2C+and+Shubhashis+Sengupta+%22Automatic+Extraction+of+Glossary+Terms+from+Natural+Language+Requirements%22",
            "URLvideo": "",
            "PersonsString": "Anurag Dwarakanath, Roshni R. Ramnani, and Shubhashis Sengupta",
            "AffiliationsString": "Accenture Technology Labs, India",
            "Authors": [
                "Anurag Dwarakanath @ Accenture Technology Labs, India",
                "Roshni R. Ramnani @ Accenture Technology Labs, India",
                "Shubhashis Sengupta @ Accenture Technology Labs, India"
            ],
            "Affiliations": [
                "Accenture Technology Labs, India",
                "Accenture Technology Labs, India",
                "Accenture Technology Labs, India"
            ],
            "Abstract": "We present a method for the automatic extraction of glossary terms from unconstrained natural language requirements. The glossary terms are identified in two steps – a) compute units (which are candidates for glossary terms) b) disambiguate between the mutually exclusive units to identify terms. We introduce novel linguistic techniques to identify process nouns, abstract nouns and auxiliary verbs. The identification of units also handles co-ordinating conjunctions and adjectival modifiers. This requires solving co-ordination ambiguity and adjectival modifier ambiguity. The identification of terms among the units adapts an in-document statistical metric. We present an evaluation of our method over a real-life set of software requirements’ documents and compare our results with that of a base algorithm. The intricate linguistic classification and the tackling of ambiguity result in superior performance of our approach over the base algorithm.",
            "Award": ""
        },
        {
            "Title": "An Approach to Carry Out Consistency Analysis on Requirements: Validating and Tracking Requirements through a Configuration Structure",
            "Type": "Industry Paper (6 pp)",
            "Key": "re13it-p011-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DPadmalata+Nistala+and+Priyanka+Kumari+%22An+Approach+to+Carry+Out+Consistency+Analysis+on+Requirements%3A+Validating+and+Tracking+Requirements+through+a+Configuration+Structure%22",
            "URLvideo": "",
            "PersonsString": "Padmalata Nistala and Priyanka Kumari",
            "AffiliationsString": "Tata Consultancy Services, India",
            "Authors": [
                "Padmalata Nistala @ Tata Consultancy Services, India",
                "Priyanka Kumari @ Tata Consultancy Services, India"
            ],
            "Affiliations": [
                "Tata Consultancy Services, India",
                "Tata Consultancy Services, India"
            ],
            "Abstract": "Requirements management and traceability have always been one of grand challenges in software development area. Studies reveal that 30- 40% of software defects can be traced to gaps or errors in requirements. Although several models and techniques have been defined to optimize the requirements process, ensuring alignment and consistency of elicited requirements continues to be a challenge. All software engineering standards and methodologies recognize the importance of maintaining relationships among the software elements for traceability. We have leveraged the structured relationships among the requirement elements to come up with an approach to systematically carry out consistency analysis of requirements for software systems. The framework has multiple models: a multi layered requirement model, a configuration structure to link and track the requirement items, a consistency analysis method to identify the inconsistencies in the requirements and a consistency index computation to indicate the level of consistency in overall requirements of the software system. This approach helps to validate the requirements from both completeness and correctness perspectives and also check their consistency in forward and backward directions. The paper outlines the framework, describes the encompassing models and the implementation details from pilot of the framework to an industry case study along with results. Keywords-requirement alignment, requirement configuration structure, requirement consistency analysis, requirement inconsistency matrix, requirement consistency index",
            "Award": ""
        },
        {
            "Title": "Requirements Bazaar: Social Requirements Engineering for Community-Driven Innovation",
            "Type": "Posters and Demos (2 pages)",
            "Key": "re13posters-id1-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDominik+Renzel%2C+Malte+Behrendt%2C+Ralf+Klamma%2C+and+Matthias+Jarke+%22Requirements+Bazaar%3A+Social+Requirements+Engineering+for+Community-Driven+Innovation%22",
            "URLvideo": "http%3A%2F%2Fyoutu.be%2Fu3f8xnEtT7I",
            "PersonsString": "Dominik Renzel, Malte Behrendt, Ralf Klamma, and Matthias Jarke",
            "AffiliationsString": "RWTH Aachen University, Germany",
            "Authors": [
                "Dominik Renzel @ RWTH Aachen University, Germany",
                "Malte Behrendt @ RWTH Aachen University, Germany",
                "Ralf Klamma @ RWTH Aachen University, Germany",
                "Matthias Jarke @ RWTH Aachen University, Germany"
            ],
            "Affiliations": [
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany"
            ],
            "Abstract": "The innovation potential of niche communities often remains inaccessible to service providers due to a lack of awareness and effective negotiation between these two groups. Requirements Bazaar, a browser-based social software for Social Requirements Engineering (SRE), aims at bringing together communities and service providers into such a negotiation process. Communities should be supported to express and trace their requirements and eventually receive a realization. Service providers should be supported in discovering relevant innovative requirements to maximize impact with a realization. In this paper we present Requirements Bazaar with focus on four aspects: requirements specification, a workflow for co-creation, workspace integration and personalizable requirements prioritization.",
            "Award": ""
        },
        {
            "Title": "A Safety Requirement Engineering Method and Tool",
            "Type": "Posters and Demos (2 pages)",
            "Key": "re13posters-id4-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DRomaric+Guillerm%2C+Hamid+Demmou%2C+and+Nabil+Sadou+%22A+Safety+Requirement+Engineering+Method+and+Tool%22",
            "URLvideo": "",
            "PersonsString": "Romaric Guillerm, Hamid Demmou, and Nabil Sadou",
            "AffiliationsString": "LAAS-CNRS, France; University of Toulouse, France; SUPELEC, France",
            "Authors": [
                "Romaric Guillerm @ LAAS-CNRS, France / University of Toulouse, France",
                "Hamid Demmou @ LAAS-CNRS, France / University of Toulouse, France",
                "Nabil Sadou @ SUPELEC, France"
            ],
            "Affiliations": [
                "LAAS-CNRS, France / University of Toulouse, France",
                "LAAS-CNRS, France / University of Toulouse, France",
                "SUPELEC, France"
            ],
            "Abstract": "Requirement engineering is one of the most critical system engineering processes, particularly when it deals with the safety requirements which are non-functional requirements and are related to emergent system properties. In fact, safety requirements must be formulated at system level and then be derived at sub-system level. The main objective of this paper is to present a new tool, \"SafetyLab\", which implements a method for safety treatment of complex systems. The method allows the definition of the system safety requirements following a risk and hazard analysis, and then their derivation according to a top-down approach. It is based on the famous Failure Mode, Effects, and Criticality Analysis (FMECA) and the use of Fault Trees.",
            "Award": ""
        },
        {
            "Title": "MIRA: A Tooling-Framework to Experiment with Model-Based Requirements Engineering",
            "Type": "Posters and Demos (2 pages)",
            "Key": "re13posters-id6-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DSabine+Teufl%2C+Dongyue+Mou%2C+and+Daniel+Ratiu+%22MIRA%3A+A+Tooling-Framework+to+Experiment+with+Model-Based+Requirements+Engineering%22",
            "URLvideo": "http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DrHENNFcLmdE",
            "PersonsString": "Sabine Teufl, Dongyue Mou, and Daniel Ratiu",
            "AffiliationsString": "Fortiss, Germany",
            "Authors": [
                "Sabine Teufl @ Fortiss, Germany",
                "Dongyue Mou @ Fortiss, Germany",
                "Daniel Ratiu @ Fortiss, Germany"
            ],
            "Affiliations": [
                "Fortiss, Germany",
                "Fortiss, Germany",
                "Fortiss, Germany"
            ],
            "Abstract": "Model-based requirements engineering supports eliciting, specifying and analyzing the work products elaborated during the requirements engineering process by providing adequate models. However, especially the inclusion of formal models needs to be investigated further. These models represent requirements and have to be integrated with reference models that define and structure the work results and their relations. We have developed the research tool MIRA to provide an infrastructure for the tool-based evaluation of the usage of models in the field of requirements engineering. In this paper we present the research questions addressed by MIRA concerning the reference model and the formal models. We explain how MIRA supports answering these research questions.",
            "Award": ""
        },
        {
            "Title": "PABRE-Proj: Applying Patterns in Requirements Elicitation",
            "Type": "Posters and Demos (2 pages)",
            "Key": "re13posters-id5-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DCristina+Palomares%2C+Carme+Quer%2C+and+Xavier+Franch+%22PABRE-Proj%3A+Applying+Patterns+in+Requirements+Elicitation%22",
            "URLvideo": "http%3A%2F%2Fyoutu.be%2FoZmUpfUS-KE",
            "PersonsString": "Cristina Palomares, Carme Quer, and Xavier Franch",
            "AffiliationsString": "Universitat Politècnica de Catalunya, Spain",
            "Authors": [
                "Cristina Palomares @ Universitat Politècnica de Catalunya, Spain",
                "Carme Quer @ Universitat Politècnica de Catalunya, Spain",
                "Xavier Franch @ Universitat Politècnica de Catalunya, Spain"
            ],
            "Affiliations": [
                "Universitat Politècnica de Catalunya, Spain",
                "Universitat Politècnica de Catalunya, Spain",
                "Universitat Politècnica de Catalunya, Spain"
            ],
            "Abstract": "Software requirement patterns have been proposed as a type of artifact for fostering requirements reuse. In this paper, we present PABRE-Proj, a tool aimed at supporting requirements elicitation and specification.",
            "Award": ""
        },
        {
            "Title": "A Tool Implementation of the Unified Requirements Modeling Language as Enterprise Architect Add-In",
            "Type": "Posters and Demos (2 pages)",
            "Key": "re13posters-id7-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DFlorian+Schneider%2C+Bernd+Bruegge%2C+and+Brian+Berenbach+%22A+Tool+Implementation+of+the+Unified+Requirements+Modeling+Language+as+Enterprise+Architect+Add-In%22",
            "URLvideo": "",
            "PersonsString": "Florian Schneider, Bernd Bruegge, and Brian Berenbach",
            "AffiliationsString": "TU Munich, Germany; Siemens, USA",
            "Authors": [
                "Florian Schneider @ TU Munich, Germany",
                "Bernd Bruegge @ TU Munich, Germany",
                "Brian Berenbach @ Siemens, USA"
            ],
            "Affiliations": [
                "TU Munich, Germany",
                "TU Munich, Germany",
                "Siemens, USA"
            ],
            "Abstract": "Early modeling languages have focused on the analysis and the design of systems under construction, but not on requirements elicitation. Consequently, a wide variety of approaches exists for the early phases of requirements engineer- ing, modeling various concepts as stakeholders, goals, features, product lines, systems, processes, risks, and requirements. The purpose of Unified Requirements Modeling Language (URMLTM) is to combine these concepts in a single modeling language. In addition, it strengthens support for danger modeling. URML is implemented as an add-in to the Enterprise Architect CASE tool. This tool demo will showcase the URML implementation.",
            "Award": ""
        },
        {
            "Title": "IRET: Requirements for Service Platforms",
            "Type": "Posters and Demos (2 pages)",
            "Key": "re13posters-id2-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLuciano+Baresi%2C+Gianluca+Ripa%2C+and+Liliana+Pasquale+%22IRET%3A+Requirements+for+Service+Platforms%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHnsosXQO7-c",
            "PersonsString": "Luciano Baresi, Gianluca Ripa, and Liliana Pasquale",
            "AffiliationsString": "Politecnico di Milano, Italy; Cefriel, Italy; Lero, Ireland; University of Limerick, Ireland",
            "Authors": [
                "Luciano Baresi @ Politecnico di Milano, Italy",
                "Gianluca Ripa @ Cefriel, Italy",
                "Liliana Pasquale @ Lero, Ireland / University of Limerick, Ireland"
            ],
            "Affiliations": [
                "Politecnico di Milano, Italy",
                "Cefriel, Italy",
                "Lero, Ireland / University of Limerick, Ireland"
            ],
            "Abstract": "This paper describes IRENE (Indenica Requirements ElicitatioN mEthod), a methodology to elicit and model the requirements of service platforms, and IRET (IREne Tool), the Eclipse-based modeling framework we developed for IRENE.",
            "Award": ""
        },
        {
            "Title": "Using TraceLab to Design, Execute, and Baseline Empirical Requirements Engineering Experiments",
            "Type": "Posters and Demos (2 pages)",
            "Key": "re13posters-id3-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJane+Cleland-Huang%2C+Adam+Czauderna%2C+and+Jane+Huffman+Hayes+%22Using+TraceLab+to+Design%2C+Execute%2C+and+Baseline+Empirical+Requirements+Engineering+Experiments%22",
            "URLvideo": "http%3A%2F%2Fyoutu.be%2Fsq5VgRBpAco",
            "PersonsString": "Jane Cleland-Huang, Adam Czauderna, and Jane Huffman Hayes",
            "AffiliationsString": "DePaul University, USA; University of Kentucky, USA",
            "Authors": [
                "Jane Cleland-Huang @ DePaul University, USA",
                "Adam Czauderna @ DePaul University, USA",
                "Jane Huffman Hayes @ University of Kentucky, USA"
            ],
            "Affiliations": [
                "DePaul University, USA",
                "DePaul University, USA",
                "University of Kentucky, USA"
            ],
            "Abstract": "As Requirements Engineering research continues to grow into a mature and rigorous discipline, an increasing focus is placed on the need for sound evaluation techniques that compare the benefits of a new solution against existing ones. In this tool demonstration we introduce TraceLab, an instrumented environment for modeling, executing, and comparatively evaluating experimental results. While initially developed for the Software Traceability domain, TraceLab provides a framework which can be populated with experiments, datasets,and reusable components for almost any empirical software engineering domain. In this demo we present examples from the Requirements Engineering domain.",
            "Award": ""
        },
        {
            "Title": "Requirements-Driven Adaptive Digital Forensics",
            "Type": "Posters and Demos (2 pages)",
            "Key": "re13posters-id8-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLiliana+Pasquale%2C+Yijun+Yu%2C+Mazeiar+Salehie%2C+Luca+Cavallaro%2C+Thein+Than+Tun%2C+and+Bashar+Nuseibeh+%22Requirements-Driven+Adaptive+Digital+Forensics%22",
            "URLvideo": "",
            "PersonsString": "Liliana Pasquale, Yijun Yu, Mazeiar Salehie, Luca Cavallaro, Thein Than Tun, and Bashar Nuseibeh",
            "AffiliationsString": "Lero, Ireland; Open University, UK",
            "Authors": [
                "Liliana Pasquale @ Lero, Ireland",
                "Yijun Yu @ Open University, UK",
                "Mazeiar Salehie @ Lero, Ireland",
                "Luca Cavallaro @ Lero, Ireland",
                "Thein Than Tun @ Open University, UK",
                "Bashar Nuseibeh @ Lero, Ireland / Open University, UK"
            ],
            "Affiliations": [
                "Lero, Ireland",
                "Open University, UK",
                "Lero, Ireland",
                "Lero, Ireland",
                "Open University, UK",
                "Lero, Ireland / Open University, UK"
            ],
            "Abstract": "We propose the use of forensic requirements to drive the automation of a digital forensics process. We augment traditional reactive digital forensics processes with proactive evidence collection and analysis activities, and provide immediate investigative suggestions before an investigation starts. These activities adapt depending on suspicious events, which in turn might require the collection and analysis of additional evidence. The reactive activities of a traditional digital forensics process are also adapted depending on the investigation findings.",
            "Award": ""
        },
        {
            "Title": "Identifying Top Challenges for International Research on Requirements Engineering for Systems of Systems Engineering",
            "Type": "Invited Paper (3 pages)",
            "Key": "re13panels-m1-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DCornelius+Ncube%2C+Soo+Ling+Lim%2C+and+Huseyin+Dogan+%22Identifying+Top+Challenges+for+International+Research+on+Requirements+Engineering+for+Systems+of+Systems+Engineering%22",
            "URLvideo": "",
            "PersonsString": "Cornelius Ncube, Soo Ling Lim, and Huseyin Dogan",
            "AffiliationsString": "Bournemouth University, UK",
            "Authors": [
                "Cornelius Ncube @ Bournemouth University, UK",
                "Soo Ling Lim @ Bournemouth University, UK",
                "Huseyin Dogan @ Bournemouth University, UK"
            ],
            "Affiliations": [
                "Bournemouth University, UK",
                "Bournemouth University, UK",
                "Bournemouth University, UK"
            ],
            "Abstract": "Due to an increasingly connected society and industry, our modern societal world and all industry sectors now increasingly depend on large-scale complex Systems of Systems (SoS). The emerging interdisciplinary area of SoS and Systems of Systems Engineering (SoSE) is largely driven by societal needs including public services such as health, transport, water, energy, food security, etc. The scale, complexities and challenges presented by SoS require us to go beyond traditional Requirements Engineering (RE) approaches. However, as is evident from publications in major Requirements Engineering conferences and journals, no significant effort has been expedited towards addressing specific RE issues for Systems of Systems Engineering. This panel explores key RE challenges in Systems of Systems Engineering, specifically, the areas in which the international RE community need to focus its research, and the approaches that are most likely to meet these challenges effectively. We first introduce Systems of Systems Engineering and outline key characteristics of SoS. We conclude by arguing that there is an urgent need for the global RE community to develop new ways of thinking, new capabilities and possibly a new science as a key mechanism for addressing requirements complexities posed by Systems of Systems.",
            "Award": ""
        },
        {
            "Title": "Ready-Set-Transfer: Technology Transfer in the Requirements Engineering Domain",
            "Type": "Invited Paper (2 pages)",
            "Key": "re13panels-m2-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJane+Cleland-Huang+and+Smitta+Ghaisas+%22Ready-Set-Transfer%3A+Technology+Transfer+in+the+Requirements+Engineering+Domain%22",
            "URLvideo": "",
            "PersonsString": "Jane Cleland-Huang and Smitta Ghaisas",
            "AffiliationsString": "DePaul University, USA; Tata Consultancy Services, India",
            "Authors": [
                "Jane Cleland-Huang @ DePaul University, USA",
                "Smitta Ghaisas @ Tata Consultancy Services, India"
            ],
            "Affiliations": [
                "DePaul University, USA",
                "Tata Consultancy Services, India"
            ],
            "Abstract": "Requirements engineering research is undertaken to propose innovative solutions, to develop concepts, algorithms, processes, and technologies, to validate effective solutions for important requirements-related problems, and ultimately to support the transition of important findings to practice. However prior studies have shown that successful projects often take from 20-25 years to reach the stage of full industry adoption, while many other projects fizzle out and never advance beyond the initial research phase. This panel provides the opportunity for practitioners and academics to engage in a meaningful discussion around the topic of technology transfer. In this third offering of the Ready-Set-Transfer panel, three research groups will present products that they believe to be industry-ready to a panel of industrial practitioners. Each team will receive feedback from the panelists. The long-term goal of the panel is to increase technology transfer in the requirements engineering domain.",
            "Award": ""
        },
        {
            "Title": "Future Directions of the RE Conference and Its Community",
            "Type": "Invited Paper (2 pages) (intro)",
            "Key": "re13panels-m3-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DNeil+Maiden+%22Future+Directions+of+the+RE+Conference+and+Its+Community%22",
            "URLvideo": "",
            "PersonsString": "Neil Maiden",
            "AffiliationsString": "City University London, UK",
            "Authors": [
                "Neil Maiden @ City University London, UK"
            ],
            "Affiliations": [
                "City University London, UK"
            ],
            "Abstract": "This short piece provides an introduction to a panel session that will take place at the RE’13 conference. The purpose of the panel will be to explore different possible future directions of the RE conference and its community. This piece outlines the arguments that will be made by each of the panelists to direct the conference and community towards different perspectives – both more academic- and practitioner-oriented.",
            "Award": ""
        },
        {
            "Title": "Requirements Engineering Conferences: Wither Industry Tracks?",
            "Type": "Invited Paper (4 pages)",
            "Key": "re13panels-m7-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DRoel+Wieringa%2C+Pascal+van+Eck%2C+and+John+Mylopoulos+%22Requirements+Engineering+Conferences%3A+Wither+Industry+Tracks%3F%22",
            "URLvideo": "",
            "PersonsString": "Roel Wieringa, Pascal van Eck, and John Mylopoulos",
            "AffiliationsString": "University of Twente, Netherlands; University of Trento, Italy",
            "Authors": [
                "Roel Wieringa @ University of Twente, Netherlands",
                "Pascal van Eck @ University of Twente, Netherlands",
                "John Mylopoulos @ University of Trento, Italy"
            ],
            "Affiliations": [
                "University of Twente, Netherlands",
                "University of Twente, Netherlands",
                "University of Trento, Italy"
            ],
            "Abstract": "This position paper argues that industry tracks have no place in any research conference. Instead, a research conference should always have room for industrial case studies, evaluated according to criteria for empirical research. Such case studies would not be acceptable at a practitioners' industrial conference, just as papers presented at such conferences would not be acceptable at research conferences. It follows as corollary that if researchers want to become familiar with problems and solutions of RE practice, they should visit industrial conferences.",
            "Award": ""
        },
        {
            "Title": "A New Paradigm for Applied Requirements Engineering Research",
            "Type": "Invited Paper (4 pages)",
            "Key": "re13panels-m6-p",
            "URL": "http%3A%2F%2Finfo.fundp.ac.be%2F%7Emma%2Fwordpress%2Fwp-content%2Fuploads%2F2013%2F06%2FApplied-RE-Research-Manifesto-for-Panel-Final-CRC.pdf",
            "URLvideo": "",
            "PersonsString": "Martin Mahaux and Alistair Mavin",
            "AffiliationsString": "University of Namur, Belgium; Rolls Royce, UK",
            "Authors": [
                "Martin Mahaux @ University of Namur, Belgium",
                "Alistair Mavin @ Rolls Royce, UK"
            ],
            "Affiliations": [
                "University of Namur, Belgium",
                "Rolls Royce, UK"
            ],
            "Abstract": "This position paper reflects on recent work that sought to make positive changes to the IEEE Requirements Engineering conference (RE), and on twenty years of requirements engineering (REng) research. We question the values that seem to underpin RE, and offer what we believe are more appropriate values. We argue that these new values would result in better alignment between research and the needs of industry. Further, the new values would encourage more rewarding work for researchers, and would lead to a better RE conference. We summarise the value shift in a draft manifesto for applied research in REng. To illustrate the potential for concrete changes, we suggest one possible wiki-based model for REng research that could deliver these new values.",
            "Award": ""
        },
        {
            "Title": "A Little Rebellion Now and Then Is a Good Thing: Views on the Requirements Engineering Conference",
            "Type": "Invited Paper (4 pages)",
            "Key": "re13panels-m5-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DTony+Gorschek+%22A+Little+Rebellion+Now+and+Then+Is+a+Good+Thing%3A+Views+on+the+Requirements+Engineering+Conference%22",
            "URLvideo": "",
            "PersonsString": "Tony Gorschek",
            "AffiliationsString": "Blekinge Institute of Technology, Sweden",
            "Authors": [
                "Tony Gorschek @ Blekinge Institute of Technology, Sweden"
            ],
            "Affiliations": [
                "Blekinge Institute of Technology, Sweden"
            ],
            "Abstract": "A little rebellion now and then is a good thing. This short position statement describes my views on some of the challenges associated with many conferences, the Requirements Engineering Conference being among them. The main concepts are; the goals, as well as criteria for paper selection for the conference should be defined explicitly, and shared with the community. Industry involvement in the conference should be increased, but the focus of all tracks should be quality – what constitutes quality however needs to be defined and agreed on. Industrial validation of research results have to be more than an intention. Last but not least, how papers are presented and discussed needs to change, focusing on quality over quantity.",
            "Award": ""
        },
        {
            "Title": "Top Tips You Can Apply Immediately to Projects: Highlights from the RE’13 Tutorials",
            "Type": "Invited Paper (3 pages)",
            "Key": "re13minitutorials-m8-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMaria+Lencastre+and+Joy+Beatty+%22Top+Tips+You+Can+Apply+Immediately+to+Projects%3A+Highlights+from+the+RE%E2%80%9913+Tutorials%22",
            "URLvideo": "",
            "PersonsString": "Maria Lencastre and Joy Beatty",
            "AffiliationsString": "UPE, Brazil; Seilevel, USA",
            "Authors": [
                "Maria Lencastre @ UPE, Brazil",
                "Joy Beatty @ Seilevel, USA"
            ],
            "Affiliations": [
                "UPE, Brazil",
                "Seilevel, USA"
            ],
            "Abstract": "This mini-tutorial highlights and conveys key practices in Requirements Engineering that can be applied in daily projects. It synthesizes the essence of six tutorials presented at the RE´13 Tutorial’s sessions, and so promotes a great opportunity for a wider audience to learn from practice and have knowledge transfer. Besides that, this session is a great stimulus to increase the global synergy between industry and academia.",
            "Award": ""
        },
        {
            "Title": "Winning the Hidden Battle: Requirements Tool Selection and Adoption",
            "Type": "Invited Paper (2 pages)",
            "Key": "re13minitutorials-m9-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJoy+Beatty+%22Winning+the+Hidden+Battle%3A+Requirements+Tool+Selection+and+Adoption%22",
            "URLvideo": "",
            "PersonsString": "Joy Beatty",
            "AffiliationsString": "Seilevel, USA",
            "Authors": [
                "Joy Beatty @ Seilevel, USA"
            ],
            "Affiliations": [
                "Seilevel, USA"
            ],
            "Abstract": "This mini-tutorial will provide an overview of one approach to a requirements management (RM) tool evaluation. The guidance will focus on how this evaluation process and results can be adapted to work in any organization. Finally, the mini-tutorial concludes with the major challenges organizations face in implementing RM tools and suggestions to overcome them.",
            "Award": ""
        },
        {
            "Title": "Practical Applications of i* in Industry: The State of the Art",
            "Type": "Invited Paper (2 pages)",
            "Key": "re13minitutorials-m10-p",
            "URL": "ftp%3A%2F%2Fftp.cs.toronto.edu%2Fpub%2Feric%2Fistar-minitut-RE13-EY.pdf",
            "URLvideo": "",
            "PersonsString": "Eric Yu, Daniel Amyot, Gunter Mussbacher, Xavier Franch, and Jaelson Castro",
            "AffiliationsString": "University of Toronto, Canada; University of Ottawa, Canada; Universitat Politècnica de Catalunya, Spain; UFPE, Brazil",
            "Authors": [
                "Eric Yu @ University of Toronto, Canada",
                "Daniel Amyot @ University of Ottawa, Canada",
                "Gunter Mussbacher @ University of Ottawa, Canada",
                "Xavier Franch @ Universitat Politècnica de Catalunya, Spain",
                "Jaelson Castro @ UFPE, Brazil"
            ],
            "Affiliations": [
                "University of Toronto, Canada",
                "University of Ottawa, Canada",
                "University of Ottawa, Canada",
                "Universitat Politècnica de Catalunya, Spain",
                "UFPE, Brazil"
            ],
            "Abstract": "i* is a goal-oriented and agent-oriented modeling framework that focuses on the analysis of intentional and strategic relationships among actors. In this mini-tutorial, we highlight a number of recent applications in practical industrial and business settings.",
            "Award": ""
        },
        {
            "Title": "RE@21 Spotlight: Most Influential Papers from the Requirements Engineering Conference",
            "Type": "Invited Paper (3 pages)",
            "Key": "re13specials-m11-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMartin+Glinz+and+Roel+Wieringa+%22RE%4021+Spotlight%3A+Most+Influential+Papers+from+the+Requirements+Engineering+Conference%22",
            "URLvideo": "",
            "PersonsString": "Martin Glinz and Roel Wieringa",
            "AffiliationsString": "University of Zurich, Switzerland; University of Twente, Netherlands",
            "Authors": [
                "Martin Glinz @ University of Zurich, Switzerland",
                "Roel Wieringa @ University of Twente, Netherlands"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "University of Twente, Netherlands"
            ],
            "Abstract": "Since 2003, an award has been presented annually at the IEEE International Requirements Engineering Conference for the Most Influential Paper presented at the conference 10 years previously. In 2013, we celebrate 21 years of the Require¬ments Engineering Conference, and we use this as an opportunity to reflect on the Most Influential Papers to date. Two sessions of the 2013 conference highlight the work of previous award winners and provide the authors with the opportunity to describe the trajectory of their work over the ten years that led to the award, and to discuss its impact since.",
            "Award": ""
        },
        {
            "Title": "Creative Collisions: Meet and Create: And Other “RE Interactive” Suggestions",
            "Type": "Invited Paper (2 pages)",
            "Key": "re13specials-m12-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMartin+Mahaux+and+David+Callele+%22Creative+Collisions%3A+Meet+and+Create%3A+And+Other+%E2%80%9CRE+Interactive%E2%80%9D+Suggestions%22",
            "URLvideo": "",
            "PersonsString": "Martin Mahaux and David Callele",
            "AffiliationsString": "University of Namur, Belgium; University of Saskatchewan, Canada",
            "Authors": [
                "Martin Mahaux @ University of Namur, Belgium",
                "David Callele @ University of Saskatchewan, Canada"
            ],
            "Affiliations": [
                "University of Namur, Belgium",
                "University of Saskatchewan, Canada"
            ],
            "Abstract": "The International IEEE Requirements Engineering conference (RE) is the premier international forum for requirements engineering. However, participant interaction mechanisms have not received significant recent attention and conference attendees have suggested that interaction support could be improved. The “RE Interactive” program is a first implementation step to increase the level and quality of interaction at RE. We present here a brief background to the initiative, describe in greater detail those initiatives being introduced this year and summarize possible initiatives for future years. We describe in greater detail the focal “RE Interactive” session: Creative Collisions. This session aims to explore the power of combinatorial creativity to create unexpected ideas for the RE community by promoting creative engagements between individuals, focusing on forging new relationships within the community.",
            "Award": ""
        },
        {
            "Title": "Workshops and Doctoral Symposium at RE’13: The Results: Presentation Session of New Ideas for Researchers and Practitioners Who Weren’t There",
            "Type": "Invited Paper (4 pages)",
            "Key": "re13specials-m13-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DOliver+Creighton+and+Marcos+Borges+%22Workshops+and+Doctoral+Symposium+at+RE%E2%80%9913%3A+The+Results%3A+Presentation+Session+of+New+Ideas+for+Researchers+and+Practitioners+Who+Weren%E2%80%99t+There%22",
            "URLvideo": "",
            "PersonsString": "Oliver Creighton and Marcos Borges",
            "AffiliationsString": "Siemens, Germany; UFRJ, Brazil",
            "Authors": [
                "Oliver Creighton @ Siemens, Germany",
                "Marcos Borges @ UFRJ, Brazil"
            ],
            "Affiliations": [
                "Siemens, Germany",
                "UFRJ, Brazil"
            ],
            "Abstract": "This paper describes the workshops held in conjunction with RE’13 and its corresponding presentation of results during the main conference. This paper presents the contents, structure, and format of the “Results” event: A slide show is followed by a poster session. This paper concludes with a complete list of all collocated workshops and their descriptions. The audience members of this session can expect a highly dynamic, interactive discussion of what went on during the workshops. All the interesting, new, controversial, and pioneering ideas of these exciting preceding events can be absorbed in a memorable, enjoyable and fun way.",
            "Award": ""
        },
        {
            "Title": "The Requirements Engineering Body of Knowledge (REBoK)",
            "Type": "Invited Paper (3 pages)",
            "Key": "re13specials-m14-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DBirgit+Penzenstadler%2C+Daniel+M%C3%A9ndez+Fern%C3%A1ndez%2C+Debra+Richardson%2C+David+Callele%2C+and+Krzysztof+Wnuk+%22The+Requirements+Engineering+Body+of+Knowledge+%28REBoK%29%22",
            "URLvideo": "",
            "PersonsString": "Birgit Penzenstadler, Daniel Méndez Fernández, Debra Richardson, David Callele, and Krzysztof Wnuk",
            "AffiliationsString": "UC Irvine, USA; TU Munich, Germany; University of Saskatchewan, Canada; Lund University, Sweden",
            "Authors": [
                "Birgit Penzenstadler @ UC Irvine, USA",
                "Daniel Méndez Fernández @ TU Munich, Germany",
                "Debra Richardson @ UC Irvine, USA",
                "David Callele @ University of Saskatchewan, Canada",
                "Krzysztof Wnuk @ Lund University, Sweden"
            ],
            "Affiliations": [
                "UC Irvine, USA",
                "TU Munich, Germany",
                "UC Irvine, USA",
                "University of Saskatchewan, Canada",
                "Lund University, Sweden"
            ],
            "Abstract": "A body of knowledge is a term used to represent the complete set of concepts, terms and activities that make up a professional domain. It encompasses the core teachings, skills and research in a field or industry. So far, the discipline of RE is lacking an official Requirements Engineering Body of Knowledge (REBoK).  This working session brings together researchers and practitioners to elaborate the goals, requirements and constraints for a REBoK that shall serve as commonly agreed basis for developing a draft over the following months.",
            "Award": ""
        },
        {
            "Title": "RE 2013 Doctoral Symposium",
            "Type": "Doctoral Symposium (1 page)",
            "Key": "re13doctoral-id300-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAna+Moreira+and+Paul+Gr%C3%BCnbacher+%22RE+2013+Doctoral+Symposium%22",
            "URLvideo": "",
            "PersonsString": "Ana Moreira and Paul Grünbacher",
            "AffiliationsString": "Universidade Nova de Lisboa, Portugal; JKU Linz, Austria",
            "Authors": [
                "Ana Moreira @ Universidade Nova de Lisboa, Portugal",
                "Paul Grünbacher @ JKU Linz, Austria"
            ],
            "Affiliations": [
                "Universidade Nova de Lisboa, Portugal",
                "JKU Linz, Austria"
            ],
            "Abstract": "The Doctoral Symposium brings together PhD students working in requirements engineering to facilitate the interaction among students and RE researchers. Students present their research and receive constructive feedback from a panel of senior researchers. The doctoral symposium is run in a highly interactive and workshop-like format.",
            "Award": ""
        },
        {
            "Title": "The Regulatory World and the Machine: Harmonizing Legal Requirements and the Systems They Affect",
            "Type": "Doctoral Symposium (4 pages)",
            "Key": "re13doctoral-id4-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDavid+G.+Gordon+%22The+Regulatory+World+and+the+Machine%3A+Harmonizing+Legal+Requirements+and+the+Systems+They+Affect%22",
            "URLvideo": "",
            "PersonsString": "David G. Gordon",
            "AffiliationsString": "CMU, USA",
            "Authors": [
                "David G. Gordon @ CMU, USA"
            ],
            "Affiliations": [
                "CMU, USA"
            ],
            "Abstract": "The past decade has seen a substantial increase in the issuance of privacy and security regulations governing personal information. Ensuring system and organizational compliance is both more important and more difficult than ever before, as the penalties have become more severe, and regulations more complex and nuanced. This also presents substantial difficulties for multi-national companies, as different states, countries, or regions do not adhere to a uniform standard, resulting in a mixed set of regulations for the systems they govern. In this work, I describe a framework to address this issue, referred to as requirements water marking, wherein requirements from different jurisdictions that govern the same system may be evaluated and reduced to a single standard of care, establishing a “high water mark” for regulatory compliance and reducing requirements complexity. The framework, which draws on work in requirements specification languages and requirements comparison, allows engineers and legal experts to systematically simplify compliance and determine both high and low standards of care, while maintaining traceability back to the original legal text. In addition, I investigate the proposed value of legal requirements models, demonstrating the relationship between proposed value of these models to organizational decision-making and the validity of the model.",
            "Award": ""
        },
        {
            "Title": "Evidence Management for Evolutionary Safety Assurance and Certification",
            "Type": "Doctoral Symposium (4 pages)",
            "Key": "re13doctoral-id2-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DSunil+Nair+%22Evidence+Management+for+Evolutionary+Safety+Assurance+and+Certification%22",
            "URLvideo": "",
            "PersonsString": "Sunil Nair",
            "AffiliationsString": "Simula Research Laboratory, Norway",
            "Authors": [
                "Sunil Nair @ Simula Research Laboratory, Norway"
            ],
            "Affiliations": [
                "Simula Research Laboratory, Norway"
            ],
            "Abstract": "Safety assurance and certification are amongst the most expensive and time-consuming activities in the development of safety-critical systems. Deeming a system to be safe involves gathering convincing evidence to argue the safe operation of the system, usually according to the requirements of some safety standard. To handle large collections of safety evidence effectively, practitioners need knowledge of how to classify different types of evidence, how to structure the evidence to show fulfillment of standards' requirements, and how to assess the evidence. However, the notion of evidence is vague and safety standards ́ requirements can be ambiguous and difficult to understand. Major problems also arise when a system evolves, as the body of safety evidence has to be adequately maintained in order to ensure system safety and allow its demonstration. In this context, this PhD aims to propose a framework for safety evidence management in evolutionary scenarios. The thesis work will concentrate on devising a model-based and customizable infrastructure for storage, manipulation, reuse, and analysis of evolving safety evidence. The infrastructure will be developed and evaluated in the scope of OPENCOSS,a large-scale European research project.",
            "Award": ""
        },
        {
            "Title": "Visual Analytics for Software Requirements Engineering",
            "Type": "Doctoral Symposium (4 pages)",
            "Key": "re13doctoral-id1-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DSandeep+Reddivari+%22Visual+Analytics+for+Software+Requirements+Engineering%22",
            "URLvideo": "",
            "PersonsString": "Sandeep Reddivari",
            "AffiliationsString": "Mississippi State University, USA",
            "Authors": [
                "Sandeep Reddivari @ Mississippi State University, USA"
            ],
            "Affiliations": [
                "Mississippi State University, USA"
            ],
            "Abstract": "The research on visual analytics for requirements engineering has noticeably advanced in the past few years. For many software projects, requirements management needs an effective and efficient path from data to decision. Visual analytics (VA) creates such a path that enables the user to extract insights by interacting with the relevant information. While various requirements visualization techniques exist, only few have produced end-to-end values to practitioners. In this research proposal, we advance the literature on visual requirements analytics by characterizing its key components and relationships. Such a characterization allows us to not only assess existing approaches, but also develop tool enhancements in a principled manner. We describe our ongoing work on VA and outline future research plans.",
            "Award": ""
        },
        {
            "Title": "Requirements Negotiation Model: A Social Oriented Approach for Software Ecosystems Evolution",
            "Type": "Doctoral Symposium (4 pages)",
            "Key": "re13doctoral-id3-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DGeorge+Valen%C3%A7a+%22Requirements+Negotiation+Model%3A+A+Social+Oriented+Approach+for+Software+Ecosystems+Evolution%22",
            "URLvideo": "",
            "PersonsString": "George Valença",
            "AffiliationsString": "UFPE, Brazil",
            "Authors": [
                "George Valença @ UFPE, Brazil"
            ],
            "Affiliations": [
                "UFPE, Brazil"
            ],
            "Abstract": "Software Ecosystems is becoming a relevant research topic by analysing the software industry as networked organisations based on a common interest in a central software technology. In this context, appropriately handling Requirements Engineering is a success factor for Software Platform Management. Nevertheless, recent research in this subject does not integrate the ecosystem’s social dimension to a business view during requirements negotiations. The state-of-the-art is generally concerned with challenges of achieving and agreed requirements understanding. Thereby, this PhD proposes a Requirements Negotiation Model to address the negotiation process through a more holistic perspective. It aims to present an insightful reasoning on how requirements negotiation collaborates to ecosystem’s health and success, defining negotiation strategies along Software Ecosystem evolution considering the Software Platform Management.",
            "Award": ""
        }
    ],
    "Sessions": [
        {
            "Id": "Aiva5shoha",
            "Title": "RE4SuSy",
            "ShortTitle": "RE4SuSy",
            "Type": "Co-located Workshop",
            "ShortType": "Co-located Workshop",
            "Key": "2013-07-15 09:00 RE4SuSy",
            "Day": "2013-07-15",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "ohlaih7ooT",
            "Title": "EmpiRE with GRIPP session",
            "ShortTitle": "EmpiRE with GRIPP session",
            "Type": "Co-located Workshop",
            "ShortType": "Co-located Workshop",
            "Key": "2013-07-15 09:00 EmpiRE with GRIPP session",
            "Day": "2013-07-15",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "thi2mieHae",
            "Title": "MoDRE",
            "ShortTitle": "MoDRE",
            "Type": "Co-located Workshop",
            "ShortType": "Co-located Workshop",
            "Key": "2013-07-15 09:00 MoDRE",
            "Day": "2013-07-15",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "ouweiG4ata",
            "Title": "Writing Good Requirements",
            "ShortTitle": "Writing Good Requirements",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2013-07-15 09:00 Writing Good Requirements",
            "Day": "2013-07-15",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "Phohte8Eey",
            "Title": "Doctoral Symposium",
            "ShortTitle": "Doctoral Symposium",
            "Type": "Doctoral Symposium",
            "ShortType": "Doctoral Symposium",
            "Key": "2013-07-15 09:00 Doctoral Symposium",
            "Day": "2013-07-15",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13DOCTORAL",
            "Abstract": "",
            "Items": [
                "re13doctoral-id300-p",
                "re13doctoral-id4-p",
                "re13doctoral-id2-p",
                "re13doctoral-id1-p",
                "re13doctoral-id3-p"
            ]
        },
        {
            "Id": "ooweuBa2la",
            "Title": "Applying Model Driven Engineering and Domain Specific Languages to Requirements Engineering",
            "ShortTitle": "Applying Model Driven Engineering and Domain Specific Languages to Requirements Engineering",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2013-07-15 14:30 Applying Model Driven Engineering and Domain Specific Languages to Requirements Engineering",
            "Day": "2013-07-15",
            "Time": "14:30 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "ohwoeToo3e",
            "Title": "ER@BR",
            "ShortTitle": "ER@BR",
            "Type": "Co-located Event",
            "ShortType": "Co-located Event",
            "Key": "2013-07-16 09:00 ER@BR",
            "Day": "2013-07-16",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "eeX0oe0Ijo",
            "Title": "TwinPeaks",
            "ShortTitle": "TwinPeaks",
            "Type": "Co-located Workshop",
            "ShortType": "Co-located Workshop",
            "Key": "2013-07-16 09:00 TwinPeaks",
            "Day": "2013-07-16",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "gaiD2viiPh",
            "Title": "CMA",
            "ShortTitle": "CMA",
            "Type": "Co-located Workshop",
            "ShortType": "Co-located Workshop",
            "Key": "2013-07-16 09:00 CMA",
            "Day": "2013-07-16",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "nair0Ic1ie",
            "Title": "RELAW",
            "ShortTitle": "RELAW",
            "Type": "Co-located Workshop",
            "ShortType": "Co-located Workshop",
            "Key": "2013-07-16 09:00 RELAW",
            "Day": "2013-07-16",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "ohV3vahroo",
            "Title": "RePa with REPOS session",
            "ShortTitle": "RePa with REPOS session",
            "Type": "Co-located Workshop",
            "ShortType": "Co-located Workshop",
            "Key": "2013-07-16 09:00 RePa with REPOS session",
            "Day": "2013-07-16",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "OhSh5phaev",
            "Title": "Observational and Experimental Case Study Research in Requirements Engineering: Methodology and Examples",
            "ShortTitle": "Observational and Experimental Case Study Research in Requirements Engineering: Methodology and Examples",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2013-07-16 09:00 Observational and Experimental Case Study Research in Requirements Engineering: Methodology and Examples",
            "Day": "2013-07-16",
            "Time": "09:00 - 12:30",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "ooLoh6ooqu",
            "Title": "Requirements Quality and Productivity Improvement Based on Examples Usage",
            "ShortTitle": "Requirements Quality and Productivity Improvement Based on Examples Usage",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2013-07-16 09:00 Requirements Quality and Productivity Improvement Based on Examples Usage",
            "Day": "2013-07-16",
            "Time": "09:00 - 12:30",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "UP9puQu1ie",
            "Title": "Implement Visual Models for Software Requirements Immediately",
            "ShortTitle": "Implement Visual Models for Software Requirements Immediately",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2013-07-16 09:00 Implement Visual Models for Software Requirements Immediately",
            "Day": "2013-07-16",
            "Time": "09:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "Xue5tei4di",
            "Title": "Model-Based Systems Requirements",
            "ShortTitle": "Model-Based Systems Requirements",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2013-07-16 14:30 Model-Based Systems Requirements",
            "Day": "2013-07-16",
            "Time": "14:30 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "maiTaNg4ru",
            "Title": "Message from the Chairs",
            "ShortTitle": "Message from the Chairs",
            "Type": "Plenary",
            "ShortType": "Plenary",
            "Key": "re13foreword-fm001-p",
            "Day": "2013-07-17",
            "Time": "09:00 - 09:15",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "Orlena Gotel",
            "Chairs": [
                "Orlena Gotel @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13FOREWORD",
            "Abstract": "",
            "Items": [
                "re13foreword-fm001-p"
            ]
        },
        {
            "Id": "phae9Veeme",
            "Title": "Requirements Engineering as Information Search and Idea Discovery (Keynote)",
            "ShortTitle": "Requirements Engineering as Information Search and Idea Discovery (Keynote)",
            "Type": "Keynotes",
            "ShortType": "Keynotes",
            "Key": "re13keynotes-k1-p",
            "Day": "2013-07-17",
            "Time": "09:15 - 10:30",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "Alistair Mavin",
            "Chairs": [
                "Alistair Mavin @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13KEYNOTES",
            "Abstract": "",
            "Items": [
                "re13keynotes-k1-p"
            ]
        },
        {
            "Id": "ou4zee7Eiv",
            "Title": "RE@21: Keeping Requirements on Track",
            "ShortTitle": "RE@21: Keeping Requirements on Track",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-17 11:00 RE@21: Keeping Requirements on Track",
            "Day": "2013-07-17",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Bashar Nuseibeh",
            "Chairs": [
                "Bashar Nuseibeh @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p022-p",
                "re13rt-p144-p",
                "re13rt-p065-p",
                "re13rt-p108-p"
            ]
        },
        {
            "Id": "yooSohl9ga",
            "Title": "Legal and Privacy Requirements",
            "ShortTitle": "Legal and Privacy Requirements",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-17 11:00 Legal and Privacy Requirements",
            "Day": "2013-07-17",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Jaelson Castro",
            "Chairs": [
                "Jaelson Castro @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p085-p",
                "re13rt-p111-p",
                "re13rt-p048-p"
            ]
        },
        {
            "Id": "thiezi3ICh",
            "Title": "Top Tips You Can Apply Immediately to Projects: Highlights from the RE’13 Tutorials",
            "ShortTitle": "Top Tips You Can Apply Immediately to Projects: Highlights from the RE’13 Tutorials",
            "Type": "Mini-Tutorials",
            "ShortType": "Mini-Tutorials",
            "Key": "re13minitutorials-m8-p",
            "Day": "2013-07-17",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "5",
            "ChairsString": "Joy Beatty and Maria Lencastre",
            "Chairs": [
                "Joy Beatty @",
                "Maria Lencastre @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13MINITUTORIALS",
            "Abstract": "",
            "Items": [
                "re13minitutorials-m8-p"
            ]
        },
        {
            "Id": "Seixelei8O",
            "Title": "Automated Traceability",
            "ShortTitle": "Automated Traceability",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-17 14:30 Automated Traceability",
            "Day": "2013-07-17",
            "Time": "14:30 - 16:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Barbara Paech",
            "Chairs": [
                "Barbara Paech @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p119-p",
                "re13rt-p006-p",
                "re13rt-p036-p"
            ]
        },
        {
            "Id": "Ahng1aeWoh",
            "Title": "Industry Challenges and Research Needs",
            "ShortTitle": "Industry Challenges and Research Needs",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2013-07-17 14:30 Industry Challenges and Research Needs",
            "Day": "2013-07-17",
            "Time": "14:30 - 16:00",
            "Location": "",
            "LocationIndex": "2",
            "ChairsString": "Marjo Kauppinen",
            "Chairs": [
                "Marjo Kauppinen @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13IT",
            "Abstract": "",
            "Items": [
                "re13it-p010-p",
                "re13it-p032-p",
                "re13it-p013-p",
                "re13it-p031-p"
            ]
        },
        {
            "Id": "Mikah4ohca",
            "Title": "Panel: Identifying Top Challenges for International Research on Requirements Engineering for Systems of Systems Engineering",
            "ShortTitle": "Panel: Identifying Top Challenges for International Research on Requirements Engineering for Systems of Systems Engineering",
            "Type": "Panels",
            "ShortType": "Panels",
            "Key": "2013-07-17 14:30 Panel: Identifying Top Challenges for International Research on Requirements Engineering for Systems of Systems Engineering",
            "Day": "2013-07-17",
            "Time": "14:30 - 16:00",
            "Location": "",
            "LocationIndex": "4",
            "ChairsString": "Cornelius Ncube",
            "Chairs": [
                "Cornelius Ncube @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13PANELS",
            "Abstract": "",
            "Items": [
                "re13panels-m1-p"
            ]
        },
        {
            "Id": "ahweiHo8oh",
            "Title": "Formal Modeling",
            "ShortTitle": "Formal Modeling",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-17 16:30 Formal Modeling",
            "Day": "2013-07-17",
            "Time": "16:30 - 18:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Zhi Jin",
            "Chairs": [
                "Zhi Jin @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p021-p",
                "re13rt-p030-p",
                "re13rt-p018-p"
            ]
        },
        {
            "Id": "ae2pei3aoH",
            "Title": "RE@21 Spotlight: Most Influential Papers from the Requirements Engineering Conference",
            "ShortTitle": "RE@21 Spotlight: Most Influential Papers from the Requirements Engineering Conference",
            "Type": "Special Sessions",
            "ShortType": "Special Sessions",
            "Key": "re13specials-m11-p",
            "Day": "2013-07-17",
            "Time": "16:30 - 18:00",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "Martin Glinz",
            "Chairs": [
                "Martin Glinz @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13SPECIALS",
            "Abstract": "",
            "Items": [
                "re13specials-m11-p"
            ]
        },
        {
            "Id": "ahkaisiPh0",
            "Title": "Creative Collisions: Meet and Create!",
            "ShortTitle": "Creative Collisions: Meet and Create!",
            "Type": "Special Sessions",
            "ShortType": "Special Sessions",
            "Key": "re13specials-m12-p",
            "Day": "2013-07-17",
            "Time": "16:30 - 18:00",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "Martin Mahaux and David Callele",
            "Chairs": [
                "Martin Mahaux @",
                "David Callele @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13SPECIALS",
            "Abstract": "",
            "Items": [
                "re13specials-m12-p"
            ]
        },
        {
            "Id": "LeePiewi1z",
            "Title": "Program Awards: RE&#039;13 Best Papers (Research and Industry) and Most Influential Paper from RE&#039;03",
            "ShortTitle": "Program Awards: RE&#039;13 Best Papers (Research and Industry) and Most Influential Paper from RE&#039;03",
            "Type": "Plenary",
            "ShortType": "Plenary",
            "Key": "2013-07-18 09:00 Program Awards: RE&#039;13 Best Papers (Research and Industry) and Most Influential Paper from RE&#039;03",
            "Day": "2013-07-18",
            "Time": "09:00 - 09:15",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "Orlena Gotel",
            "Chairs": [
                "Orlena Gotel @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "Tah6eefae6",
            "Title": "Starchitects and Jack-Hammers: Requirements Engineering Challenges and Practices in the Construction Industry (Keynote)",
            "ShortTitle": "Starchitects and Jack-Hammers: Requirements Engineering Challenges and Practices in the Construction Industry (Keynote)",
            "Type": "Keynotes",
            "ShortType": "Keynotes",
            "Key": "re13keynotes-k2-p",
            "Day": "2013-07-18",
            "Time": "09:15 - 10:30",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "Orlena Gotel",
            "Chairs": [
                "Orlena Gotel @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13KEYNOTES",
            "Abstract": "",
            "Items": [
                "re13keynotes-k2-p"
            ]
        },
        {
            "Id": "eigequahC2",
            "Title": "RE@21 Spotlight: Most Influential Papers from the Requirements Engineering Conference II",
            "ShortTitle": "RE@21 Spotlight: Most Influential Papers from the Requirements Engineering Conference II",
            "Type": "Special Sessions",
            "ShortType": "Special Sessions",
            "Key": "2013-07-18 11:00 RE@21 Spotlight: Most Influential Papers from the Requirements Engineering Conference II",
            "Day": "2013-07-18",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "Roel Wieringa",
            "Chairs": [
                "Roel Wieringa @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "Eequohnae1",
            "Title": "Elicitation in Theory and in Practice",
            "ShortTitle": "Elicitation in Theory and in Practice",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-18 11:00 Elicitation",
            "Day": "2013-07-18",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Stephen Morris",
            "Chairs": [
                "Stephen Morris @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p020-p",
                "re13it-p008-p",
                "re13rt-p084-p"
            ]
        },
        {
            "Id": "eeGh7yaey4",
            "Title": "Workshops and Doctoral Symposium at RE’13: The Results: Presentation Session of New Ideas for Researchers and Practitioners Who Weren’t There",
            "ShortTitle": "Workshops and Doctoral Symposium at RE’13: The Results: Presentation Session of New Ideas for Researchers and Practitioners Who Weren’t There",
            "Type": "Special Sessions",
            "ShortType": "Special Sessions",
            "Key": "re13specials-m13-p",
            "Day": "2013-07-18",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "Oliver Creighton and Marcos Borges",
            "Chairs": [
                "Oliver Creighton @",
                "Marcos Borges @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13SPECIALS",
            "Abstract": "",
            "Items": [
                "re13specials-m13-p"
            ]
        },
        {
            "Id": "so7oonuFoh",
            "Title": "Awards and Closing",
            "ShortTitle": "Awards and Closing",
            "Type": "Plenary",
            "ShortType": "Plenary",
            "Key": "2013-07-18 14:30 Awards and Closing",
            "Day": "2013-07-18",
            "Time": "14:30 - 16:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "Orlena Gotel",
            "Chairs": [
                "Orlena Gotel @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13",
            "Abstract": ""
        },
        {
            "Id": "phuoc3uThe",
            "Title": "New Perspectives on Requirements Sources",
            "ShortTitle": "New Perspectives on Requirements Sources",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-18 14:30 Requirements Sources",
            "Day": "2013-07-18",
            "Time": "14:30 - 16:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Didar Zowghi",
            "Chairs": [
                "Didar Zowghi @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p141-p",
                "re13rt-p091-p",
                "re13it-p016-p"
            ]
        },
        {
            "Id": "shaiZoh3Ux",
            "Title": "Posters and Demos",
            "ShortTitle": "Posters and Demos",
            "Type": "Posters and Demos",
            "ShortType": "Posters and Demos",
            "Key": "2013-07-18 14:30 Posters and Demos",
            "Day": "2013-07-18",
            "Time": "14:30 - 16:00",
            "Location": "",
            "LocationIndex": "3",
            "ChairsString": "Letícia Duboc and Birgit Penzenstadler",
            "Chairs": [
                "Letícia Duboc @",
                "Birgit Penzenstadler @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13POSTERS",
            "Abstract": "",
            "Items": [
                "re13posters-id1-p",
                "re13posters-id4-p",
                "re13posters-id6-p",
                "re13posters-id5-p",
                "re13posters-id7-p",
                "re13posters-id2-p",
                "re13posters-id3-p",
                "re13posters-id8-p"
            ]
        },
        {
            "Id": "Ho9ahf5nav",
            "Title": "Winning the Hidden Battle: Requirements Tool Selection and Adoption",
            "ShortTitle": "Winning the Hidden Battle: Requirements Tool Selection and Adoption",
            "Type": "Mini-Tutorials",
            "ShortType": "Mini-Tutorials",
            "Key": "re13minitutorials-m9-p",
            "Day": "2013-07-18",
            "Time": "14:30 - 16:00",
            "Location": "",
            "LocationIndex": "5",
            "ChairsString": "Nan Niu",
            "Chairs": [
                "Nan Niu @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13MINITUTORIALS",
            "Abstract": "",
            "Items": [
                "re13minitutorials-m9-p"
            ]
        },
        {
            "Id": "Aib6chia0b",
            "Title": "Handling Change",
            "ShortTitle": "Handling Change",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-18 16:30 Handling Change",
            "Day": "2013-07-18",
            "Time": "16:30 - 18:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Nelly Bencomo",
            "Chairs": [
                "Nelly Bencomo @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p057-p",
                "re13rt-p038-p",
                "re13rt-p005-p"
            ]
        },
        {
            "Id": "lai2eiN4ei",
            "Title": "Improving the Quality of Requirements in Practice",
            "ShortTitle": "Improving the Quality of Requirements in Practice",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2013-07-18 16:30 Improving the Quality of Requirements in Practice",
            "Day": "2013-07-18",
            "Time": "16:30 - 18:00",
            "Location": "",
            "LocationIndex": "2",
            "ChairsString": "Dan Berry",
            "Chairs": [
                "Dan Berry @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13IT",
            "Abstract": "",
            "Items": [
                "re13it-p009-p",
                "re13it-p017-p",
                "re13it-p012-p"
            ]
        },
        {
            "Id": "AeQu9eiloh",
            "Title": "Panel: Ready-Set-Transfer: Technology Transfer in the Requirements Engineering Domain",
            "ShortTitle": "Panel: Ready-Set-Transfer: Technology Transfer in the Requirements Engineering Domain",
            "Type": "Panels",
            "ShortType": "Panels",
            "Key": "2013-07-18 16:30 Panel: Ready-Set-Transfer: Technology Transfer in the Requirements Engineering Domain",
            "Day": "2013-07-18",
            "Time": "16:30 - 18:00",
            "Location": "",
            "LocationIndex": "4",
            "ChairsString": "Jane Cleland-Huang and Smita Ghaisas",
            "Chairs": [
                "Jane Cleland-Huang @",
                "Smita Ghaisas @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13PANELS",
            "Abstract": "",
            "Items": [
                "re13panels-m2-p"
            ]
        },
        {
            "Id": "Haf1lidoob",
            "Title": "Directions in Decentralized RE",
            "ShortTitle": "Directions in Decentralized RE",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-19 09:00 Directions in Decentralized RE",
            "Day": "2013-07-19",
            "Time": "09:00 - 10:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "João Araújo",
            "Chairs": [
                "João Araújo @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p123-p",
                "re13rt-p076-p",
                "re13rt-p115-p"
            ]
        },
        {
            "Id": "eRa0IeFaid",
            "Title": "RE Processes and Tools in Action",
            "ShortTitle": "RE Processes and Tools in Action",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2013-07-19 09:00 RE Processes and Tools in Action",
            "Day": "2013-07-19",
            "Time": "09:00 - 10:30",
            "Location": "",
            "LocationIndex": "2",
            "ChairsString": "Neil Ernst",
            "Chairs": [
                "Neil Ernst @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13IT",
            "Abstract": "",
            "Items": [
                "re13it-p007-p",
                "re13it-p021-p",
                "re13it-p020-p"
            ]
        },
        {
            "Id": "Da7aiVohvi",
            "Title": "The Requirements Engineering Body of Knowledge (REBoK)",
            "ShortTitle": "The Requirements Engineering Body of Knowledge (REBoK)",
            "Type": "Special Sessions",
            "ShortType": "Special Sessions",
            "Key": "re13specials-m14-p",
            "Day": "2013-07-19",
            "Time": "09:00 - 10:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "Birgit Penzenstadler, Debra Richardson, and David Calelle",
            "Chairs": [
                "Birgit Penzenstadler @",
                "Debra Richardson @",
                "David Calelle @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13SPECIALS",
            "Abstract": "",
            "Items": [
                "re13specials-m14-p"
            ]
        },
        {
            "Id": "hahCue3beo",
            "Title": "Traceability in Practice",
            "ShortTitle": "Traceability in Practice",
            "Type": "Research Track",
            "ShortType": "Research Track",
            "Key": "2013-07-19 11:00 Traceability in Practice",
            "Day": "2013-07-19",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Michael Panis",
            "Chairs": [
                "Michael Panis @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13RT",
            "Abstract": "",
            "Items": [
                "re13rt-p132-p",
                "re13it-p011-p",
                "re13rt-p127-p"
            ]
        },
        {
            "Id": "iexaeX0uno",
            "Title": "Panel: Future Directions of the RE Conference and Its Community",
            "ShortTitle": "Panel: Future Directions of the RE Conference and Its Community",
            "Type": "Panels",
            "ShortType": "Panels",
            "Key": "2013-07-19 11:00 Panel: Future Directions of the RE Conference and Its Community",
            "Day": "2013-07-19",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "4",
            "ChairsString": "Neil Maiden",
            "Chairs": [
                "Neil Maiden @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13PANELS",
            "Abstract": "",
            "Items": [
                "re13panels-m3-p",
                "re13panels-m7-p",
                "re13panels-m6-p",
                "re13panels-m5-p"
            ]
        },
        {
            "Id": "PhaSooxe3L",
            "Title": "Practical Applications of i* in Industry: The State of the Art",
            "ShortTitle": "Practical Applications of i* in Industry: The State of the Art",
            "Type": "Mini-Tutorials",
            "ShortType": "Mini-Tutorials",
            "Key": "re13minitutorials-m10-p",
            "Day": "2013-07-19",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "5",
            "ChairsString": "Seok Won Lee",
            "Chairs": [
                "Seok Won Lee @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13MINITUTORIALS",
            "Abstract": "",
            "Items": [
                "re13minitutorials-m10-p"
            ]
        },
        {
            "Id": "ohrie0Taix",
            "Title": "Brasilian Perspectives on Software Production (Keynote Panel)",
            "ShortTitle": "Brasilian Perspectives on Software Production (Keynote Panel)",
            "Type": "Keynotes",
            "ShortType": "Keynotes",
            "Key": "re13keynotes-k3-p",
            "Day": "2013-07-19",
            "Time": "14:30 - 16:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "Julio Cesar Leite",
            "Chairs": [
                "Julio Cesar Leite @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE13KEYNOTES",
            "Abstract": "",
            "Items": [
                "re13keynotes-k3-p"
            ]
        }
    ],
    "People": [
        {
            "Name": "Thomas A. Alspaugh",
            "Affiliation": "UC Irvine, USA",
            "Key": "Thomas A. Alspaugh @ UC Irvine, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Amyot",
            "Affiliation": "University of Ottawa, Canada",
            "Key": "Daniel Amyot @ University of Ottawa, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Annie I. Antón",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Annie I. Antón @ Georgia Tech, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mikio Aoyama",
            "Affiliation": "Nanzan University, Japan",
            "Key": "Mikio Aoyama @ Nanzan University, Japan",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "João Araújo",
            "Affiliation": "",
            "Key": "João Araújo @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Joanne M. Atlee",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Joanne M. Atlee @ University of Waterloo, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Luciano Baresi",
            "Affiliation": "Politecnico di Milano, Italy",
            "Key": "Luciano Baresi @ Politecnico di Milano, Italy",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Joy Beatty",
            "Affiliation": "Seilevel, USA",
            "Key": "Joy Beatty @ Seilevel, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Armin Beer",
            "Affiliation": "Beer Test Consulting, Austria",
            "Key": "Armin Beer @ Beer Test Consulting, Austria",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Razieh Behjati",
            "Affiliation": "Simula Research Laboratory, Norway",
            "Key": "Razieh Behjati @ Simula Research Laboratory, Norway",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Malte Behrendt",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Malte Behrendt @ RWTH Aachen University, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nelly Bencomo",
            "Affiliation": "",
            "Key": "Nelly Bencomo @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Brian Berenbach",
            "Affiliation": "Siemens, USA",
            "Key": "Brian Berenbach @ Siemens, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dan Berry",
            "Affiliation": "",
            "Key": "Dan Berry @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel M. Berry",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Daniel M. Berry @ University of Waterloo, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marcos Borges",
            "Affiliation": "UFRJ, Brazil",
            "Key": "Marcos Borges @ UFRJ, Brazil",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Travis D. Breaux",
            "Affiliation": "CMU, USA",
            "Key": "Travis D. Breaux @ CMU, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Karin K. Breitman",
            "Affiliation": "EMC, Brazil",
            "Key": "Karin K. Breitman @ EMC, Brazil",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bernd Bruegge",
            "Affiliation": "TU Munich, Germany",
            "Key": "Bernd Bruegge @ TU Munich, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Richard G. A. Bults",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Richard G. A. Bults @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Patrice Caire",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Patrice Caire @ University of Luxembourg, Luxembourg",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Callele",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "David Callele @ University of Saskatchewan, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jaelson Castro",
            "Affiliation": "",
            "Key": "Jaelson Castro @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jaelson Castro",
            "Affiliation": "UFPE, Brazil",
            "Key": "Jaelson Castro @ UFPE, Brazil",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Luca Cavallaro",
            "Affiliation": "Lero, Ireland",
            "Key": "Luca Cavallaro @ Lero, Ireland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhangji Chen",
            "Affiliation": "Mississippi State University, USA",
            "Key": "Zhangji Chen @ Mississippi State University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Cleland-Huang",
            "Affiliation": "",
            "Key": "Jane Cleland-Huang @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Cleland-Huang",
            "Affiliation": "DePaul University, USA",
            "Key": "Jane Cleland-Huang @ DePaul University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fiona Cousins",
            "Affiliation": "Arup, USA",
            "Key": "Fiona Cousins @ Arup, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Oliver Creighton",
            "Affiliation": "Siemens, Germany",
            "Key": "Oliver Creighton @ Siemens, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Adam Czauderna",
            "Affiliation": "DePaul University, USA",
            "Key": "Adam Czauderna @ DePaul University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Da Yang",
            "Affiliation": "ISCAS, China",
            "Key": "Da Yang @ ISCAS, China",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hamid Demmou",
            "Affiliation": "LAAS-CNRS, France / University of Toulouse, France",
            "Key": "Hamid Demmou @ LAAS-CNRS, France / University of Toulouse, France",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Dietrich",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "David Dietrich @ University of Waterloo, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Huseyin Dogan",
            "Affiliation": "Bournemouth University, UK",
            "Key": "Huseyin Dogan @ Bournemouth University, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Letícia Duboc",
            "Affiliation": "",
            "Key": "Letícia Duboc @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anurag Dwarakanath",
            "Affiliation": "Accenture Technology Labs, India",
            "Key": "Anurag Dwarakanath @ Accenture Technology Labs, India",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Julie B. Earp",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Julie B. Earp @ North Carolina State University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pascal van Eck",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Pascal van Eck @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jacob Eisenstein",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Jacob Eisenstein @ Georgia Tech, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Neil Ernst",
            "Affiliation": "",
            "Key": "Neil Ernst @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Felderer",
            "Affiliation": "University of Innsbruck, Austria / QE LaB Business Services, Austria",
            "Key": "Michael Felderer @ University of Innsbruck, Austria / QE LaB Business Services, Austria",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Méndez Fernández",
            "Affiliation": "TU Munich, Germany",
            "Key": "Daniel Méndez Fernández @ TU Munich, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xavier Franch",
            "Affiliation": "Universitat Politècnica de Catalunya, Spain",
            "Key": "Xavier Franch @ Universitat Politècnica de Catalunya, Spain",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Steffen Fuhrmann",
            "Affiliation": "BMW, Germany",
            "Key": "Steffen Fuhrmann @ BMW, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nicolas Genon",
            "Affiliation": "University of Namur, Belgium",
            "Key": "Nicolas Genon @ University of Namur, Belgium",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Smita Ghaisas",
            "Affiliation": "",
            "Key": "Smita Ghaisas @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Smitta Ghaisas",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Smitta Ghaisas @ Tata Consultancy Services, India",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Carlo Ghezzi",
            "Affiliation": "Politecnico di Milano, Italy",
            "Key": "Carlo Ghezzi @ Politecnico di Milano, Italy",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Glinz",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Martin Glinz @ University of Zurich, Switzerland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Arash Golnam",
            "Affiliation": "EPFL, Switzerland",
            "Key": "Arash Golnam @ EPFL, Switzerland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David G. Gordon",
            "Affiliation": "CMU, USA",
            "Key": "David G. Gordon @ CMU, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tony Gorschek",
            "Affiliation": "Blekinge Institute of Technology, Sweden",
            "Key": "Tony Gorschek @ Blekinge Institute of Technology, Sweden",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Orlena Gotel",
            "Affiliation": "",
            "Key": "Orlena Gotel @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Orlena Gotel",
            "Affiliation": "n.n., n.n.",
            "Key": "Orlena Gotel @ n.n., n.n.",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paul Grünbacher",
            "Affiliation": "JKU Linz, Austria",
            "Key": "Paul Grünbacher @ JKU Linz, Austria",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Romaric Guillerm",
            "Affiliation": "LAAS-CNRS, France / University of Toulouse, France",
            "Key": "Romaric Guillerm @ LAAS-CNRS, France / University of Toulouse, France",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jin Guo",
            "Affiliation": "DePaul University, USA",
            "Key": "Jin Guo @ DePaul University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dagný Hauksdóttir",
            "Affiliation": "DTU, Denmark",
            "Key": "Dagný Hauksdóttir @ DTU, Denmark",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hermie J. Hermens",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Hermie J. Hermens @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shokoofeh Hesari",
            "Affiliation": "Simula Research Laboratory, Norway / University of Oslo, Norway",
            "Key": "Shokoofeh Hesari @ Simula Research Laboratory, Norway / University of Oslo, Norway",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Patrick Heymans",
            "Affiliation": "University of Namur, Belgium",
            "Key": "Patrick Heymans @ University of Namur, Belgium",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Masatoshi Hiraoka",
            "Affiliation": "NTT DATA, Japan",
            "Key": "Masatoshi Hiraoka @ NTT DATA, Japan",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shinichi Honiden",
            "Affiliation": "NII, Japan",
            "Key": "Shinichi Honiden @ NII, Japan",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Huffman Hayes",
            "Affiliation": "University of Kentucky, USA",
            "Key": "Jane Huffman Hayes @ University of Kentucky, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Matthias Jarke",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Matthias Jarke @ RWTH Aachen University, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhi Jin",
            "Affiliation": "",
            "Key": "Zhi Jin @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marjo Kauppinen",
            "Affiliation": "",
            "Key": "Marjo Kauppinen @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Edward Kale Kayihura",
            "Affiliation": "Uganda Police Force, Uganda",
            "Key": "Edward Kale Kayihura @ Uganda Police Force, Uganda",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jörg Kienzle",
            "Affiliation": "McGill University, Canada",
            "Key": "Jörg Kienzle @ McGill University, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tsuyoshi Kitani",
            "Affiliation": "NTT DATA, Japan",
            "Key": "Tsuyoshi Kitani @ NTT DATA, Japan",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ralf Klamma",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Ralf Klamma @ RWTH Aachen University, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ivo Krka",
            "Affiliation": "University of Southern California, USA",
            "Key": "Ivo Krka @ University of Southern California, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Priyanka Kumari",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Priyanka Kumari @ Tata Consultancy Services, India",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tobias Kuschke",
            "Affiliation": "TU Ilmenau, Germany",
            "Key": "Tobias Kuschke @ TU Ilmenau, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sofia Kyriakopoulou",
            "Affiliation": "Credit Suisse, Switzerland",
            "Key": "Sofia Kyriakopoulou @ Credit Suisse, Switzerland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nekane Larburu",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Nekane Larburu @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Julio Cesar Sampaio do Prado Leite",
            "Affiliation": "PUC Rio, Brazil",
            "Key": "Julio Cesar Sampaio do Prado Leite @ PUC Rio, Brazil",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Roberto Leite",
            "Affiliation": "Siemens Chemtech, Brazil",
            "Key": "Roberto Leite @ Siemens Chemtech, Brazil",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maria Lencastre",
            "Affiliation": "UPE, Brazil",
            "Key": "Maria Lencastre @ UPE, Brazil",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Juan Li",
            "Affiliation": "ISCAS, China",
            "Key": "Juan Li @ ISCAS, China",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mingshu Li",
            "Affiliation": "ISCAS, China",
            "Key": "Mingshu Li @ ISCAS, China",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Soo Ling Lim",
            "Affiliation": "Bournemouth University, UK",
            "Key": "Soo Ling Lim @ Bournemouth University, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Walid Maalej",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Walid Maalej @ University of Hamburg, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Patrick Mäder",
            "Affiliation": "TU Ilmenau, Germany",
            "Key": "Patrick Mäder @ TU Ilmenau, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Mahaux",
            "Affiliation": "University of Namur, Belgium",
            "Key": "Martin Mahaux @ University of Namur, Belgium",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anas Mahmoud",
            "Affiliation": "Mississippi State University, USA",
            "Key": "Anas Mahmoud @ Mississippi State University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Neil Maiden",
            "Affiliation": "",
            "Key": "Neil Maiden @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Neil Maiden",
            "Affiliation": "City University London, UK",
            "Key": "Neil Maiden @ City University London, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mike Mannion",
            "Affiliation": "Glasgow Caledonian University, UK",
            "Key": "Mike Mannion @ Glasgow Caledonian University, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aaron K. Massey",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Aaron K. Massey @ Georgia Tech, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alistair Mavin",
            "Affiliation": "",
            "Key": "Alistair Mavin @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alistair Mavin",
            "Affiliation": "Rolls Royce, UK",
            "Key": "Alistair Mavin @ Rolls Royce, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jeremy C. Maxwell",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Jeremy C. Maxwell @ North Carolina State University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nancy R. Mead",
            "Affiliation": "SEI, USA",
            "Key": "Nancy R. Mead @ SEI, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nenad Medvidovic",
            "Affiliation": "University of Southern California, USA",
            "Key": "Nenad Medvidovic @ University of Southern California, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Claudio Menghi",
            "Affiliation": "Politecnico di Milano, Italy",
            "Key": "Claudio Menghi @ Politecnico di Milano, Italy",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Amir Molzam Sharifloo",
            "Affiliation": "Politecnico di Milano, Italy",
            "Key": "Amir Molzam Sharifloo @ Politecnico di Milano, Italy",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel L. Moody",
            "Affiliation": "Ozemantics, Australia",
            "Key": "Daniel L. Moody @ Ozemantics, Australia",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ana Moreira",
            "Affiliation": "Universidade Nova de Lisboa, Portugal",
            "Key": "Ana Moreira @ Universidade Nova de Lisboa, Portugal",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stephen Morris",
            "Affiliation": "",
            "Key": "Stephen Morris @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stephen J. Morris",
            "Affiliation": "City University London, UK",
            "Key": "Stephen J. Morris @ City University London, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dongyue Mou",
            "Affiliation": "Fortiss, Germany",
            "Key": "Dongyue Mou @ Fortiss, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paul Isaac Musasizi",
            "Affiliation": "Makerere University, Uganda",
            "Key": "Paul Isaac Musasizi @ Makerere University, Uganda",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gunter Mussbacher",
            "Affiliation": "University of Ottawa, Canada",
            "Key": "Gunter Mussbacher @ University of Ottawa, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andrew Muyanja",
            "Affiliation": "Makerere University, Uganda",
            "Key": "Andrew Muyanja @ Makerere University, Uganda",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "John Mylopoulos",
            "Affiliation": "University of Trento, Italy",
            "Key": "John Mylopoulos @ University of Trento, Italy",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sunil Nair",
            "Affiliation": "Simula Research Laboratory, Norway",
            "Key": "Sunil Nair @ Simula Research Laboratory, Norway",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hiroyuki Nakagawa",
            "Affiliation": "University of Electro-Communications, Japan",
            "Key": "Hiroyuki Nakagawa @ University of Electro-Communications, Japan",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Carlo Napolitano",
            "Affiliation": "IRCCCS Fondazione Salvarore Maugeri, Italy",
            "Key": "Carlo Napolitano @ IRCCCS Fondazione Salvarore Maugeri, Italy",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Catherine Nassimbwa",
            "Affiliation": "Makerere University, Uganda",
            "Key": "Catherine Nassimbwa @ Makerere University, Uganda",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cornelius Ncube",
            "Affiliation": "",
            "Key": "Cornelius Ncube @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cornelius Ncube",
            "Affiliation": "Bournemouth University, UK",
            "Key": "Cornelius Ncube @ Bournemouth University, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Amos Ngabirano",
            "Affiliation": "Uganda Police Force, Uganda",
            "Key": "Amos Ngabirano @ Uganda Police Force, Uganda",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ali Niknafs",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Ali Niknafs @ University of Waterloo, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Padmalata Nistala",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Padmalata Nistala @ Tata Consultancy Services, India",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nan Niu",
            "Affiliation": "Mississippi State University, USA",
            "Key": "Nan Niu @ Mississippi State University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bashar Nuseibeh",
            "Affiliation": "",
            "Key": "Bashar Nuseibeh @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bashar Nuseibeh",
            "Affiliation": "Lero, Ireland / Open University, UK",
            "Key": "Bashar Nuseibeh @ Lero, Ireland / Open University, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Akihiko Ohsuga",
            "Affiliation": "University of Electro-Communications, Japan",
            "Key": "Akihiko Ohsuga @ University of Electro-Communications, Japan",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Barbara Paech",
            "Affiliation": "",
            "Key": "Barbara Paech @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dennis Pagano",
            "Affiliation": "TU Munich, Germany",
            "Key": "Dennis Pagano @ TU Munich, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cristina Palomares",
            "Affiliation": "Universitat Politècnica de Catalunya, Spain",
            "Key": "Cristina Palomares @ Universitat Politècnica de Catalunya, Spain",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Panis",
            "Affiliation": "",
            "Key": "Michael Panis @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Liliana Pasquale",
            "Affiliation": "Lero, Ireland",
            "Key": "Liliana Pasquale @ Lero, Ireland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Liliana Pasquale",
            "Affiliation": "Lero, Ireland / University of Limerick, Ireland",
            "Key": "Liliana Pasquale @ Lero, Ireland / University of Limerick, Ireland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Birgit Penzenstadler",
            "Affiliation": "",
            "Key": "Birgit Penzenstadler @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Birgit Penzenstadler",
            "Affiliation": "UC Irvine, USA",
            "Key": "Birgit Penzenstadler @ UC Irvine, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Carme Quer",
            "Affiliation": "Universitat Politècnica de Catalunya, Spain",
            "Key": "Carme Quer @ Universitat Politècnica de Catalunya, Spain",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Roshni R. Ramnani",
            "Affiliation": "Accenture Technology Labs, India",
            "Key": "Roshni R. Ramnani @ Accenture Technology Labs, India",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ashwini Rao",
            "Affiliation": "CMU, USA",
            "Key": "Ashwini Rao @ CMU, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Ratiu",
            "Affiliation": "Fortiss, Germany",
            "Key": "Daniel Ratiu @ Fortiss, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sandeep Reddivari",
            "Affiliation": "Mississippi State University, USA",
            "Key": "Sandeep Reddivari @ Mississippi State University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gil Regev",
            "Affiliation": "EPFL, Switzerland",
            "Key": "Gil Regev @ EPFL, Switzerland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Patrick Rempel",
            "Affiliation": "TU Ilmenau, Germany",
            "Key": "Patrick Rempel @ TU Ilmenau, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dominik Renzel",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Dominik Renzel @ RWTH Aachen University, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Debra Richardson",
            "Affiliation": "UC Irvine, USA",
            "Key": "Debra Richardson @ UC Irvine, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gianluca Ripa",
            "Affiliation": "Cefriel, Italy",
            "Key": "Gianluca Ripa @ Cefriel, Italy",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jaime Sábat",
            "Affiliation": "Accenture, Brazil",
            "Key": "Jaime Sábat @ Accenture, Brazil",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nabil Sadou",
            "Affiliation": "SUPELEC, France",
            "Key": "Nabil Sadou @ SUPELEC, France",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shinobu Saito",
            "Affiliation": "NTT DATA, Japan",
            "Key": "Shinobu Saito @ NTT DATA, Japan",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mazeiar Salehie",
            "Affiliation": "Lero, Ireland",
            "Key": "Mazeiar Salehie @ Lero, Ireland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Frank Salger",
            "Affiliation": "City of Munich, Germany",
            "Key": "Frank Salger @ City of Munich, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Juha Savolainen",
            "Affiliation": "Danfoss Power Electronics, Denmark",
            "Key": "Juha Savolainen @ Danfoss Power Electronics, Denmark",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pete Sawyer",
            "Affiliation": "University of Lancaster, UK",
            "Key": "Pete Sawyer @ University of Lancaster, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Walt Scacchi",
            "Affiliation": "UC Irvine, USA",
            "Key": "Walt Scacchi @ UC Irvine, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Florian Schneider",
            "Affiliation": "TU Munich, Germany",
            "Key": "Florian Schneider @ TU Munich, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sagar Sen",
            "Affiliation": "Simula Research Laboratory, Norway",
            "Key": "Sagar Sen @ Simula Research Laboratory, Norway",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shubhashis Sengupta",
            "Affiliation": "Accenture Technology Labs, India",
            "Key": "Shubhashis Sengupta @ Accenture Technology Labs, India",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Norbert Seyff",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Norbert Seyff @ University of Zurich, Switzerland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lin Shi",
            "Affiliation": "ISCAS, China / UCAS, China",
            "Key": "Lin Shi @ ISCAS, China / UCAS, China",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marten van Sinderen",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Marten van Sinderen @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paola Spoletini",
            "Affiliation": "Universita dell’Insubria, Italy",
            "Key": "Paola Spoletini @ Universita dell’Insubria, Italy",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hakim Sultanov",
            "Affiliation": "University of Kentucky, USA",
            "Key": "Hakim Sultanov @ University of Kentucky, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alistair Sutcliffe",
            "Affiliation": "University of Lancaster, UK",
            "Key": "Alistair Sutcliffe @ University of Lancaster, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Peter P. Swire",
            "Affiliation": "Ohio State University, USA",
            "Key": "Peter P. Swire @ Ohio State University, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mutsuki Takeuchi",
            "Affiliation": "NTT DATA, Japan",
            "Key": "Mutsuki Takeuchi @ NTT DATA, Japan",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "John Terzakis",
            "Affiliation": "Intel, USA",
            "Key": "John Terzakis @ Intel, USA",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sabine Teufl",
            "Affiliation": "Fortiss, Germany",
            "Key": "Sabine Teufl @ Fortiss, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sandy Stevens Tickodri-Togboa",
            "Affiliation": "Makerere University, Uganda",
            "Key": "Sandy Stevens Tickodri-Togboa @ Makerere University, Uganda",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Irina Todoran",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Irina Todoran @ University of Zurich, Switzerland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Thein Than Tun",
            "Affiliation": "Open University, UK",
            "Key": "Thein Than Tun @ Open University, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "George Valença",
            "Affiliation": "UFPE, Brazil",
            "Key": "George Valença @ UFPE, Brazil",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jose Luis de la Vara",
            "Affiliation": "Simula Research Laboratory, Norway",
            "Key": "Jose Luis de la Vara @ Simula Research Laboratory, Norway",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andreas Vogelsang",
            "Affiliation": "TU Munich, Germany",
            "Key": "Andreas Vogelsang @ TU Munich, Germany",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eelco Vriezekolk",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Eelco Vriezekolk @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Junjie Wang",
            "Affiliation": "ISCAS, China / UCAS, China",
            "Key": "Junjie Wang @ ISCAS, China / UCAS, China",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Qing Wang",
            "Affiliation": "ISCAS, China",
            "Key": "Qing Wang @ ISCAS, China",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alain Wegmann",
            "Affiliation": "EPFL, Switzerland",
            "Key": "Alain Wegmann @ EPFL, Switzerland",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ing Widya",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Ing Widya @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Roel Wieringa",
            "Affiliation": "",
            "Key": "Roel Wieringa @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Roel Wieringa",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Roel Wieringa @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Krzysztof Wnuk",
            "Affiliation": "Lund University, Sweden",
            "Key": "Krzysztof Wnuk @ Lund University, Sweden",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "xxx",
            "Affiliation": "",
            "Key": "xxx @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eric Yu",
            "Affiliation": "University of Toronto, Canada",
            "Key": "Eric Yu @ University of Toronto, Canada",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yijun Yu",
            "Affiliation": "Open University, UK",
            "Key": "Yijun Yu @ Open University, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tao Yue",
            "Affiliation": "Simula Research Laboratory, Norway",
            "Key": "Tao Yue @ Simula Research Laboratory, Norway",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alireza Zarghami",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Alireza Zarghami @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohammad Zarifi Eslami",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Mohammad Zarifi Eslami @ University of Twente, Netherlands",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "He Zhang",
            "Affiliation": "University of East London, UK",
            "Key": "He Zhang @ University of East London, UK",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Didar Zowghi",
            "Affiliation": "",
            "Key": "Didar Zowghi @",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        }
    ]
}
 

