{
    "DataRevision": 1408347162,
    "Preliminary": "false",
    "Event": "RE 2014",
    "Name": "RE 2014",
    "Description": "",
    "Location": "Karlskrona, Sweden",
    "Sponsors": "",
    "URL": "http://webhotel.bth.se/re14/",
    "MultiTrack": "false",
    "UseMiniPage": "true",
    "NewPagePerDay": "false",
    "Organization": {
        "General Chairs": [
                "Tony Gorschek (General Chair)"
        ],
        "PC Chairs": [
                "Robyn Lutz (PC Chair)"
        ]
    },
    "SocialFeeds": [
    ],
    "VenueInfo": {
        "Name": "",
        "GPS": {
            "Latitude": 0,
            "Longitude": 0
        }
    },
    "InfoPage": {
        "xaml": "foo",
        "Elements": [
            {
                "XamlName": "ConferenceCenterMap",
                "Type": "Map",
                "GPS": {
                    "Latitude": 0,
                    "Longitude": 0
                },
                "MapLabel": ""
            },
            {
                "XamlName": "LicenseButton",
                "Type": "WebLink",
                "URL": "http://research.microsoft.com/en-US/projects/confapp/terms.aspx"
            },
            {
                "XamlName": "PrivacyButton",
                "Type": "WebLink",
                "URL": "http://privacy.microsoft.com/en-us/default.msp"
            }
        ]
    },
    "SessionPriorities": [
        "Award",
        "Invited Talk",
        "Other"
    ],
    "Items": [
        {
            "Title": "Rethinking Software: Business Change and the Consequences for Software Engineering (Keynote)",
            "Type": "Keynotes",
            "Key": "Anthony Finkelstein @ University College London, UK : Rethinking Software: Business Change and the Consequences for Software Engineering (Keynote)",
            "URL": "",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Anthony Finkelstein",
            "AffiliationsString": "University College London, UK",
            "Authors": [
                "Anthony Finkelstein @ University College London, UK"
            ],
            "Affiliations": [
                "University College London, UK"
            ],
            "Abstract": "",
            "Award": ""
        },
        {
            "Title": "Startups and Requirements (Keynote)",
            "Type": "Keynote Abstract",
            "Key": "re14key-key01-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAnthony+I.+Wasserman+%22Startups+and+Requirements+%28Keynote%29%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Anthony I. Wasserman",
            "AffiliationsString": "Carnegie Mellon University, USA",
            "Authors": [
                "Anthony I. Wasserman @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Tech startups typically approach requirements gathering differently from the process that is used to develop requirements in existing businesses and for existing products. Many of these startups operate in &quot;stealth mode&quot;, taking care to minimize the number of people with whom they share their innovative ideas. It&#039;s common for these startups to create a succession of early releases, and apply user feedback from those releases to evolve the features and functions of their products. This talk describes various approaches used by tech startups to define product requirements, and contrasts those approaches with those used in more traditional requirements engineering activities.",
            "Award": ""
        },
        {
            "Title": "Now More Than Ever: Privacy and Security Are Required (Keynote)",
            "Type": "Keynote Abstract",
            "Key": "re14key-key02-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAnnie+I.+Ant%C3%B3n+%22Now+More+Than+Ever%3A+Privacy+and+Security+Are+Required+%28Keynote%29%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Annie I. Antón",
            "AffiliationsString": "Georgia Tech, USA",
            "Authors": [
                "Annie I. Antón @ Georgia Tech, USA"
            ],
            "Affiliations": [
                "Georgia Tech, USA"
            ],
            "Abstract": "Properly protecting information is in all our best interests, but it is a complex undertaking. The fact that regulation is often written by non-technologists, introduces additional challenges and obstacles. Moreover, those who design systems that collect, store, and maintain sensitive information have an obligation to design systems holistically within this broader context of regulatory and legal compliance. There are questions that should be asked when developing new requirements for information systems. For example, how do we build systems to handle data that must be kept secure and private when relevant regulations tie your hands? When building a system that maintains health or financial records for a large number of people, what do we need to do to protect the information against theft and abuse, keep the information private, AND at the same time, satisfy all governing privacy/security laws and restrictions? Moreover, how do we know that we&#039;ve satisfied those laws? How do we monitor for compliance while ensuring that we&#039;re monitoring the right things? And, how do you accomplish all this in a way that can be expressed clearly to end-users and legislators (or auditors) so they can be confident you are doing the right things? We&#039;ve been working on technologies to make these tasks simpler, and in some senses, automatic. In this talk, I will describe some of the research that we have been conducting to address these problems.",
            "Award": ""
        },
        {
            "Title": "How Practitioners Approach Gameplay Requirements? An Exploration into the Context of Massive Multiplayer Online Role-Playing Games",
            "Type": "Full Paper",
            "Key": "re14main-mainp126-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMaya+Daneva+%22How+Practitioners+Approach+Gameplay+Requirements%3F+An+Exploration+into+the+Context+of+Massive+Multiplayer+Online+Role-Playing+Games%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Maya Daneva",
            "AffiliationsString": "University of Twente, Netherlands",
            "Authors": [
                "Maya Daneva @ University of Twente, Netherlands"
            ],
            "Affiliations": [
                "University of Twente, Netherlands"
            ],
            "Abstract": "Gameplay requirements are central to game development. In the business context of massive multiplayer online role-playing games (MMOGs) where game companies’ revenues rely on players&#039; monthly subscriptions, gameplay is also recognized as the key to player retention. However, information on what gameplay requirements are and how practitioners &#039;engineer&#039; them in real life is scarce. This exploratory study investigates how practitioners developing MMOGs reason about gameplay requirements and handle them in their projects. 12 practitioners from three leading MMOGs-producing companies were interviewed and their gameplay requirements documents were reviewed. The study’s most important findings are that in MMOG projects: (1) gameplay requirements are co-created with players, (2) are perceived and treated by practitioners as sets of choices and consequences, (3) gameplay is endless within a MMOG, and while gameplay requirements do not support any game-end goal, they do support a level-end goal, (4) &#039;paper-prototyping&#039; and play-testing are pivotal to gameplay validation, (5) balancing the elements of the gameplay is an on-going task, perceived as the most difficult and labor-consuming, (6) gameplay happens both in-game and out-of-the game. We conclude with discussion on validity threats to our results and on implications for research and practice.",
            "Award": ""
        },
        {
            "Title": "Therapist-Centered Requirements: A Multi-method Approach of Requirement Gathering to Support Rehabilitation Gaming",
            "Type": "Full Paper",
            "Key": "re14main-mainp035-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DCynthia+Putnam+and+Jinghui+Cheng+%22Therapist-Centered+Requirements%3A+A+Multi-method+Approach+of+Requirement+Gathering+to+Support+Rehabilitation+Gaming%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Cynthia Putnam and Jinghui Cheng",
            "AffiliationsString": "DePaul University, USA",
            "Authors": [
                "Cynthia Putnam @ DePaul University, USA",
                "Jinghui Cheng @ DePaul University, USA"
            ],
            "Affiliations": [
                "DePaul University, USA",
                "DePaul University, USA"
            ],
            "Abstract": "Brain injuries (BI) are recognized as a major public health issue. Many therapists include commercial motion-based videogames in their therapy sessions to help make rehabilitation exercises fun and engaging. Our initial exploratory work exposed a need for tools to help therapists make evidence-based decisions when choosing commercial motion-games for their patients who have had a BI. Targeting this need, we are gathering requirements for a case-based recommender (CBR) system that will act as a decision tool for therapists. In this paper, we describe our ongoing work as a case study that illustrates our multi-method approach of requirement elicitation for the CBR system. Our approach is comprised of four overlapping steps: (1) interviews with therapists, (2) onsite observations of therapy game sessions, (3) diary studies in which therapists record detailed information about game sessions, and (4) a user study of a CBR prototype interface. Leveraging direct interaction with end users (i.e., therapists), this case study demonstrates requirements gathering techniques to address needs of a special population (i.e., therapists who work with patients who had BIs) in a specialized context (i.e., inpatient rehabilitation using motion-based video games).",
            "Award": ""
        },
        {
            "Title": "Towards a Situation Awareness Design to Improve Visually Impaired Orientation in Unfamiliar Buildings: Requirements Elicitation Study",
            "Type": "Full Paper",
            "Key": "re14main-mainp074-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAbdulrhman+Alkhanifer+and+Stephanie+Ludi+%22Towards+a+Situation+Awareness+Design+to+Improve+Visually+Impaired+Orientation+in+Unfamiliar+Buildings%3A+Requirements+Elicitation+Study%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Abdulrhman Alkhanifer and Stephanie Ludi",
            "AffiliationsString": "Rochester Institute of Technology, USA",
            "Authors": [
                "Abdulrhman Alkhanifer @ Rochester Institute of Technology, USA",
                "Stephanie Ludi @ Rochester Institute of Technology, USA"
            ],
            "Affiliations": [
                "Rochester Institute of Technology, USA",
                "Rochester Institute of Technology, USA"
            ],
            "Abstract": "Requirements elicitation can be a challenging process in many systems. This challenge can be greater with a non-standard user population, such as visually impaired users. In this work, we report our experience and results of eliciting user requirements for a situation awareness indoor orientation system dedicated to the visually impaired. We elicited our initial system requirements through three different studies that focus on users along with orientation and mobility instructors. Also, we performed a knowledge elicitation through our studies to formulate our system’s situation awareness requirements.",
            "Award": ""
        },
        {
            "Title": "Supporting Early Decision-Making in the Presence of Uncertainty",
            "Type": "Full Paper",
            "Key": "re14main-mainp066-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJennifer+Horkoff%2C+Rick+Salay%2C+Marsha+Chechik%2C+and+Alessio+Di+Sandro+%22Supporting+Early+Decision-Making+in+the+Presence+of+Uncertainty%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jennifer Horkoff, Rick Salay, Marsha Chechik, and Alessio Di Sandro",
            "AffiliationsString": "University of Trento, Italy; University of Toronto, Canada",
            "Authors": [
                "Jennifer Horkoff @ University of Trento, Italy",
                "Rick Salay @ University of Toronto, Canada",
                "Marsha Chechik @ University of Toronto, Canada",
                "Alessio Di Sandro @ University of Toronto, Canada"
            ],
            "Affiliations": [
                "University of Trento, Italy",
                "University of Toronto, Canada",
                "University of Toronto, Canada",
                "University of Toronto, Canada"
            ],
            "Abstract": "Requirements Engineering (RE) involves eliciting, understanding, and capturing system requirements, which naturally involves much uncertainty. During RE, analysts choose among alternative requirements, gradually narrowing down the system scope, and it is unlikely that all requirements uncertainties can be resolved before such decisions are made. There is a need for methods to support early requirements decision-making in the presence of uncertainty. We address this need by describing a novel technique for early decision-making and tradeoff analysis using goal models with uncertainty. The technique analyzes goal satisfaction over sets of models that can result from resolving uncertainty. Users make choices over possible analysis results, allowing our tool to find critical uncertainty reductions which must be resolved. An iterative methodology guides the resolution of uncertainties necessary to achieve desired levels of goal satisfaction, supporting trade-off analysis in the presence of uncertainty.",
            "Award": ""
        },
        {
            "Title": "Integrating Exception Handling in Goal Models",
            "Type": "Full Paper",
            "Key": "re14main-mainp076-p",
            "URL": "http%3A%2F%2Fperso.uclouvain.be%2Fantoine.cailliau%2Fwp-content%2Fuploads%2F2014%2F06%2Fre14.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Antoine Cailliau and Axel van Lamsweerde",
            "AffiliationsString": "Université Catholique de Louvain, Belgium",
            "Authors": [
                "Antoine Cailliau @ Université Catholique de Louvain, Belgium",
                "Axel van Lamsweerde @ Université Catholique de Louvain, Belgium"
            ],
            "Affiliations": [
                "Université Catholique de Louvain, Belgium",
                "Université Catholique de Louvain, Belgium"
            ],
            "Abstract": "Missing requirements are known to be among the major sources of software failure. Incompleteness often results from poor anticipation of what could go wrong with an over-ideal system. Obstacle analysis is a model-based, goal-anchored form of risk analysis aimed at identifying, assessing and resolving exceptional conditions that may obstruct the behavioral goals of the target system. The obstacle resolution step is obviously crucial as it should result in more adequate and more complete requirements. In contrast with obstacle identification and assessment, however, this step has little support beyond a palette of resolution operators encoding tactics for producing isolated countermeasures to single risks. In particular, there is no single clue to date as to where and how such countermeasures should be integrated within a more robust goal model.  To address this problem, the paper describes a systematic technique for integrating obstacle resolutions as countermeasure goals into goal models. The technique is shown to guarantee progress towards a complete goal model; it preserves the correctness of refinements in the overall model; and keeps the original, ideal model visible to avoid cluttering the latter with a combinatorial blow-up of exceptional cases. To allow for this, the goal specification language is slightly extended in order to capture exceptions to goals seperately and distinguish normal situations from exceptional ones. The proposed technique is evaluated on a non-trivial ambulance dispatching system.",
            "Award": ""
        },
        {
            "Title": "Protos: Foundations for Engineering Innovative Sociotechnical Systems",
            "Type": "Full Paper",
            "Key": "re14main-mainp093-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAmit+K.+Chopra%2C+Fabiano+Dalpiaz%2C+F.+Ba%C5%9Fak+Aydemir%2C+Paolo+Giorgini%2C+John+Mylopoulos%2C+and+Munindar+P.+Singh+%22Protos%3A+Foundations+for+Engineering+Innovative+Sociotechnical+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Amit K. Chopra, Fabiano Dalpiaz, F. Başak Aydemir, Paolo Giorgini, John Mylopoulos, and Munindar P. Singh",
            "AffiliationsString": "Lancaster University, UK; Utrecht University, Netherlands; University of Trento, Italy; North Carolina State University, USA",
            "Authors": [
                "Amit K. Chopra @ Lancaster University, UK",
                "Fabiano Dalpiaz @ Utrecht University, Netherlands",
                "F. Başak Aydemir @ University of Trento, Italy",
                "Paolo Giorgini @ University of Trento, Italy",
                "John Mylopoulos @ University of Trento, Italy",
                "Munindar P. Singh @ North Carolina State University, USA"
            ],
            "Affiliations": [
                "Lancaster University, UK",
                "Utrecht University, Netherlands",
                "University of Trento, Italy",
                "University of Trento, Italy",
                "University of Trento, Italy",
                "North Carolina State University, USA"
            ],
            "Abstract": "We address the challenge of requirements engineering for sociotechnical systems, wherein humans and organizations supported by technical artifacts such as software interact with one another. Traditional requirements models emphasize the goals of the stakeholders above their interactions. However, the participants in a sociotechnical system may not adopt the goals of the stakeholders involved in its specification. We motivate, Protos, a requirements engineering approach that gives prominence to the interactions of autonomous parties and specifies a sociotechnical system in terms of its participants&#039; social relationships, specifically, commitments. The participants can adopt any goal they like, a key basis for innovative behavior, as long as they interact according to the commitments. Protos describes an abstract requirements engineering process as a series of refinements that seek to satisfy stakeholder requirements by incrementally expanding a specification set and an assumption set, and reducing requirements until all requirements are accommodated. We demonstrate this process via the London Ambulance System described in the literature.",
            "Award": ""
        },
        {
            "Title": "Automated Detection and Resolution of Legal Cross References: Approach and a Study of Luxembourg's Legislation",
            "Type": "Full Paper",
            "Key": "re14main-mainp009-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMorayo+Adedjouma%2C+Mehrdad+Sabetzadeh%2C+and+Lionel+C.+Briand+%22Automated+Detection+and+Resolution+of+Legal+Cross+References%3A+Approach+and+a+Study+of+Luxembourg%27s+Legislation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Morayo Adedjouma, Mehrdad Sabetzadeh, and Lionel C. Briand",
            "AffiliationsString": "University of Luxembourg, Luxembourg",
            "Authors": [
                "Morayo Adedjouma @ University of Luxembourg, Luxembourg",
                "Mehrdad Sabetzadeh @ University of Luxembourg, Luxembourg",
                "Lionel C. Briand @ University of Luxembourg, Luxembourg"
            ],
            "Affiliations": [
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg"
            ],
            "Abstract": "When elaborating compliance requirements, analysts need to follow the cross references in the underlying legal texts and consider the additional information in the cited provisions. To enable easier navigation and handling of cross references, automation is necessary for recognizing the natural language patterns used in cross reference expressions (cross reference detection), and for interpreting these expressions and linking them to the target provisions (cross reference resolution). In this paper, we propose a solution for automated detection and resolution of legal cross references. We ground our work on Luxembourg&#039;s legislative texts, both for studying the natural language patterns in cross reference expressions and for evaluating the accuracy and scalability of our solution.",
            "Award": ""
        },
        {
            "Title": "Goal-Oriented Compliance with Multiple Regulations",
            "Type": "Full Paper",
            "Key": "re14main-mainp098-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DSepideh+Ghanavati%2C+Andr%C3%A9+Rifaut%2C+Eric+Dubois%2C+and+Daniel+Amyot+%22Goal-Oriented+Compliance+with+Multiple+Regulations%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Sepideh Ghanavati, André Rifaut, Eric Dubois, and Daniel Amyot",
            "AffiliationsString": "CRP Henri Tudor, Luxembourg; University of Ottawa, Canada",
            "Authors": [
                "Sepideh Ghanavati @ CRP Henri Tudor, Luxembourg",
                "André Rifaut @ CRP Henri Tudor, Luxembourg",
                "Eric Dubois @ CRP Henri Tudor, Luxembourg",
                "Daniel Amyot @ University of Ottawa, Canada"
            ],
            "Affiliations": [
                "CRP Henri Tudor, Luxembourg",
                "CRP Henri Tudor, Luxembourg",
                "CRP Henri Tudor, Luxembourg",
                "University of Ottawa, Canada"
            ],
            "Abstract": "Most systems and business processes in organizations need to comply with more than one law or regulation. Different regulations can partially overlap (e.g., one can be more detailed than the other) or even conflict with each other. In addition, one regulation can permit an action whereas the same action in another regulation might be mandatory or forbidden. In each of these cases, an organization needs to take different strategies. This paper presents an approach to handle different situations when comparing and attempting to comply with multiple regulations as part of a goal-oriented modeling framework named LEGAL-URN. This framework helps organizations find suitable trade-offs and priorities when complying with multiple regulations while at the same time trying to meet their own business objectives. The approach is illustrated with a case study involving a Canadian health care organization that must comply with four laws related to privacy, quality of care, freedom of information, and care consent.",
            "Award": ""
        },
        {
            "Title": "Identifying and Classifying Ambiguity for Regulatory Requirements",
            "Type": "Full Paper",
            "Key": "re14main-mainp071-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAaron+K.+Massey%2C+Richard+L.+Rutledge%2C+Annie+I.+Ant%C3%B3n%2C+and+Peter+P.+Swire+%22Identifying+and+Classifying+Ambiguity+for+Regulatory+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Aaron K. Massey, Richard L. Rutledge, Annie I. Antón, and Peter P. Swire",
            "AffiliationsString": "Georgia Tech, USA",
            "Authors": [
                "Aaron K. Massey @ Georgia Tech, USA",
                "Richard L. Rutledge @ Georgia Tech, USA",
                "Annie I. Antón @ Georgia Tech, USA",
                "Peter P. Swire @ Georgia Tech, USA"
            ],
            "Affiliations": [
                "Georgia Tech, USA",
                "Georgia Tech, USA",
                "Georgia Tech, USA",
                "Georgia Tech, USA"
            ],
            "Abstract": "Software engineers build software systems in increasingly regulated environments, and must therefore ensure that software requirements accurately represent obligations described in laws and regulations. Prior research has shown that graduate-level software engineering students are not able to reliably determine whether software requirements meet or exceed their legal obligations and that professional software engineers are unable to accurately classify cross-references in legal texts. However, no research has determined whether software engineers are able to identify and classify important ambiguities in laws and regulations. Ambiguities in legal texts can make the difference between requirements compliance and non-compliance. Herein, we develop a ambiguity taxonomy based on software engineering, legal, and linguistic understandings of ambiguity. We examine how 17 technologists and policy analysts in a graduate-level course use this taxonomy to identify ambiguity in a legal text. We also examine the types of ambiguities they found and whether they believe those ambiguities should prevent software engineers from implementing software that complies with the legal text. Our research suggests that ambiguity is prevalent in legal texts. In 50 minutes of examination, participants in our case study identified on average 33.47 ambiguities in 104 lines of legal text using our ambiguity taxonomy as a guideline. Our analysis suggests (a) that participants used the taxonomy as intended: as a guide and (b) that the taxonomy provides adequate coverage (97.5%) of the ambiguities found in the legal text.",
            "Award": ""
        },
        {
            "Title": "An Approach for Decision Support on the Uncertainty in Feature Model Evolution",
            "Type": "Full Paper",
            "Key": "re14main-mainp065-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLe+Minh+Sang+Tran+and+Fabio+Massacci+%22An+Approach+for+Decision+Support+on+the+Uncertainty+in+Feature+Model+Evolution%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Le Minh Sang Tran and Fabio Massacci",
            "AffiliationsString": "University of Trento, Italy",
            "Authors": [
                "Le Minh Sang Tran @ University of Trento, Italy",
                "Fabio Massacci @ University of Trento, Italy"
            ],
            "Affiliations": [
                "University of Trento, Italy",
                "University of Trento, Italy"
            ],
            "Abstract": "Software systems could be seen as a hierarchy of features which are evolving due to the dynamic of the working environments. The companies who build software thus need to make an appropriate strategy, which takes into consideration of such dynamic, to select features to be implemented. In this work, we propose an approach to facilitate such selection by providing a means to capture the uncertainty of evolution in feature models. We also provide two analyses to support the decision makers. The approach is exemplified in the Smart Grid scenario.",
            "Award": ""
        },
        {
            "Title": "Maintaining Requirements for Long-Living Software Systems by Incorporating Security Knowledge",
            "Type": "Full Paper",
            "Key": "re14main-mainp131-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DStefan+G%C3%A4rtner%2C+Thomas+Ruhroth%2C+Jens+B%C3%BCrger%2C+Kurt+Schneider%2C+and+Jan+J%C3%BCrjens+%22Maintaining+Requirements+for+Long-Living+Software+Systems+by+Incorporating+Security+Knowledge%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Stefan Gärtner, Thomas Ruhroth, Jens Bürger, Kurt Schneider, and Jan Jürjens",
            "AffiliationsString": "Leibniz Universität Hannover, Germany; TU Dortmund, Germany",
            "Authors": [
                "Stefan Gärtner @ Leibniz Universität Hannover, Germany",
                "Thomas Ruhroth @ TU Dortmund, Germany",
                "Jens Bürger @ TU Dortmund, Germany",
                "Kurt Schneider @ Leibniz Universität Hannover, Germany",
                "Jan Jürjens @ TU Dortmund, Germany"
            ],
            "Affiliations": [
                "Leibniz Universität Hannover, Germany",
                "TU Dortmund, Germany",
                "TU Dortmund, Germany",
                "Leibniz Universität Hannover, Germany",
                "TU Dortmund, Germany"
            ],
            "Abstract": "Security is an increasingly important quality facet in modern information systems and needs to be retained. Due to a constantly changing environment, long-living software systems &quot;age&quot; not by wearing out, but by failing to keep up-to-date with their environment. The problem is that requirements engineers usually do not have a complete overview of the security-related knowledge necessary to retain security of long-living software systems. This includes security standards, principles and guidelines as well as reported security incidents. In this paper, we focus on the identification of known vulnerabilities (and their variations) in natural-language requirements by leveraging security knowledge. For this purpose, we present an integrative security knowledge model and a heuristic method to detect vulnerabilities in requirements based on reported security incidents. To support knowledge evolution, we further propose a method based on natural language analysis to refine and to adapt security knowledge. Our evaluation indicates that the proposed assessment approach detects vulnerable requirements more reliable than other methods (Bayes, SVM, k-NN). Thus, requirements engineers can react faster and more effectively to a changing environment that has an impact on the desired security level of the information system.",
            "Award": ""
        },
        {
            "Title": "Rationalism with a Dose of Empiricism: Case-Based Reasoning for Requirements-Driven Self-Adaptation",
            "Type": "Full Paper",
            "Key": "re14main-mainp062-p",
            "URL": "http%3A%2F%2Fwww.se.fudan.edu.cn%2Fpaper%2Fourpapers%2F235.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Wenyi Qian, Xin Peng, Bihuan Chen, John Mylopoulos, Huanhuan Wang, and Wenyun Zhao",
            "AffiliationsString": "Fudan University, China; University of Trento, Italy",
            "Authors": [
                "Wenyi Qian @ Fudan University, China",
                "Xin Peng @ Fudan University, China",
                "Bihuan Chen @ Fudan University, China",
                "John Mylopoulos @ University of Trento, Italy",
                "Huanhuan Wang @ Fudan University, China",
                "Wenyun Zhao @ Fudan University, China"
            ],
            "Affiliations": [
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China",
                "University of Trento, Italy",
                "Fudan University, China",
                "Fudan University, China"
            ],
            "Abstract": "Requirements-driven approaches provide an effective mechanism for self-adaptive systems by reasoning over their runtime requirements models to make adaptation decisions. However, such approaches usually assume that the relations among alternative behaviours, environmental parameters and requirements are clearly understood, which is often simply not true. Moreover, they do not consider the influence of the current behaviour of an executing system on adaptation decisions. In this paper, we propose an improved requirementsdriven self-adaptation approach that combines goal reasoning and case-based reasoning. In the approach, past experiences of successful adaptations are retained as adaptation cases, which are described by not only requirements violations and contexts, but also currently deployed behaviours. The approach does not depend on a set of original adaptation cases, but employs goal reasoning to provide adaptation solutions when no similar cases are available. And case-based reasoning is used to provide more precise adaptation decisions that better reflect the complex relations among requirements violations, contexts, and current behaviours by utilizing past experiences. Our experimental study with an online shopping benchmark shows that our approach outperforms both requirements-driven approach and case-based reasoning approach in terms of adaptation effectiveness and overall quality of the system.",
            "Award": ""
        },
        {
            "Title": "TiQi: Towards Natural Language Trace Queries",
            "Type": "Full Paper",
            "Key": "re14main-mainp038-p",
            "URL": "http%3A%2F%2Fre.cs.depaul.edu%2Fpapers%2F2014-RE-TIQI.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Piotr Pruski, Sugandha Lohar, Rundale Aquanette, Greg Ott, Sorawit Amornborvornwong, Alexander Rasin, and Jane Cleland-Huang",
            "AffiliationsString": "DePaul University, USA",
            "Authors": [
                "Piotr Pruski @ DePaul University, USA",
                "Sugandha Lohar @ DePaul University, USA",
                "Rundale Aquanette @ DePaul University, USA",
                "Greg Ott @ DePaul University, USA",
                "Sorawit Amornborvornwong @ DePaul University, USA",
                "Alexander Rasin @ DePaul University, USA",
                "Jane Cleland-Huang @ DePaul University, USA"
            ],
            "Affiliations": [
                "DePaul University, USA",
                "DePaul University, USA",
                "DePaul University, USA",
                "DePaul University, USA",
                "DePaul University, USA",
                "DePaul University, USA",
                "DePaul University, USA"
            ],
            "Abstract": "One of the surprising observations of traceability in practice is the under-utilization of existing trace links. Organizations often create links in order to meet compliance requirements, but then fail to capitalize on the potential benefits of those links to provide support for activities such as impact analysis, test regression selection, and coverage analysis. One of the major adoption barriers is caused by the lack of accessibility to the underlying trace data and the lack of skills many project stakeholders have for formulating complex trace queries. To address these challenges we introduce TiQi, a natural language approach, which allows users to write or speak trace queries in their own words. TiQi includes a vocabulary and associated grammar learned from analyzing NL queries collected from trace practitioners. It is evaluated against trace queries gathered from trace practitioners for two different project environments.",
            "Award": ""
        },
        {
            "Title": "Traceability-Enabled Refactoring for Managing Just-In-Time Requirements",
            "Type": "Full Paper",
            "Key": "re14main-mainp114-p",
            "URL": "http%3A%2F%2Fwww.cse.msstate.edu%2F%7Eniu%2Fpapers%2FRE14-Refactoring.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Nan Niu, Tanmay Bhowmik, Hui Liu, and Zhendong Niu",
            "AffiliationsString": "University of Cincinnati, USA; Mississippi State University, USA; Beijing Institute of Technology, China",
            "Authors": [
                "Nan Niu @ University of Cincinnati, USA",
                "Tanmay Bhowmik @ Mississippi State University, USA",
                "Hui Liu @ Beijing Institute of Technology, China",
                "Zhendong Niu @ Beijing Institute of Technology, China"
            ],
            "Affiliations": [
                "University of Cincinnati, USA",
                "Mississippi State University, USA",
                "Beijing Institute of Technology, China",
                "Beijing Institute of Technology, China"
            ],
            "Abstract": "Just-in-time requirements management, characterized by lightweight representation and continuous refinement of requirements, fits many iterative and incremental development projects. Being lightweight and flexible, however, can cause wasteful and procrastinated implementation, leaving certain stakeholder goals not satisfied. This paper proposes traceability-enabled refactoring aimed at fulfilling more requirements fully. We make a novel use of requirements traceability to accurately locate where the software should be refactored, and develop a new scheme to precisely determine what refactorings should be applied to the identified places. Our approach is evaluated through an industrial study. The results show that our approach recommends refactorings more appropriately than a contemporary recommender. Keywords: requirements management; just-in-time requirements; traceability; refactoring;",
            "Award": ""
        },
        {
            "Title": "Supporting Traceability through Affinity Mining",
            "Type": "Full Paper",
            "Key": "re14main-mainp084-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DVincenzo+Gervasi+and+Didar+Zowghi+%22Supporting+Traceability+through+Affinity+Mining%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Vincenzo Gervasi and Didar Zowghi",
            "AffiliationsString": "University of Pisa, Italy; University of Technology Sydney, Australia",
            "Authors": [
                "Vincenzo Gervasi @ University of Pisa, Italy",
                "Didar Zowghi @ University of Technology Sydney, Australia"
            ],
            "Affiliations": [
                "University of Pisa, Italy",
                "University of Technology Sydney, Australia"
            ],
            "Abstract": "Traceability among requirements artifacts (and beyond, in certain cases all the way to actual implementation) has long been identified as a critical challenge in industrial practice. Manually establishing and maintaining such traces is a high-skill, labour-intensive job. It is often the case that the ideal person for the job also has other, highly critical tasks to take care of, so offering semi-automated support for the management of traces is an effective way of improving the efficiency of the whole development process. In this paper, we present a technique to exploit the information contained in previously defined traces, in order to facilitate the creation and ongoing maintenance of traces, as the requirements evolve. A case study on a reference dataset is employed to measure the effectiveness of the technique, compared to other proposals from the literature.",
            "Award": ""
        },
        {
            "Title": "How Do Users Like This Feature? A Fine Grained Sentiment Analysis of App Reviews",
            "Type": "Full Paper",
            "Key": "re14main-mainp080-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DEmitza+Guzman+and+Walid+Maalej+%22How+Do+Users+Like+This+Feature%3F+A+Fine+Grained+Sentiment+Analysis+of+App+Reviews%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Emitza Guzman and Walid Maalej",
            "AffiliationsString": "TU München, Germany; University of Hamburg, Germany",
            "Authors": [
                "Emitza Guzman @ TU München, Germany",
                "Walid Maalej @ University of Hamburg, Germany"
            ],
            "Affiliations": [
                "TU München, Germany",
                "University of Hamburg, Germany"
            ],
            "Abstract": "App stores allow users to submit feedback for downloaded apps in form of star ratings and text reviews. Recent studies analyzed this feedback and found that it includes information useful for app developers, such as user requirements, ideas for improvements, user sentiments about specific features, and descriptions of experiences with these features. However, for many apps, the amount of reviews is too large to be processed manually and their quality varies largely. The star ratings are given to the whole app and developers do not have a mean to analyze the feedback for the single features.In this paper we propose an automated approach that helps developers filter,aggregate, and analyze user reviews. We use natural language processing techniques to identify fine-grained app features in the reviews. We then extract the user sentiments about the identified features and give them a general score across all reviews. Finally, we use topic modeling techniques to group fine-grained features into more meaningful high-level features. We evaluated our approach with 7 apps from the Apple App Store and Google Play Store and compared its results with a manually, peer-conducted analysis of the reviews. On average, our approach has a precision of 0.59 and a recall of 0.51. The extracted features were coherent and relevant to requirements evolution tasks. Our approach can help app developers to systematically analyze user opinions about single features and filter irrelevant reviews.",
            "Award": ""
        },
        {
            "Title": "Scaling Requirements Extraction to the Crowd: Experiments with Privacy Policies",
            "Type": "Full Paper",
            "Key": "re14main-mainp059-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DTravis+D.+Breaux+and+Florian+Schaub+%22Scaling+Requirements+Extraction+to+the+Crowd%3A+Experiments+with+Privacy+Policies%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Travis D. Breaux and Florian Schaub",
            "AffiliationsString": "Carnegie Mellon University, USA",
            "Authors": [
                "Travis D. Breaux @ Carnegie Mellon University, USA",
                "Florian Schaub @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Natural language text sources have increasingly been used to develop new methods and tools for extracting and analyzing requirements. To validate these new approaches, researchers rely on a small number of trained experts to perform a labor-intensive manual analysis of the text. The time and resources needed to conduct manual extraction, however, has limited the size of case studies and thus the generalizability of results. To begin to address this issue, we conducted three experiments to evaluate crowdsourcing a manual requirements extraction task to a larger number of untrained workers. In these experiments, we carefully balance worker payment and overall cost, as well as worker training and data quality to study the feasibility of distributing requirements extraction to the crowd. The task consists of extracting descriptions of data collection, sharing and usage requirements from privacy policies. We present results from two pilot studies and a third experiment to justify applying a task decomposition approach to requirements extraction. Our contributions include the task decomposition workflow and three metrics for measuring worker performance. The final evaluation shows a 60% reduction in the cost of manual extraction with a 16% increase in extraction coverage.",
            "Award": ""
        },
        {
            "Title": "Discovering Affect-Laden Requirements to Achieve System Acceptance",
            "Type": "Full Paper",
            "Key": "re14main-mainp101-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAlistair+Sutcliffe%2C+Paul+Rayson%2C+Christopher+N.+Bull%2C+and+Pete+Sawyer+%22Discovering+Affect-Laden+Requirements+to+Achieve+System+Acceptance%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Alistair Sutcliffe, Paul Rayson, Christopher N. Bull, and Pete Sawyer",
            "AffiliationsString": "Lancaster University, UK",
            "Authors": [
                "Alistair Sutcliffe @ Lancaster University, UK",
                "Paul Rayson @ Lancaster University, UK",
                "Christopher N. Bull @ Lancaster University, UK",
                "Pete Sawyer @ Lancaster University, UK"
            ],
            "Affiliations": [
                "Lancaster University, UK",
                "Lancaster University, UK",
                "Lancaster University, UK",
                "Lancaster University, UK"
            ],
            "Abstract": "Novel envisioned systems face the risk of rejection by their target user community and the requirements engineer must be sensitive to the factors that will determine acceptance or rejection. Conventionally, technology acceptance is determined by perceived usefulness and ease-of-use, but in some domains, other factors play an important role. In healthcare systems, particularly, ethical and emotional factors can be crucial. In this paper we describe an approach to requirements discovery that we developed for such systems. We describe how we have applied our approach to a novel system to passively monitor users for signs of cognitive decline consistent with the onset of dementia. A key challenge was eliciting users’ reactions to emotionally-charged events before they experienced them. Our goal was to understand the range of users’ emotional responses and their values and motivations, by a combination of manual and automated text analysis of interview transcripts. The analysis enabled formulation of requirements that would maximise the likelihood of acceptance of the system. The problem was heightened by the fact that the key stakeholders were elderly people who represent a poorly-studied user constituency. We discuss the elicitation and analysis methodologies used, and our experience with tool support. We conclude by reflecting on the issues affect for RE and for technology acceptance.",
            "Award": ""
        },
        {
            "Title": "Hidden in Plain Sight: Automatically Identifying Security Requirements from Natural Language Artifacts",
            "Type": "Full Paper",
            "Key": "re14main-mainp037-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMaria+Riaz%2C+Jason+King%2C+John+Slankas%2C+and+Laurie+Williams+%22Hidden+in+Plain+Sight%3A+Automatically+Identifying+Security+Requirements+from+Natural+Language+Artifacts%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fgo.ncsu.edu%2Fsecuritydiscoverer%2F",
            "DOI": "",
            "PersonsString": "Maria Riaz, Jason King, John Slankas, and Laurie Williams",
            "AffiliationsString": "North Carolina State University, USA",
            "Authors": [
                "Maria Riaz @ North Carolina State University, USA",
                "Jason King @ North Carolina State University, USA",
                "John Slankas @ North Carolina State University, USA",
                "Laurie Williams @ North Carolina State University, USA"
            ],
            "Affiliations": [
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "North Carolina State University, USA"
            ],
            "Abstract": "Abstract: Natural language artifacts, such as requirements specifications, often explicitly state the security requirements for software systems. However, these artifacts may also imply additional security requirements that developers may overlook but should consider to strengthen the overall security of the system. The goal of this research is to aid requirements engineers in producing a more comprehensive and classified set of security requirements by (1) automatically identifying security-relevant sentences in natural language requirements artifacts, and (2) providing context-specific security requirements templates to help translate the security-relevant sentences into functional security requirements. Using machine learning techniques, we have developed a tool-assisted process that takes as input a set of natural language artifacts. Our process automatically identifies security-relevant sentences in the artifacts and classifies them according to the security objectives, either explicitly stated or implied by the sentences. We classified 10,963 sentences in six different documents from healthcare domain and extracted corresponding security objectives. Our manual analysis showed that 46% of the sentences were security-relevant. Of these, 28% explicitly mention security while 72% of the sentences are functional requirements with security implications. Using our tool, we correctly predict and classify 82% of the security objectives for all the sentences (precision). We identify 79% of all security objectives implied by the sentences within the documents (recall). Based on our analysis, we develop context-specific templates that can be instantiated into a set of functional security requirements by filling in key information from security-relevant sentences. Keywords: Security Requirements; Security Objectives; Natural Language Artifacts; Machine Learning;",
            "Award": ""
        },
        {
            "Title": "Managing Security Requirements Patterns using Feature Diagram Hierarchies",
            "Type": "Full Paper",
            "Key": "re14main-mainp040-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DRocky+Slavin%2C+Jean-Michel+Lehker%2C+Jianwei+Niu%2C+and+Travis+D.+Breaux+%22Managing+Security+Requirements+Patterns+using+Feature+Diagram+Hierarchies%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Rocky Slavin, Jean-Michel Lehker, Jianwei Niu, and Travis D. Breaux",
            "AffiliationsString": "University of Texas at San Antonio, USA; Carnegie Mellon University, USA",
            "Authors": [
                "Rocky Slavin @ University of Texas at San Antonio, USA",
                "Jean-Michel Lehker @ University of Texas at San Antonio, USA",
                "Jianwei Niu @ University of Texas at San Antonio, USA",
                "Travis D. Breaux @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "University of Texas at San Antonio, USA",
                "University of Texas at San Antonio, USA",
                "University of Texas at San Antonio, USA",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Security requirements patterns represent reusable security practices that software engineers can apply to improve security in their system. Reusing best practices that others have employed could have a number of benefits, such as decreasing the time spent in the requirements elicitation process or improving the quality of the product by reducing product failure risk. Pattern selection can be difficult due to the diversity of applicable patterns from which an analyst has to choose. The challenge is that identifying the most appropriate pattern for a situation can be cumbersome and time-consuming. We propose a new method that combines an inquiry-cycle based approach with the feature diagram notation to review only relevant patterns and quickly select the most appropriate patterns for the situation. Similar to patterns themselves, our approach captures expert knowledge to relate patterns based on decisions made by the pattern user. The resulting pattern hierarchies allow users to be guided through these decisions by questions, which introduce related patterns in order to help the pattern user select the most appropriate patterns for their situation, thus resulting in better requirement generation. We evaluate our approach using access control patterns in a pattern user study.",
            "Award": ""
        },
        {
            "Title": "Engineering Topology Aware Adaptive Security: Preventing Requirements Violations at Runtime",
            "Type": "Full Paper",
            "Key": "re14main-mainp127-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DChristos+Tsigkanos%2C+Liliana+Pasquale%2C+Claudio+Menghi%2C+Carlo+Ghezzi%2C+and+Bashar+Nuseibeh+%22Engineering+Topology+Aware+Adaptive+Security%3A+Preventing+Requirements+Violations+at+Runtime%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Christos Tsigkanos, Liliana Pasquale, Claudio Menghi, Carlo Ghezzi, and Bashar Nuseibeh",
            "AffiliationsString": "Politecnico di Milano, Italy; Lero, Ireland; Open University, UK",
            "Authors": [
                "Christos Tsigkanos @ Politecnico di Milano, Italy",
                "Liliana Pasquale @ Lero, Ireland",
                "Claudio Menghi @ Politecnico di Milano, Italy",
                "Carlo Ghezzi @ Politecnico di Milano, Italy",
                "Bashar Nuseibeh @ Open University, UK / Lero, Ireland"
            ],
            "Affiliations": [
                "Politecnico di Milano, Italy",
                "Lero, Ireland",
                "Politecnico di Milano, Italy",
                "Politecnico di Milano, Italy",
                "Open University, UK / Lero, Ireland"
            ],
            "Abstract": "Adaptive security systems aim to protect critical assets in the face of changes in their operational environment. We have argued that incorporating an explicit representation of the environment&#039;s topology enables reasoning on the location of assets being protected and the proximity of potentially harmful agents. This paper proposes to engineer topology aware adaptive security systems by identifying violations of security requirements that may be caused by topological changes, and selecting a set of security controls that prevent such violations. Our approach focuses on physical topologies; it maintains at runtime a live representation of the topology which is updated when assets or agents move, or when the structure of the physical space is altered. When the topology changes, we look ahead at a subset of the future system states. These states are reachable when the agents move within the physical space. If security requirements can be violated in future system states, a configuration of security controls is proactively applied to prevent the system from reaching those states. Thus, the system continuously adapts to topological stimuli, while maintaining requirements satisfaction. Security requirements are formally expressed using a propositional temporal logic, encoding spatial properties in Computation Tree Logic (CTL). The Ambient Calculus is used to represent the topology of the operational environment - including location of assets and agents - as well as to identify future system states that are reachable from the current one. The approach is demonstrated and evaluated using a substantive example concerned with physical access control.",
            "Award": ""
        },
        {
            "Title": "Openness and Requirements: Opportunities and Tradeoffs in Software Ecosystems",
            "Type": "Full Paper",
            "Key": "re14main-mainp003-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DEric+Knauss%2C+Daniela+Damian%2C+Alessia+Knauss%2C+and+Arber+Borici+%22Openness+and+Requirements%3A+Opportunities+and+Tradeoffs+in+Software+Ecosystems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Eric Knauss, Daniela Damian, Alessia Knauss, and Arber Borici",
            "AffiliationsString": "Chalmers, Sweden; University of Gothenburg, Sweden; University of Victoria, Canada",
            "Authors": [
                "Eric Knauss @ Chalmers, Sweden / University of Gothenburg, Sweden",
                "Daniela Damian @ University of Victoria, Canada",
                "Alessia Knauss @ University of Victoria, Canada",
                "Arber Borici @ University of Victoria, Canada"
            ],
            "Affiliations": [
                "Chalmers, Sweden / University of Gothenburg, Sweden",
                "University of Victoria, Canada",
                "University of Victoria, Canada",
                "University of Victoria, Canada"
            ],
            "Abstract": "A growing number of software systems is characterized by continuous evolution as well as by significant interdependence with other systems (e.g. services, apps). Such software ecosystems promise increased innovation power and support for consumer oriented software services at scale, and are characterized by a certain openness of their information flows. While such openness supports project and reputation management, it also brings some challenges to Requirements Engineering (RE) within the ecosystem. We report from a mixed-method study of IBM&#039;s CLM ecosystem that uses an open commercial development model. We analyzed data from from interviews within several ecosystem actors, participatory observation, and software repositories, to describe the flow of product requirements information through the ecosystem, how the open communication paradigm in software ecosystems provides opportunities for &#039;just-in-time&#039; RE, as well as some of the challenges faced when traditional requirements engineering approaches are applied within such an ecosystem. More importantly, we discuss two tradeoffs brought about the openness in software ecosystems: i) allowing open, transparent communication while keeping intellectual property confidential within the ecosystem, and ii) having the ability to act globally on a long-term strategy while empowering product teams to act locally to answer end-users&#039; context specific needs in a timely manner.",
            "Award": ""
        },
        {
            "Title": "RISDM: A Requirements Inspection Systems Design Methodology: Perspective-Based Design of the Pragmatic Quality Model and Question Set to SRS",
            "Type": "Full Paper",
            "Key": "re14main-mainp018-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DShinobu+Saito%2C+Mutsuki+Takeuchi%2C+Setsuo+Yamada%2C+and+Mikio+Aoyama+%22RISDM%3A+A+Requirements+Inspection+Systems+Design+Methodology%3A+Perspective-Based+Design+of+the+Pragmatic+Quality+Model+and+Question+Set+to+SRS%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Shinobu Saito, Mutsuki Takeuchi, Setsuo Yamada, and Mikio Aoyama",
            "AffiliationsString": "NTT DATA, Japan; NTT, Japan; Nanzan University, Japan",
            "Authors": [
                "Shinobu Saito @ NTT DATA, Japan",
                "Mutsuki Takeuchi @ NTT DATA, Japan",
                "Setsuo Yamada @ NTT, Japan",
                "Mikio Aoyama @ Nanzan University, Japan"
            ],
            "Affiliations": [
                "NTT DATA, Japan",
                "NTT DATA, Japan",
                "NTT, Japan",
                "Nanzan University, Japan"
            ],
            "Abstract": "The quality of the SRS (Software Requirements Specification) is the key to the success of software development. The inspection for the verification and validation of SRS are widely practiced, however, the techniques of inspection are rather ad hoc, and largely depend on the knowledge and skill of the people. This article proposes RISDM (Requirements Inspection Systems Design Methodology) to design the RIS (Requirements Inspection System) to be conducted by a third-party inspection team. The RISDM includes a meta-model and design process of RIS, PQM (Pragmatic Quality Model) of SRS, and a technique to generate inspection question set based on the PQM and PBR (Perspective-Based Reading). We have been applying the RIS designed by the proposed RISDM to more than 140 projects of a wide variety of software systems in NTT DATA for five years. By analyzing the statistics from the experience, we discovered some key quality characteristics of SRS reveal strong correlation to the project cost and level of quality to be used for evaluating the maturity of the SRS and predicting the risk. Keyword- Requirements Inspection; Requirements Verification and Validation; SRS; Pragmatic Quality Model; Question Set; Risk Prediction;",
            "Award": ""
        },
        {
            "Title": "Tackling the Requirements Jigsaw Puzzle",
            "Type": "Full Paper",
            "Key": "re14main-mainp136-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMaria+Pinto-Albuquerque+and+Awais+Rashid+%22Tackling+the+Requirements+Jigsaw+Puzzle%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Maria Pinto-Albuquerque and Awais Rashid",
            "AffiliationsString": "Lisbon University Institute, Portugal; Lancaster University, UK",
            "Authors": [
                "Maria Pinto-Albuquerque @ Lisbon University Institute, Portugal / Lancaster University, UK",
                "Awais Rashid @ Lancaster University, UK"
            ],
            "Affiliations": [
                "Lisbon University Institute, Portugal / Lancaster University, UK",
                "Lancaster University, UK"
            ],
            "Abstract": "Abstract—A key challenge during stakeholder meetings is that of presenting the requirements and conflicts to stakeholders in a way that fosters co-responsibility and co-ownership regarding the conflicts and their resolution. In this paper, we propose a jigsaw puzzle metaphor to make identified conflicts explicit as well as an associated method to utilise this metaphor during stakeholder meetings. The metaphor provides an easy to understand language for stakeholders from otherwise diverse backgrounds. It enables stakeholders to work with a well-understood concept - that of building a system from misshapen pieces. These characteristics foster communication and team work, which improve commitment of stakeholders in co-authoring of requirements and co-responsibility in conflict handling. The gamification of conflict resolution also promotes a relaxed environment, which in turn improves team cooperation and creativity. Our experience in three user studies demonstrates that the jigsaw puzzle indeed improves such co-responsibility and co-ownership when compared with typical text-based representations of requirements. Index Terms—Requirements, conflict, creativity, game, jigsaw puzzle, stakeholders, team work, communication, metaphor, visualization.",
            "Award": ""
        },
        {
            "Title": "Automated Support for Combinational Creativity in Requirements Engineering",
            "Type": "Full Paper",
            "Key": "re14main-mainp110-p",
            "URL": "http%3A%2F%2Fwww.cse.msstate.edu%2F%7Eniu%2Fpapers%2FRE14-Creativity.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tanmay Bhowmik, Nan Niu, Anas Mahmoud, and Juha Savolainen",
            "AffiliationsString": "Mississippi State University, USA; University of Cincinnati, USA; Danfoss, Denmark",
            "Authors": [
                "Tanmay Bhowmik @ Mississippi State University, USA",
                "Nan Niu @ University of Cincinnati, USA",
                "Anas Mahmoud @ Mississippi State University, USA",
                "Juha Savolainen @ Danfoss, Denmark"
            ],
            "Affiliations": [
                "Mississippi State University, USA",
                "University of Cincinnati, USA",
                "Mississippi State University, USA",
                "Danfoss, Denmark"
            ],
            "Abstract": "Requirements engineering (RE), framed as a creative problem solving process, plays a key role in innovating more useful and novel requirements and improving a software system&#039;s sustainability. Existing approaches, such as creativity workshops and feature mining from web services, facilitate creativity by exploring a search space of partial and complete possibilities of requirements. To further advance the literature, we support creativity from a combinational perspective, i.e., making unfamiliar connections between familiar possibilities of requirements. In particular, we propose a novel framework that extracts familiar ideas from the requirements and stakeholders&#039; comments using topic modeling and applies part-of-speech tagging to obtain unfamiliar idea combinations. We apply our framework on two large open-source software systems and further report a human subject evaluation. The results show that our framework complements existing approaches by generating original and relevant requirements in an automated manner. Keywords - Requirements engineering; creativity; topic modeling; requirements elicitation",
            "Award": ""
        },
        {
            "Title": "Automated Extraction and Visualization of Quality Concerns from Requirements Specifications",
            "Type": "Full Paper",
            "Key": "re14main-mainp039-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMona+Rahimi%2C+Mehdi+Mirakhorli%2C+and+Jane+Cleland-Huang+%22Automated+Extraction+and+Visualization+of+Quality+Concerns+from+Requirements+Specifications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mona Rahimi, Mehdi Mirakhorli, and Jane Cleland-Huang",
            "AffiliationsString": "DePaul University, USA",
            "Authors": [
                "Mona Rahimi @ DePaul University, USA",
                "Mehdi Mirakhorli @ DePaul University, USA",
                "Jane Cleland-Huang @ DePaul University, USA"
            ],
            "Affiliations": [
                "DePaul University, USA",
                "DePaul University, USA",
                "DePaul University, USA"
            ],
            "Abstract": "Software requirements specifications often focus on functionality and fail to adequately capture quality concerns such as security, performance, and usability. In many projects, quality-related requirements are either entirely lacking from the specification or intermingled with functional concerns. This makes it difficult for stakeholders to fully understand the quality concerns of the system and to evaluate their scope of impact. In this paper we present a data mining approach for automating the extraction and subsequent modeling of quality concerns from requirements, feature requests, and online forums. We extend our prior work in mining quality concerns from textual documents and apply a sequence of machine learning steps to detect quality-related requirements, generate goal graphs contextualized by project-level information, and ultimately to visualize the results. We illustrate and evaluate our approach against two industrial health-care related systems.",
            "Award": ""
        },
        {
            "Title": "The Effect of Variability Modeling on Requirements Satisfaction for the Configuration and Implementation of Off-The-Shelf Software Packages",
            "Type": "Industry Paper",
            "Key": "re14ind-indp015-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAmanda+Rubython+and+Neil+Maiden+%22The+Effect+of+Variability+Modeling+on+Requirements+Satisfaction+for+the+Configuration+and+Implementation+of+Off-The-Shelf+Software+Packages%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Amanda Rubython and Neil Maiden",
            "AffiliationsString": "City&Guilds Kineo, UK; City University London, UK",
            "Authors": [
                "Amanda Rubython @ City&Guilds Kineo, UK",
                "Neil Maiden @ City University London, UK"
            ],
            "Affiliations": [
                "City&Guilds Kineo, UK",
                "City University London, UK"
            ],
            "Abstract": "An industrial experience of the use of a method for discovering customer requirements with which to configure an off-the-shelf software package for implementation is reported. The method uses an adapted form of product variability model to provide common ground between the customer and supplier about requirements and capabilities. An associated decision support software tool guides the supplier and customer through a model-based walkthrough to discover new requirements, based on equivalent capabilities described in the product variability model. We applied the method in the work processes of the commercial provider of a software-based learning management system, and collected quantitative and qualitative data from supplier-customer interactions. Our first experienc-es with the method led to an increased exposure and expression of customer requirements in the customer-supplier dialogue, compared to the baseline dialogue during software package demonstrations. The paper also reports some first lessons learned to improve the method and adopt its use with other software supplier organizations.",
            "Award": ""
        },
        {
            "Title": "Language Extended Lexicon Points: Estimating the Size of an Application using Its Language",
            "Type": "Full Paper",
            "Key": "re14main-mainp019-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLeandro+Antonelli%2C+Gustavo+Rossi%2C+Julio+Cesar+Sampaio+do+Prado+Leite%2C+and+Alejandro+Oliveros+%22Language+Extended+Lexicon+Points%3A+Estimating+the+Size+of+an+Application+using+Its+Language%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Leandro Antonelli, Gustavo Rossi, Julio Cesar Sampaio do Prado Leite, and Alejandro Oliveros",
            "AffiliationsString": "Universidad Nacional de La Plata, Argentina; PUC-Rio, Brazil; Universidad Argentina de la Empresa, Argentina",
            "Authors": [
                "Leandro Antonelli @ Universidad Nacional de La Plata, Argentina",
                "Gustavo Rossi @ Universidad Nacional de La Plata, Argentina",
                "Julio Cesar Sampaio do Prado Leite @ PUC-Rio, Brazil",
                "Alejandro Oliveros @ Universidad Argentina de la Empresa, Argentina"
            ],
            "Affiliations": [
                "Universidad Nacional de La Plata, Argentina",
                "Universidad Nacional de La Plata, Argentina",
                "PUC-Rio, Brazil",
                "Universidad Argentina de la Empresa, Argentina"
            ],
            "Abstract": "Abstract—Estimating the size of a software system is a critical task due to the implications the estimation has in the management of the development project. There are some widely accepted estimation techniques: Function Points, Use Case Points and Cosmic Points, but these techniques can only be applied after the availability of a requirements specification. In this paper, we propose an approach to estimate the size of an application previous to its requirements specification by using the application language itself, captured by the Language Extended Lexicon (LEL). Our approach is based on Use Case Points and on a technique which derives Use Cases from the LEL. The proposed approach provides a measure of the application’s size earlier than the usual techniques, thus reducing the effort needed to apply them. An initial experiment was conducted to evaluate the proposal.",
            "Award": ""
        },
        {
            "Title": "The Role of Legal Expertise in Interpretation of Legal Requirements and Definitions",
            "Type": "Full Paper",
            "Key": "re14main-mainp102-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDavid+G.+Gordon+and+Travis+D.+Breaux+%22The+Role+of+Legal+Expertise+in+Interpretation+of+Legal+Requirements+and+Definitions%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "David G. Gordon and Travis D. Breaux",
            "AffiliationsString": "Carnegie Mellon University, USA",
            "Authors": [
                "David G. Gordon @ Carnegie Mellon University, USA",
                "Travis D. Breaux @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Government laws and regulations increasingly place requirements on software systems. Ideally, experts trained in law will analyze and interpret legal texts to inform the software requirements process. However, in small companies and development teams with short launch cycles, individuals with little or no legal training will be responsible for compliance. Two specific challenges commonly faced by non-experts are deciding if their system is covered by a law, and then deciding whether two legal requirements are similar or different. In this study, we assess the ability of laypersons, technical professionals, and legal experts to judge the similarity between legal coverage conditions and requirements. In so doing, we discovered that legal experts achieved higher rates of consensus more frequently than technical professionals or laypersons and that all groups had slightly greater agreement when judging coverage conditions than requirements, measured by Fleiss’ Κ. When comparing judgments between groups using a consensus-based Cohen’s Kappa, we found that technical professionals and legal experts exhibited consistently greater agreement than that found between laypersons and legal experts, and that each group tended towards different justifications, such as laypersons and technical professionals tendency towards categorizing different coverage conditions or requirements as equivalent if they believed them to possess the same underlying intent.",
            "Award": ""
        },
        {
            "Title": "Evaluating the Business Value of Information Technology: Case Study on Game Management System",
            "Type": "Full Paper",
            "Key": "re14main-mainp005-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DHarri+T%C3%B6h%C3%B6nen%2C+Marjo+Kauppinen%2C+and+Tomi+M%C3%A4nnist%C3%B6+%22Evaluating+the+Business+Value+of+Information+Technology%3A+Case+Study+on+Game+Management+System%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Harri Töhönen, Marjo Kauppinen, and Tomi Männistö",
            "AffiliationsString": "Aalto University, Finland; University of Helsinki, Finland",
            "Authors": [
                "Harri Töhönen @ Aalto University, Finland",
                "Marjo Kauppinen @ Aalto University, Finland",
                "Tomi Männistö @ University of Helsinki, Finland"
            ],
            "Affiliations": [
                "Aalto University, Finland",
                "Aalto University, Finland",
                "University of Helsinki, Finland"
            ],
            "Abstract": "Abstract - Evaluating the multidimensional and dynamic nature of IT business value is a continuous challenge. This paper examines how system dynamics can be used in evaluating IT business value in a company level. We approach IT business value as a web of impacts, where benefits and sacrifices are ultimately evaluated against company earnings logic. This study is based on an action research and covers a pilot project within two co-operating companies. System dynamics was utilised to construct a value creation model for an existing Gaming Management System. This value creation modelling covered two dimensions: 1) structural evaluation of IT impacts with cause-and-effect models, 2) dynamic evaluation and simulation of value realisation over time. As a result, value creation modelling was able to provide a visual overview of how IT impacts were linked to business value through value paths, and how much and when value was realised. Value creation modelling enabled prototyping of value realisation that can provide value based insights for development activities like requirements elicitation and analysis. The examined approach proved its potential for providing a common language for technology and business parties, thus improving IT business alignment. Index Terms — IT business value, evaluation, system dynamics",
            "Award": ""
        },
        {
            "Title": "Non-functional Requirements as Qualities, with a Spice of Ontology",
            "Type": "Full Paper",
            "Key": "re14main-mainp070-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DFeng-Lin+Li%2C+Jennifer+Horkoff%2C+John+Mylopoulos%2C+Alexander+Borgida%2C+Renata+S.+S.+Guizzardi%2C+Giancarlo+Guizzardi%2C+and+Lin+Liu+%22Non-functional+Requirements+as+Qualities%2C+with+a+Spice+of+Ontology%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Feng-Lin Li, Jennifer Horkoff, John Mylopoulos, Alexander Borgida, Renata S. S. Guizzardi, Giancarlo Guizzardi, and Lin Liu",
            "AffiliationsString": "University of Trento, Italy; Rutgers University, USA; Federal University of Espírito Santo, Brazil; Tsinghua University, China",
            "Authors": [
                "Feng-Lin Li @ University of Trento, Italy",
                "Jennifer Horkoff @ University of Trento, Italy",
                "John Mylopoulos @ University of Trento, Italy",
                "Alexander Borgida @ Rutgers University, USA",
                "Renata S. S. Guizzardi @ Federal University of Espírito Santo, Brazil",
                "Giancarlo Guizzardi @ Federal University of Espírito Santo, Brazil",
                "Lin Liu @ Tsinghua University, China"
            ],
            "Affiliations": [
                "University of Trento, Italy",
                "University of Trento, Italy",
                "University of Trento, Italy",
                "Rutgers University, USA",
                "Federal University of Espírito Santo, Brazil",
                "Federal University of Espírito Santo, Brazil",
                "Tsinghua University, China"
            ],
            "Abstract": "We propose a modeling language for non-functional requirements (NFRs) that views NFRs as requirements over qualities, mapping a software-related domain to a quality space. The language is compositional in that it allows (recursively) complex NFRs to be constructed in several ways. Importantly, the language allows the definition of requirements about the quality of fulfillment of other requirements, thus capturing, among others, the essence of probabilistic and fuzzy goals as proposed in the literature. We also offer a methodology for systematically refining informal NFRs elicited from stakeholders, resulting in unambiguous, de-idealized, and measurable requirements. The proposal is evaluated with a requirements dataset that includes 370 NFRs crossing 15 projects. The results suggest that our framework can adequately handle and clarify NFRs generated in practice.",
            "Award": ""
        },
        {
            "Title": "Quality Requirements Elicitation Based on Inquiry of Quality-Impact Relationships",
            "Type": "Full Paper",
            "Key": "re14main-mainp120-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DFarnaz+Fotrousi%2C+Samuel+A.+Fricker%2C+and+Markus+Fiedler+%22Quality+Requirements+Elicitation+Based+on+Inquiry+of+Quality-Impact+Relationships%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Farnaz Fotrousi, Samuel A. Fricker, and Markus Fiedler",
            "AffiliationsString": "Blekinge Institute of Technology, Sweden",
            "Authors": [
                "Farnaz Fotrousi @ Blekinge Institute of Technology, Sweden",
                "Samuel A. Fricker @ Blekinge Institute of Technology, Sweden",
                "Markus Fiedler @ Blekinge Institute of Technology, Sweden"
            ],
            "Affiliations": [
                "Blekinge Institute of Technology, Sweden",
                "Blekinge Institute of Technology, Sweden",
                "Blekinge Institute of Technology, Sweden"
            ],
            "Abstract": "Quality requirements, an important class of non-functional requirements, are inherently difficult to elicit. Particularly challenging is the definition of good-enough quality. The problem cannot be avoided though, because hitting the right quality level is critical. Too little quality leads to churn for the software product. Excessive quality generates unnecessary cost and drains the resources of the operating platform. To address this problem, we propose to elicit the specific relationships between software quality levels and their impacts for given quality attributes and stakeholders. An understanding of each such relationship can then be used to specify the right level of quality by deciding about acceptable impacts. The quality-impact relationships can be used to design and dimension a software system appropriately and, in a second step, to develop service level agreements that allow re-use of the obtained knowledge of good-enough quality. This paper describes an approach to elicit such quality–impact relationships and to use them for specifying quality requirements. The approach has been applied with user representatives in requirements workshops and used for determining Quality of Service (QoS) requirements based the involved users’ Quality of Experience (QoE). The paper describes the approach in detail and reports early experiences from applying the approach.",
            "Award": ""
        },
        {
            "Title": "Nòmos 3: Reasoning about Regulatory Compliance of Requirements",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid5-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DSilvia+Ingolfo%2C+Alberto+Siena%2C+and+John+Mylopoulos+%22N%C3%B2mos+3%3A+Reasoning+about+Regulatory+Compliance+of+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Silvia Ingolfo, Alberto Siena, and John Mylopoulos",
            "AffiliationsString": "University of Trento, Italy",
            "Authors": [
                "Silvia Ingolfo @ University of Trento, Italy",
                "Alberto Siena @ University of Trento, Italy",
                "John Mylopoulos @ University of Trento, Italy"
            ],
            "Affiliations": [
                "University of Trento, Italy",
                "University of Trento, Italy",
                "University of Trento, Italy"
            ],
            "Abstract": "The great impact that law has in the RE-process has called for new techniques and procedures to evaluate the alignment of requirements with applicable laws. In this paper we present a modeling language for the evaluation of compliance of requirements with a piece of law: Nomos3. We introduce our language and show the reasoning capabilities of our proposal.",
            "Award": ""
        },
        {
            "Title": "GUITAR: An Ontology-based Automated Requirements Analysis Tool",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid15-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DTuong+Huan+Nguyen%2C+John+Grundy%2C+and+Mohamed+Almorsy+%22GUITAR%3A+An+Ontology-based+Automated+Requirements+Analysis+Tool%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D0dcuftwScv0",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tuong Huan Nguyen, John Grundy, and Mohamed Almorsy",
            "AffiliationsString": "Swinburne University of Technology, Australia",
            "Authors": [
                "Tuong Huan Nguyen @ Swinburne University of Technology, Australia",
                "John Grundy @ Swinburne University of Technology, Australia",
                "Mohamed Almorsy @ Swinburne University of Technology, Australia"
            ],
            "Affiliations": [
                "Swinburne University of Technology, Australia",
                "Swinburne University of Technology, Australia",
                "Swinburne University of Technology, Australia"
            ],
            "Abstract": "Combining goal-oriented and use case modeling has been proven to be an effective method in requirements elicitation and elaboration. However, current requirements engineering approaches generally lack reliable support for automated analysis of such modeled artifacts. To address this problem, we have developed GUITAR, a tool which delivers automated detection of incorrectness, incompleteness and inconsistency between artifacts. GUITAR is based on our goal-use case integration meta-model and ontologies of domain knowledge and semantics. GUITAR also provides comprehensive explanations for detected problems and can suggest resolution alternatives.",
            "Award": ""
        },
        {
            "Title": "Simulation-Based Requirements Discovery for Smart Driver Assistive Technologies",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid7-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAndreas+Gregoriades%2C+Maria+Pampaka%2C+and+Alistair+Sutcliffe+%22Simulation-Based+Requirements+Discovery+for+Smart+Driver+Assistive+Technologies%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DpIm9xJtoP9w",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Andreas Gregoriades, Maria Pampaka, and Alistair Sutcliffe",
            "AffiliationsString": "European University Cyprus, Cyprus; University of Manchester, UK",
            "Authors": [
                "Andreas Gregoriades @ European University Cyprus, Cyprus",
                "Maria Pampaka @ University of Manchester, UK",
                "Alistair Sutcliffe @ University of Manchester, UK"
            ],
            "Affiliations": [
                "European University Cyprus, Cyprus",
                "University of Manchester, UK",
                "University of Manchester, UK"
            ],
            "Abstract": "Smart driver assistive technologies (DAT) have been developed to alleviate accident risk by either reducing driver workload or assessing driver attentiveness. Such systems aim to draw drivers’ attention on critical cues that improve decision making. However, in some cases, these systems can have a negative effect due to the extra information load they incur to the driver. Therefore, in addition to specifying the functional requirements for such systems there is an urgent need to address the human requirements. This work describes a simulation-based requirements discovery method that utilises the benefits of a modular simulator that models future designs of DAT.",
            "Award": ""
        },
        {
            "Title": "EAM: Ecosystemability Assessment Method",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid11-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DEric+Knauss+and+Imed+Hammouda+%22EAM%3A+Ecosystemability+Assessment+Method%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Eric Knauss and Imed Hammouda",
            "AffiliationsString": "Chalmers, Sweden; University of Gothenburg, Sweden",
            "Authors": [
                "Eric Knauss @ Chalmers, Sweden / University of Gothenburg, Sweden",
                "Imed Hammouda @ Chalmers, Sweden / University of Gothenburg, Sweden"
            ],
            "Affiliations": [
                "Chalmers, Sweden / University of Gothenburg, Sweden",
                "Chalmers, Sweden / University of Gothenburg, Sweden"
            ],
            "Abstract": "In this extended abstract, we present the ecosystemability assessment method as a means to assess the extent to which a software system, represented by its architecture and its development environment, supports the vision of ecosystem.",
            "Award": ""
        },
        {
            "Title": "Combined Goal and Feature Model Reasoning with the User Requirements Notation and jUCMNav",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid12-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DYanji+Liu%2C+Yukun+Su%2C+Xinshang+Yin%2C+and+Gunter+Mussbacher+%22Combined+Goal+and+Feature+Model+Reasoning+with+the+User+Requirements+Notation+and+jUCMNav%22",
            "URLvideo": "http%3A%2F%2Fjucmnav.softwareengineering.ca%2Fucm%2Fbin%2Fview%2FProjetSEG%2FFeatureModeling",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Yanji Liu, Yukun Su, Xinshang Yin, and Gunter Mussbacher",
            "AffiliationsString": "McGill University, Canada",
            "Authors": [
                "Yanji Liu @ McGill University, Canada",
                "Yukun Su @ McGill University, Canada",
                "Xinshang Yin @ McGill University, Canada",
                "Gunter Mussbacher @ McGill University, Canada"
            ],
            "Affiliations": [
                "McGill University, Canada",
                "McGill University, Canada",
                "McGill University, Canada",
                "McGill University, Canada"
            ],
            "Abstract": "The User Requirements Notation (URN) is an international requirements engineering standard published by the International Telecommunication Union. URN supports goal-oriented and scenario-based modeling and analysis. jUCMNav is an open-source, Eclipse-based modeling tool for URN. This tool demonstration focuses on recent extensions to jUCMNav that have incorporated feature models into a URN-based modeling and reasoning framework. Feature modeling is a well-establishing technique for capturing commonalities and variabilities of Software Product Lines. Combined with URN, it is possible to reason about the impact of feature configurations on stakeholder goals and system qualities, thus helping to identify the most appropriate features for a stakeholder. Furthermore, coordinated feature and goal model reasoning is fundamental to Concern-Driven Development, where concerns are defined with a three-part variation, customization, and usage interface. As the variation interface is described with feature and goal models, it is now possible with jUCMNav to define and reason about a concern’s variation interface, which is a prerequisite for composing multiple concerns based on their three-part interfaces.",
            "Award": ""
        },
        {
            "Title": "Decisively: Application of Quantitative Analysis and Decision Science in Agile Requirements Engineering",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid1-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DSanjaya+Kumar+Saxena+and+Rachna+Chakraborty+%22Decisively%3A+Application+of+Quantitative+Analysis+and+Decision+Science+in+Agile+Requirements+Engineering%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DosX4C4jgGrk",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Sanjaya Kumar Saxena and Rachna Chakraborty",
            "AffiliationsString": "GrayPE Systems, India",
            "Authors": [
                "Sanjaya Kumar Saxena @ GrayPE Systems, India",
                "Rachna Chakraborty @ GrayPE Systems, India"
            ],
            "Affiliations": [
                "GrayPE Systems, India",
                "GrayPE Systems, India"
            ],
            "Abstract": "While many mature Requirements Engineering (RE) tools for Agile exist, RE professionals at large have not been able to benefit from Quantitative Analysis and Decision Science (QUADS) techniques in this context. In this paper we present an Agile RE tool, Decisively, which brings a new perspective to automation in the RE process through application of QUADS to address Requirement Discovery, Analysis, Estimation and Prioritization. Techniques explored in Decisively include Analytical Hierarchical Process (AHP) for prioritization and estimation, Lorenz function to shortlist user stories by analyzing the distribution of votes, Box Plot Analysis to predict velocity, and Text Mining to discover implied requirements from documents.",
            "Award": ""
        },
        {
            "Title": "VARED: Verification and Analysis of Requirements and Early Designs",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid8-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJulia+Badger%2C+David+Throop%2C+and+Charles+Claunch+%22VARED%3A+Verification+and+Analysis+of+Requirements+and+Early+Designs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Julia Badger, David Throop, and Charles Claunch",
            "AffiliationsString": "NASA, USA; Boeing, USA",
            "Authors": [
                "Julia Badger @ NASA, USA",
                "David Throop @ Boeing, USA",
                "Charles Claunch @ NASA, USA"
            ],
            "Affiliations": [
                "NASA, USA",
                "Boeing, USA",
                "NASA, USA"
            ],
            "Abstract": "Requirements are a part of every project life cycle; everything going forward in a project depends on them. The VARED tool chain aims to provide an integrated environment to analyze and verify the requirements and early design of a system. Natural language requirements are processed automatically into formal specifications using a state model of the system under design and its environment. The specifications are formally checked and then are used to verify the controller model meets the requirements.",
            "Award": ""
        },
        {
            "Title": "Structured Multi-view Modeling by Tabular Notation",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid6-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DXiuna+Zhu%2C+Dongyue+Mou%2C+and+Daniel+Ratiu+%22Structured+Multi-view+Modeling+by+Tabular+Notation%22",
            "URLvideo": "http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DOkzKW_FpqEs",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Xiuna Zhu, Dongyue Mou, and Daniel Ratiu",
            "AffiliationsString": "TU München, Germany; fortiss, Germany",
            "Authors": [
                "Xiuna Zhu @ TU München, Germany",
                "Dongyue Mou @ fortiss, Germany",
                "Daniel Ratiu @ fortiss, Germany"
            ],
            "Affiliations": [
                "TU München, Germany",
                "fortiss, Germany",
                "fortiss, Germany"
            ],
            "Abstract": "The growth of software complexity and high degree of dependencies between functionalities motivates the use of models during requirements engineering. Hence, readability and comprehensibility of currently requirements specification techniques should be increased. Additionally, multi-view modeling and tabular expression are widely accepted techniques in requirements documentation. We present a tool that allows structured multi-view modeling of the behavior of the system by means of tabular notation. Our tool provides various table patterns to support different behavior views, which leverage the advantages of tabular specification, e.g., unambiguous, precise, and easier to read, analyses and communicate. Our aim is to reduce the complexity in the development of software systems.",
            "Award": ""
        },
        {
            "Title": "Efficient Visual Notations for Efficient Stakeholder Communication",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid4-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DRalf+Laue%2C+Frank+Hogrebe%2C+Boris+B%C3%B6ttcher%2C+and+Markus+N%C3%BCttgens+%22Efficient+Visual+Notations+for+Efficient+Stakeholder+Communication%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Ralf Laue, Frank Hogrebe, Boris Böttcher, and Markus Nüttgens",
            "AffiliationsString": "University of Applied Sciences Zwickau, Germany; Hessische Hochschule für Polizei und Verwaltung Wiesbaden, Germany; University of Hamburg, Germany",
            "Authors": [
                "Ralf Laue @ University of Applied Sciences Zwickau, Germany",
                "Frank Hogrebe @ Hessische Hochschule für Polizei und Verwaltung Wiesbaden, Germany",
                "Boris Böttcher @ University of Hamburg, Germany",
                "Markus Nüttgens @ University of Hamburg, Germany"
            ],
            "Affiliations": [
                "University of Applied Sciences Zwickau, Germany",
                "Hessische Hochschule für Polizei und Verwaltung Wiesbaden, Germany",
                "University of Hamburg, Germany",
                "University of Hamburg, Germany"
            ],
            "Abstract": "The visual syntax of modelling languages can support (or impede) the intuitive understandability of a model. We observed the process of problem solving with two notation variants of i* diagrams by means of an eye-tracking device. The number of wrongly answered questions was significantly lower when the alternative i* notation suggested by Moody et al. was used. For the eye-tracking metrics &quot;time to solve a task&quot; and &quot;number of eye fixations&quot;, no such significant result can be given. Furthermore, we identified a deficiency for the &quot;dependency&quot; symbol in the alternative notation.",
            "Award": ""
        },
        {
            "Title": "Symbolic Verification of Requirements in VRS System",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid9-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DOleksandr+Letychevskyi+and+Thomas+Weigert+%22Symbolic+Verification+of+Requirements+in+VRS+System%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DrwV55Xv33f4",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Oleksandr Letychevskyi and Thomas Weigert",
            "AffiliationsString": "Glushkov Institute of Cybernetics, Ukraine; Uniquesoft LLC, USA",
            "Authors": [
                "Oleksandr Letychevskyi @ Glushkov Institute of Cybernetics, Ukraine",
                "Thomas Weigert @ Uniquesoft LLC, USA"
            ],
            "Affiliations": [
                "Glushkov Institute of Cybernetics, Ukraine",
                "Uniquesoft LLC, USA"
            ],
            "Abstract": "VRS (Verification Requirements Specifications) system is a tool for processing formal requirements during the initial stage of software, hardware, or system development. Symbolic modeling and deductive methods are used for detection of issues such as safety violations, deadlocks, nondeterminism, or livelocks. The formal representation of requirements also supports the generation of test suites as well as the synthesis of a design model.",
            "Award": ""
        },
        {
            "Title": "Business Application Modeler: A Process Model Validation and Verification Tool",
            "Type": "Poster/Demo",
            "Key": "re14demoposters-demopostersid16-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DS%C3%B6ren+Witt%2C+Sven+Feja%2C+Andreas+Speck%2C+and+Christian+Hadler+%22Business+Application+Modeler%3A+A+Process+Model+Validation+and+Verification+Tool%22",
            "URLvideo": "https%3A%2F%2Fwww.bit.informatik.uni-kiel.de%2Fre-tutorial%2F",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Sören Witt, Sven Feja, Andreas Speck, and Christian Hadler",
            "AffiliationsString": "Kiel University, Germany",
            "Authors": [
                "Sören Witt @ Kiel University, Germany",
                "Sven Feja @ Kiel University, Germany",
                "Andreas Speck @ Kiel University, Germany",
                "Christian Hadler @ Kiel University, Germany"
            ],
            "Affiliations": [
                "Kiel University, Germany",
                "Kiel University, Germany",
                "Kiel University, Germany",
                "Kiel University, Germany"
            ],
            "Abstract": "(Business) Process models are common artifacts in requirements engineering. The models can be enriched with plenty of (detailed) information and their at least semi formal character even enables model driven approaches or direct execution in workflow engines. Validity of process models is crucial. Manual checking is expensive and error-prone, especially for requirements that regard the content level (e.g. compliance). To enable automated checking, an adequate method for formal specification is necessary. We present the Business Application Modeler (BAM), which is a modeling and Validation &amp; Verification tool that integrates modeling of processes and formal graphical validation rules. These rules can be automatically applied to process models. In particular, the modeler is supported by visualizations of checking results directly in the process models. Next to highlighting mechanisms this support includes recommendations for the correction of errors.",
            "Award": ""
        },
        {
            "Title": "Handling Design-Level Requirements across Distributed Teams: Developing a New Feature for 12 Danish Mobile Banking Apps",
            "Type": "Industry Paper",
            "Key": "re14ind-indp002-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLars+Bruun%2C+Mikkel+Bovbjerg+Hansen%2C+J%C3%B8rgen+B%C3%B8ndergaard+Iversen%2C+Jens+B%C3%A6k+J%C3%B8rgensen%2C+and+Bjarne+Knudsen+%22Handling+Design-Level+Requirements+across+Distributed+Teams%3A+Developing+a+New+Feature+for+12+Danish+Mobile+Banking+Apps%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Lars Bruun, Mikkel Bovbjerg Hansen, Jørgen Bøndergaard Iversen, Jens Bæk Jørgensen, and Bjarne Knudsen",
            "AffiliationsString": "Bankdata, Denmark; Mjølner Informatics, Denmark",
            "Authors": [
                "Lars Bruun @ Bankdata, Denmark",
                "Mikkel Bovbjerg Hansen @ Bankdata, Denmark",
                "Jørgen Bøndergaard Iversen @ Mjølner Informatics, Denmark",
                "Jens Bæk Jørgensen @ Mjølner Informatics, Denmark",
                "Bjarne Knudsen @ Mjølner Informatics, Denmark"
            ],
            "Affiliations": [
                "Bankdata, Denmark",
                "Bankdata, Denmark",
                "Mjølner Informatics, Denmark",
                "Mjølner Informatics, Denmark",
                "Mjølner Informatics, Denmark"
            ],
            "Abstract": "Bankdata and Mjølner have cooperated in the development of a new feature for 12 Danish mobile banking apps. Bankdata is the main system provider and Mjølner is subcontractor. Different teams from Bankdata have collected requirements, developed the necessary backend and middleware software, and designed the user interface. One team from Mjølner has implemented the app feature. The cooperation between the teams was centered around design-level requirements. Our contribution is to describe and discuss a number of lessons learned regarding requirements representations, requirements tools, and cooperation process; we have faced challenges, which were amplified by our distributed teams set-up. We also briefly describe a number of initiatives we have launched recently to alleviate the problems and improve the handling of design-level requirements in our future cooperation.",
            "Award": ""
        },
        {
            "Title": "Experience of Pragmatically Combining RE Methods for Performance Requirements in Industry",
            "Type": "Industry Paper",
            "Key": "re14ind-indp027-p",
            "URL": "http%3A%2F%2Fsdqweb.ipd.kit.edu%2Fpublications%2Fpdfs%2Fwohlrab2014a.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Rebekka Wohlrab, Thijmen de Gooijer, Anne Koziolek, and Steffen Becker",
            "AffiliationsString": "ABB Research, Sweden; KIT, Germany; University of Paderborn, Germany",
            "Authors": [
                "Rebekka Wohlrab @ ABB Research, Sweden",
                "Thijmen de Gooijer @ ABB Research, Sweden",
                "Anne Koziolek @ KIT, Germany",
                "Steffen Becker @ University of Paderborn, Germany"
            ],
            "Affiliations": [
                "ABB Research, Sweden",
                "ABB Research, Sweden",
                "KIT, Germany",
                "University of Paderborn, Germany"
            ],
            "Abstract": "To meet end-user performance expectations, precise performance requirements are needed during development and testing, e.g., to conduct detailed performance and load tests. However, in practice, several factors complicate performance requirements elicitation: lacking skills in performance requirements engineering, outdated or unavailable functional specifications and architecture models, the specification of the system&#039;s context, lack of experience to collect good performance requirements in an industrial setting with very limited time, etc. From the small set of available non-functional requirements engineering methods, no method exists that alone leads to precise and complete performance requirements with feasible effort and which has been reported to work in an industrial setting. In this paper, we present our experiences in combining existing requirements engineering methods into a performance requirements method called PROPRE. It has been designed to require no up-to-date system documentation and to be applicable with limited time and effort. We have successfully applied PROPRE in an industrial case study from the process automation domain. Our lessons learned show that the stakeholders gathered good performance requirements which now improve performance testing.",
            "Award": ""
        },
        {
            "Title": "Lightweight Requirements Engineering Assessments in Software Projects",
            "Type": "Industry Paper",
            "Key": "re14ind-indp014-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDaniel+Rapp%2C+Anne+Hess%2C+Norbert+Seyff%2C+Peter+Sp%C3%B6rri%2C+Emmerich+Fuchs%2C+and+Martin+Glinz+%22Lightweight+Requirements+Engineering+Assessments+in+Software+Projects%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Daniel Rapp, Anne Hess, Norbert Seyff, Peter Spörri, Emmerich Fuchs, and Martin Glinz",
            "AffiliationsString": "Zühlke Management Consultants, Switzerland; Fraunhofer IESE, Germany; University of Zurich, Switzerland",
            "Authors": [
                "Daniel Rapp @ Zühlke Management Consultants, Switzerland",
                "Anne Hess @ Fraunhofer IESE, Germany",
                "Norbert Seyff @ University of Zurich, Switzerland",
                "Peter Spörri @ Zühlke Management Consultants, Switzerland",
                "Emmerich Fuchs @ Zühlke Management Consultants, Switzerland",
                "Martin Glinz @ University of Zurich, Switzerland"
            ],
            "Affiliations": [
                "Zühlke Management Consultants, Switzerland",
                "Fraunhofer IESE, Germany",
                "University of Zurich, Switzerland",
                "Zühlke Management Consultants, Switzerland",
                "Zühlke Management Consultants, Switzerland",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "Requirements engineering (RE) is widely recognized as a crucial factor for the success of software projects. Therefore, companies often request assessments of RE processes and resulting artifacts to identify issues and improvement potential. However, industry claims that current assessment approaches do not always fulfill their needs regarding efficiency and effectiveness. Motivated by needs of both, companies asking for an assessment, and a company in the role of an assessor, we have developed a lightweight, tool-supported RE assessment approach. Apart from presenting the approach, we also discuss early experiences we gained from applying our assessment approach in real-world industrial projects.",
            "Award": ""
        },
        {
            "Title": "Capturing and Sharing Domain Knowledge with Business Rules: Lessons Learned from a Global Software Vendor",
            "Type": "Industry Paper",
            "Key": "re14ind-indp037-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DWalid+Maalej+and+Smita+Ghaisas+%22Capturing+and+Sharing+Domain+Knowledge+with+Business+Rules%3A+Lessons+Learned+from+a+Global+Software+Vendor%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Walid Maalej and Smita Ghaisas",
            "AffiliationsString": "University of Hamburg, Germany; Tata Consultancy Services, India",
            "Authors": [
                "Walid Maalej @ University of Hamburg, Germany",
                "Smita Ghaisas @ Tata Consultancy Services, India"
            ],
            "Affiliations": [
                "University of Hamburg, Germany",
                "Tata Consultancy Services, India"
            ],
            "Abstract": "Business rules represent constraints in a domain, which need to be taken into account either during the development or the usage of a system. Motivated by the knowledge reuse potentials when developing systems within the same domain, we studied business rules in a large software company. We interviewed 11 experienced practitioners on how they understand, capture, and use business rules. We also studied the role of business rules in requirements engineering in the host organization. We found that practitioners have a very broad perception for this term, ranging from flows of business processes to directives for calling external system interfaces. We identified 27 types of rules, which are typically captured as a free text in requirements documents and other project documentation. Practitioners stated the need to capture this tacit form of domain knowledge and to trace it to other artifacts as it impacts all activities in a software engineering project. We distill our results in 17 findings and discuss the implications for researchers and practitioners.",
            "Award": ""
        },
        {
            "Title": "Building a National E-Service using Sentire: Experience Report on the Use of Sentire: A Volere-Based Requirements Framework Driven by Calibrated Personas and Simulated User Feedback",
            "Type": "Industry Paper",
            "Key": "re14ind-indp024-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DChris+Porter%2C+Emmanuel+Letier%2C+and+M.+Angela+Sasse+%22Building+a+National+E-Service+using+Sentire%3A+Experience+Report+on+the+Use+of+Sentire%3A+A+Volere-Based+Requirements+Framework+Driven+by+Calibrated+Personas+and+Simulated+User+Feedback%22",
            "URLvideo": "http%3A%2F%2Fvimeo.com%2F85960146",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Chris Porter, Emmanuel Letier, and M. Angela Sasse",
            "AffiliationsString": "University College London, UK",
            "Authors": [
                "Chris Porter @ University College London, UK",
                "Emmanuel Letier @ University College London, UK",
                "M. Angela Sasse @ University College London, UK"
            ],
            "Affiliations": [
                "University College London, UK",
                "University College London, UK",
                "University College London, UK"
            ],
            "Abstract": "User experience (UX) is difficult to quantify and thus more challenging to require and guarantee. It is also difficult to gauge the potential impact on users’ lived experience, especially at the earlier stages of the development life cycle, particularly before hi fidelity prototypes are developed. We believe that the enrolment process is a major hurdle for e-government service adoption and badly designed processes might result in negative repercussions for both the policy maker and the different user groups involved; non-adoption and resentment are two risks that may result in low return on investment (ROI), lost political goodwill and ultimately a negative lived experience for citizens. Identity assurance requirements need to balance out the real value of the assets being secured (risk) with the user groups’ acceptance thresholds (based on a continuous cost-benefit exercise factoring in cognitive and physical workload). Sentire is a persona-centric requirements framework built on and extending the Volere requirements process with UX-analytics, reusable user behavioural models and simulated user feedback through calibrated personas. In this paper we present a story on how Sentire was adopted in the development of a national public-facing e-service. Daily journaling was used throughout the project and a custom built cloud-based CASE tool was used to manage the whole process. This paper outlines our experiences and lessons learnt.",
            "Award": ""
        },
        {
            "Title": "Competition and Collaboration in Requirements Engineering: A Case Study of an Emerging Software Ecosystem",
            "Type": "Industry Paper",
            "Key": "re14ind-indp025-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DGeorge+Valen%C3%A7a%2C+Carina+Alves%2C+Virg%C3%ADnia+Heimann%2C+Slinger+Jansen%2C+and+Sjaak+Brinkkemper+%22Competition+and+Collaboration+in+Requirements+Engineering%3A+A+Case+Study+of+an+Emerging+Software+Ecosystem%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "George Valença, Carina Alves, Virgínia Heimann, Slinger Jansen, and Sjaak Brinkkemper",
            "AffiliationsString": "Federal Rural University of Pernambuco, Brazil; Federal University of Pernambuco, Brazil; Utrecht University, Netherlands",
            "Authors": [
                "George Valença @ Federal Rural University of Pernambuco, Brazil",
                "Carina Alves @ Federal University of Pernambuco, Brazil",
                "Virgínia Heimann @ Federal University of Pernambuco, Brazil",
                "Slinger Jansen @ Utrecht University, Netherlands",
                "Sjaak Brinkkemper @ Utrecht University, Netherlands"
            ],
            "Affiliations": [
                "Federal Rural University of Pernambuco, Brazil",
                "Federal University of Pernambuco, Brazil",
                "Federal University of Pernambuco, Brazil",
                "Utrecht University, Netherlands",
                "Utrecht University, Netherlands"
            ],
            "Abstract": "Increasingly, small to medium software producing organisations are working together in collaboration networks to supply complex compositions of their products and services to customers. In this paper, we present a case study of two software companies that are evolving their partnership towards the creation of a software ecosystem. We investigate the impacts of their tightening partnership on software product management, with a focus on requirements engineering practices. We observe that the requirements definition and negotiation processes are directly affected by their fluid collaborative and competitive relationships. Power disputes, volatile roles and mismatches in release synchronisation are also aspects observed in the studied software ecosystem. We extract several observations from the case study that support small to medium software firms in making decisions within their software ecosystem.",
            "Award": ""
        },
        {
            "Title": "Modelling Sustainability in a Procurement System: An Experience Report",
            "Type": "Industry Paper",
            "Key": "re14ind-indp012-p",
            "URL": "http%3A%2F%2Fwww.cos.ufrj.br%2F%7Eschots%2Fpapers%2Fbomfim2014preprint.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Camilla Bomfim, Wesley Nunes, Leticia Duboc, and Marcelo Schots",
            "AffiliationsString": "State University of Rio de Janeiro, Brazil; Federal University of Rio de Janeiro, Brazil",
            "Authors": [
                "Camilla Bomfim @ State University of Rio de Janeiro, Brazil",
                "Wesley Nunes @ State University of Rio de Janeiro, Brazil",
                "Leticia Duboc @ State University of Rio de Janeiro, Brazil",
                "Marcelo Schots @ Federal University of Rio de Janeiro, Brazil"
            ],
            "Affiliations": [
                "State University of Rio de Janeiro, Brazil",
                "State University of Rio de Janeiro, Brazil",
                "State University of Rio de Janeiro, Brazil",
                "Federal University of Rio de Janeiro, Brazil"
            ],
            "Abstract": "Sustainability is one of the main driving forces in our society. IT can also contribute to sustainable development, which goes beyond the energy consumed to produce and run the software product. Software is normally part of a wider context, social-technical systems, whose development can have a significant impact on the sustainability of its surroundings. A particular type of system with considerable sustainability impact are procurement systems. They normally affect the three pillars of sustainability: social, economic and environmental. This paper describes an experience on using goal modelling to incorporate sustainability into the procurement system of a large multinational energy company. The study highlights the advantages and challenges of introducing sustainability into private procurement systems, as well as the suitability of the technique for such a purpose. We believe this experience and its resulting model can be useful to other companies wishing to implement sustainable procurement processes.",
            "Award": ""
        },
        {
            "Title": "A Case Study using a Protocol to Derive Safety Functional Requirements from Fault Tree Analysis",
            "Type": "Industry Paper",
            "Key": "re14ind-indp022-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLuiz+Eduardo+Galv%C3%A3o+Martins+and+Tiago+de+Oliveira+%22A+Case+Study+using+a+Protocol+to+Derive+Safety+Functional+Requirements+from+Fault+Tree+Analysis%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Luiz Eduardo Galvão Martins and Tiago de Oliveira",
            "AffiliationsString": "Federal University of São Paulo, Brazil",
            "Authors": [
                "Luiz Eduardo Galvão Martins @ Federal University of São Paulo, Brazil",
                "Tiago de Oliveira @ Federal University of São Paulo, Brazil"
            ],
            "Affiliations": [
                "Federal University of São Paulo, Brazil",
                "Federal University of São Paulo, Brazil"
            ],
            "Abstract": "State-of-the-art in Requirements Engineering offers many frameworks and techniques to enable requirements engineers in their work. However, for critical systems there are gaps in state-of-the-art, and these can result in dire consequences, potentially putting lives in danger and damage infrastructure and threaten the environment. A well known technique used to help requirements engineers to understand safety hazards situations in the context of safety-critical software is Fault Tree Analysis (FTA). This technique is a good one to decompose hazards identified in the system context into events that may put the system functionalities in risk. However, FTA does not offer a protocol of how to derive safety functional requirements from fault trees. In this paper we present a case study adopting a protocol to help requirements engineers to derive safety functional requirements from FTA. The proposed protocol was based on a study performed in a Brazilian company in the area of electronic medical devices. The development of prototype of a low cost insulin infusion pump, which is a critical system, offered the basis to propose and test a protocol to derive safety functional requirements from FTA. During the case study we collected evidences that help us to discuss if FTA is sufficient to guide software engineers to implement the corresponding control software and also if FTA offers enough information to help requirements engineers to derive safety functional requirements.",
            "Award": ""
        },
        {
            "Title": "The DODT Tool Applied to Sub-Sea Software",
            "Type": "Industry Paper",
            "Key": "re14ind-indp017-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DTor+St%C3%A5lhane+and+Tormod+Wien+%22The+DODT+Tool+Applied+to+Sub-Sea+Software%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tor Stålhane and Tormod Wien",
            "AffiliationsString": "Norwegian University of Science and Technology, Norway; ABB Research, Norway",
            "Authors": [
                "Tor Stålhane @ Norwegian University of Science and Technology, Norway",
                "Tormod Wien @ ABB Research, Norway"
            ],
            "Affiliations": [
                "Norwegian University of Science and Technology, Norway",
                "ABB Research, Norway"
            ],
            "Abstract": "Using natural language is still a common form of writing software requirements. Tools and techniques to improve the quality of natural language requirements may give better results than attempts to convince industry to use something else. We have combined natural language requirements with tool support using boilerplates and domain ontologies, enabling detection of ambiguities and incompleteness in requirements. This paper reports on a case study where requirement analysts used the developed tool to analyze requirements for a safety-critical control system. The experience showed that people were able to use the tool to develop a domain ontology and apply boilerplates to describe requirements in a structured way, yielding requirements readable for humans and analyzable for the tool. The tool support improved the quality of requirements by reducing ambiguities and inconsistent use of terminology, removing redundant requirements, and improving partial and unclear requirements.",
            "Award": ""
        },
        {
            "Title": "Towards Feature-Oriented Requirements Validation for Automotive Systems",
            "Type": "Industry Paper",
            "Key": "re14ind-indp018-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJiale+Zhou%2C+Yue+Lu%2C+Kristina+Lundqvist%2C+Henrik+L%C3%B6nn%2C+Daniel+Karlsson%2C+and+Bo+Liw%C3%A5ng+%22Towards+Feature-Oriented+Requirements+Validation+for+Automotive+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jiale Zhou, Yue Lu, Kristina Lundqvist, Henrik Lönn, Daniel Karlsson, and Bo Liwång",
            "AffiliationsString": "Mälardalen University, Sweden; Volvo, Sweden; Swedish Radiation Safety Authority, Sweden",
            "Authors": [
                "Jiale Zhou @ Mälardalen University, Sweden",
                "Yue Lu @ Mälardalen University, Sweden",
                "Kristina Lundqvist @ Mälardalen University, Sweden",
                "Henrik Lönn @ Volvo, Sweden",
                "Daniel Karlsson @ Volvo, Sweden",
                "Bo Liwång @ Swedish Radiation Safety Authority, Sweden"
            ],
            "Affiliations": [
                "Mälardalen University, Sweden",
                "Mälardalen University, Sweden",
                "Mälardalen University, Sweden",
                "Volvo, Sweden",
                "Volvo, Sweden",
                "Swedish Radiation Safety Authority, Sweden"
            ],
            "Abstract": "In the modern automotive industry, feature models have been widely used as a domain-specific requirements model, which can capture commonality and variability of a software product line through a set of features. Product variants can thus be configured by selecting different sets of features from the feature model. For feature-oriented requirements validation, the variability of feature sets often makes the hidden flaws such as behavioral inconsistencies of features, hardly to avoid. In this paper, we present an approach to feature-oriented requirements validation for automotive systems w.r.t both functional behaviors and non-functional properties. Our approach first starts with the behavioral specification of features and the associated requirements by following a restricted use case modeling approach, and then formalizes such specifications by using a formal yet literate language for analysis. We demonstrate the applicability of our approach through an industrial application of a vehicle locking-unlocking system.",
            "Award": ""
        },
        {
            "Title": "Product Knowledge Configurator for Requirements Gap Analysis and Customizations",
            "Type": "Industry Paper",
            "Key": "re14ind-indp032-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DPreethu+Rose+Anish+and+Smita+Ghaisas+%22Product+Knowledge+Configurator+for+Requirements+Gap+Analysis+and+Customizations%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Preethu Rose Anish and Smita Ghaisas",
            "AffiliationsString": "Tata Consultancy Services, India",
            "Authors": [
                "Preethu Rose Anish @ Tata Consultancy Services, India",
                "Smita Ghaisas @ Tata Consultancy Services, India"
            ],
            "Affiliations": [
                "Tata Consultancy Services, India",
                "Tata Consultancy Services, India"
            ],
            "Abstract": "Product knowledge plays an important role in identifying the requirements of the desired variant and configuring the existing product to the present needs of a customer. The success of a product-based business depends to a great extent on how efficiently and accurately the existing product knowledge is utilized for customization needs. Oftentimes however, product knowledge resides with few key individuals in an organization. In the absence of their involvement, project teams may redevelop product features unnecessarily, resulting in an effort overhead. Such overdependence poses a risk to projects. To identify the requirements for the variants accurately and efficiently, we need to have a thorough knowledge of the existing product features. In this paper, we discuss our work on representing product knowledge and reusing it in a Requirements Engineering (RE) exercise for a large project involving product customization. We present our experience from using the configurator for requirements gap analysis and customizations.",
            "Award": ""
        },
        {
            "Title": "Reassessing the Pattern-Based Approach for Formalizing Requirements in the Automotive Domain",
            "Type": "Industry Paper",
            "Key": "re14ind-indp028-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DPredrag+Filipovikj%2C+Mattias+Nyberg%2C+and+Guillermo+Rodriguez-Navas+%22Reassessing+the+Pattern-Based+Approach+for+Formalizing+Requirements+in+the+Automotive+Domain%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Predrag Filipovikj, Mattias Nyberg, and Guillermo Rodriguez-Navas",
            "AffiliationsString": "Mälardalen University, Sweden; Scania, Sweden",
            "Authors": [
                "Predrag Filipovikj @ Mälardalen University, Sweden",
                "Mattias Nyberg @ Scania, Sweden",
                "Guillermo Rodriguez-Navas @ Mälardalen University, Sweden"
            ],
            "Affiliations": [
                "Mälardalen University, Sweden",
                "Scania, Sweden",
                "Mälardalen University, Sweden"
            ],
            "Abstract": "The importance of using formal methods and techniques for verification of requirements in the automotive industry has been greatly emphasized with the introduction of the new ISO26262 standard for road vehicles functional safety. The lack of support for formal modeling of requirements still represents an obstacle for the adoption of the formal methods in industry. This paper presents a case study that has been conducted in order to evaluate the difficulties inherent to the process of transforming the system requirements from their traditional written form into semi-formal notation. The case study focuses on a set of non-structured functional requirements for the Electrical and Electronic (E/E) systems inside heavy road vehicles, written in natural language, and reassesses the applicability of the extended Specification Pattern System (SPS) represented in a restricted English grammar. Correlating this experience with former studies, we observe that, as previously claimed, the concept of patterns is likely to be generally applicable for the automotive domain. Additionally, we have identified some potential difficulties in the transformation process, which were not reported by the previous studies and will be used as a basis for further research.",
            "Award": ""
        },
        {
            "Title": "From Architecture to Requirements: Relating Requirements and Architecture for Better Requirements Engineering",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid4-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DFeng+Chen+%22From+Architecture+to+Requirements%3A+Relating+Requirements+and+Architecture+for+Better+Requirements+Engineering%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Feng Chen",
            "AffiliationsString": "University of Limerick, Ireland; Lero, Ireland",
            "Authors": [
                "Feng Chen @ University of Limerick, Ireland / Lero, Ireland"
            ],
            "Affiliations": [
                "University of Limerick, Ireland / Lero, Ireland"
            ],
            "Abstract": "The importance of software requirements is widely acknowledged. However, many software projects still exhibit inadequate Requirements Engineering (RE) practice. More importantly, dealing with Non-Functional Requirements (NFRs) remains as a challenge for software practitioners. This research aims at advancing RE practice through the co-development of requirements and architecture by utilizing the relationship between Architecturally Significant Requirements (ASRs) and Architectural Design Decisions (ADDs).",
            "Award": ""
        },
        {
            "Title": "Quantification of Social Sustainability in Software",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid5-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMaryam+Al+Hinai+%22Quantification+of+Social+Sustainability+in+Software%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Maryam Al Hinai",
            "AffiliationsString": "University of Leicester, UK",
            "Authors": [
                "Maryam Al Hinai @ University of Leicester, UK"
            ],
            "Affiliations": [
                "University of Leicester, UK"
            ],
            "Abstract": "Software, as any other product, must be account for its effects on sustainability of its production and use environments. This research focuses on the social aspect of sustainable development. Currently, there are neither clear methods for evaluating social sustainability of a software system at requirements level nor a comprehensive set of metrics for social sustainability useable in requirements analysis. This research aims to develop a set of such metrics and an accompanying method for analyzing social sustainability requirements of software systems.",
            "Award": ""
        },
        {
            "Title": "Improving Collaborative and Post-WIMP Systems through Requirements Specification",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid2-p",
            "URL": "http%3A%2F%2Fwww.mteruel.es%2Fpapers%2FREDS2014_preprint.pdf",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DQUWFo1Lw8Q8",
            "URLinfo": "http%3A%2F%2Fwww.mteruel.es",
            "DOI": "",
            "PersonsString": "Miguel A. Teruel",
            "AffiliationsString": "University of Castile–La Mancha, Spain",
            "Authors": [
                "Miguel A. Teruel @ University of Castile–La Mancha, Spain"
            ],
            "Affiliations": [
                "University of Castile–La Mancha, Spain"
            ],
            "Abstract": "A proper requirements specification is paramount for achieving the quality of the developed software products. However, well-known Requirements Engineering (RE) techniques lack of enough expressiveness to model the requirements of CSCW systems (Computer Supported Collaborative Work). This is due to the inherent complexity of collaboration among users and their need of awareness. Moreover, the way in which users interact with CSCW systems have evolved greatly to more sophisticated interfaces, beyond the classical desktop computer environments, to those called Post-WIMP (Windows, Icons, Menus, Pointer). Awareness is magnified in such a way that users have to be aware of their context: the artifacts with which to interact, his/her own capabilities as well as those of the others. All this awareness is necessary to allow them to collaborate in virtual and/or augmented environments. This PhD thesis aims at solving this problem by developing a RE framework able to deal with the requirements of CSCW and Post-WIMP systems, making emphasis on the awareness requirements about user’s context.",
            "Award": ""
        },
        {
            "Title": "Stakeholders' Social Interaction in Requirements Engineering of Open Source Software",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid8-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DTanmay+Bhowmik+%22Stakeholders%27+Social+Interaction+in+Requirements+Engineering+of+Open+Source+Software%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tanmay Bhowmik",
            "AffiliationsString": "Mississippi State University, USA",
            "Authors": [
                "Tanmay Bhowmik @ Mississippi State University, USA"
            ],
            "Affiliations": [
                "Mississippi State University, USA"
            ],
            "Abstract": "Requirements engineering (RE) involves human-centric activities that require interaction among different stakeholders. Traditionally, RE has been considered as a centralized, collocated, and phase-specific process. However, in open-source software (OSS) development environment, the core RE activities are iterative and dynamic and follow a rather decentralized software engineering paradigm. This crosscutting characteristic of open-source RE can be conceptualized using the &quot;Twin Peaks&quot; model that weaves RE together with software architecture. Although many weaving mechanisms have been proposed in recent years, lack of theoretical underpinning limits a mechanism&#039;s applicability and usefulness in different scenarios. In this research proposal, we hypothesize stakeholders&#039; social interaction as an ecologically valid weaving mechanism of the &quot;Twin Peaks&quot; in open-source RE. We further outline a concrete research plan to examine the generalizability of this weaving mechanism for three activities: requirements identification, requirements implementation, and creativity in RE. Carrying out this research plan will enable us to gain valuable insights to generate guidelines for enhancing software engineering practice in relevant areas.",
            "Award": ""
        },
        {
            "Title": "Aligning Services and Requirements with User Feedback",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid3-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMuneera+Bano+%22Aligning+Services+and+Requirements+with+User+Feedback%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Muneera Bano",
            "AffiliationsString": "University of Technology Sydney, Australia",
            "Authors": [
                "Muneera Bano @ University of Technology Sydney, Australia"
            ],
            "Affiliations": [
                "University of Technology Sydney, Australia"
            ],
            "Abstract": "For analysts the alignment between the requirements and the available services presents a significant challenge in service oriented paradigm. To address this challenge various technical solutions have already been proposed. Although technical issues play an important role in this selection but organizational and social factors are equally as important in selecting an optimally aligned service for a specific requirement. The users of services are mostly ignored in the alignment process. User feedback analysis has recently gained a lot of research focus, but these benefits have not been fully explored and utilized in service oriented software development. In this paper I present a method for aligning services to requirements that is designed using the Situational Method Engineering approach and it incorporates user feedback about the services. This feedback assists the analysts in extracting required information for making informed decisions while selecting services among available options that satisfies both the user requirements and customer preferences. The method is supported by a proposed tool. The method and the supporting tool will be validated by a controlled experiment and focus group feedback from the practitioners.",
            "Award": ""
        },
        {
            "Title": "Requirements Development and Management of Embedded Real-Time Systems",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid6-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJiale+Zhou+%22Requirements+Development+and+Management+of+Embedded+Real-Time+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jiale Zhou",
            "AffiliationsString": "Mälardalen University, Sweden",
            "Authors": [
                "Jiale Zhou @ Mälardalen University, Sweden"
            ],
            "Affiliations": [
                "Mälardalen University, Sweden"
            ],
            "Abstract": "It is well recognized that most of the anomalies, discovered in the development of embedded real-time systems, belong to requirement and specification phases. To ease the situation, many efforts have been investigated into the area. For requirements development, especially requirements validation and verification, model-driven architecture techniques can be considered as a cost-efficient solution. In order to utilize such advantages, the design of the proposed system is often specified in terms of analyzable models at the certain level of abstraction. Further, different levels of requirements are translated into verifiable queries and fed into the models to be either validated or verified. For requirements management, requirements traceability provides critical support for performing change impact analysis, risk analysis, regression testing, etc. In this thesis, we cover several topics about requirements validation, requirements verification, and requirements traceability. In particular, the technical contributions are three-fold: 1) we propose an approach to requirements validation by using the extended Timed Abstract State Machine (TASM) language with newly defined TASM constructs and, 2) we present a simulation-based method which is powered up by statistical techniques to conduct requirements verification, working with industrial applications and, 3) we introduce an improved VSM-based requirements traceability recovery approach using a novel context analysis. Further, we have demonstrated the applicability of our contributions in real world usage through various case studies.",
            "Award": ""
        },
        {
            "Title": "Context-Sensitive Information Security Risk Identification and Evaluation Techniques",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid1-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDan+Ionita+%22Context-Sensitive+Information+Security+Risk+Identification+and+Evaluation+Techniques%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Dan Ionita",
            "AffiliationsString": "University of Twente, Netherlands",
            "Authors": [
                "Dan Ionita @ University of Twente, Netherlands"
            ],
            "Affiliations": [
                "University of Twente, Netherlands"
            ],
            "Abstract": "The objective of my research is to improve and support the process of Information security Risk Assessment by designing a scalable Risk argumentation framework for socio-digital- technical Risk. Due to the various types of IT systems, diversity of architectures and dynamic nature of Risk, there is no one-size-fits all RA method. As such, the research hopes to identify guidelines for conducting Risk Assessments in contexts that raise special challenges such as Telecom and virtualized infrastructures. Finally, it will suggest ways of qualitatively and quantitatively evaluating Information Security Risks in such scenarios by using argumentation and/or modelling attacker business cases.",
            "Award": ""
        },
        {
            "Title": "Business Processes and Regulations Compliance Management Technology",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid11-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DIlze+Buksa+%22Business+Processes+and+Regulations+Compliance+Management+Technology%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Ilze Buksa",
            "AffiliationsString": "Riga Technical University, Latvia",
            "Authors": [
                "Ilze Buksa @ Riga Technical University, Latvia"
            ],
            "Affiliations": [
                "Riga Technical University, Latvia"
            ],
            "Abstract": "Organizations must comply with a number of external and internal regulations for business governance and must ensure that their processes are running accordingly to requirements of regulations. Therefore business process and regulations compliance analysis audit and management tasks take a very important role in daily operational activities for each organization. Due to high complexity this task can become challenging. In some domains regulations are changing rapidly. Process models must be flexible and easy adjustable to changing requirements, since the lack of ability to comply with regulations can lower down the competitiveness of an organizations. Thus, rapid changes of regulations require rapid changes of related business processes. The goal of the PhD work is to develop business process and regulations compliance management technology which should enable business process construction from regulations and change monitoring of regulations and business processes to ensure easy and rapid modification of business process model or regulations, thus also ensuring compliance.",
            "Award": ""
        },
        {
            "Title": "Creative Strategic Scenarios for Preparation to Requirements Evolution",
            "Type": "Doctoral Symposium",
            "Key": "re14doc-docid12-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMar%C3%ADlia+Guterres+Ferreira+%22Creative+Strategic+Scenarios+for+Preparation+to+Requirements+Evolution%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Marília Guterres Ferreira",
            "AffiliationsString": "PUC-Rio, Brazil",
            "Authors": [
                "Marília Guterres Ferreira @ PUC-Rio, Brazil"
            ],
            "Affiliations": [
                "PUC-Rio, Brazil"
            ],
            "Abstract": "The focus of this research is Creative Strategic Scenarios as predictive models of software evolution for socio-technical systems in organizations. This research seeks to combine theories of Strategic Planning and Creativity to generate strategic scenarios that could predict Organizational Changes. The work will integrate scenarios and the i* goal modelling mechanism to analyse the impacts of organizational change through strategic scenarios.",
            "Award": ""
        },
        {
            "Title": "Ready-Set-Transfer! Technology Transfer in the Requirements Engineering Domain (Panel)",
            "Type": "Panel Paper",
            "Key": "re14pan-panp1-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJane+Huffman+Hayes+and+Didar+Zowghi+%22Ready-Set-Transfer%21+Technology+Transfer+in+the+Requirements+Engineering+Domain+%28Panel%29%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jane Huffman Hayes and Didar Zowghi",
            "AffiliationsString": "University of Kentucky, USA; University of Technology Sydney, Australia",
            "Authors": [
                "Jane Huffman Hayes @ University of Kentucky, USA",
                "Didar Zowghi @ University of Technology Sydney, Australia"
            ],
            "Affiliations": [
                "University of Kentucky, USA",
                "University of Technology Sydney, Australia"
            ],
            "Abstract": "Though the primary goal of requirements engineering research is to propose, develop, and validate effective solutions for important practical problems, practice has shown that successful projects take from 20-25 years to reach full industry adoption, while many projects fade and never advance beyond the initial research phase. In this interactive panel, teams of researchers, representing different requirements engineering research areas, bring ideas for technology transfer to a panel of industrial and government practitioners. The teams make interactive presentations and receive feedback from panelists. Beneath the game-show genre of the panel is the serious goal to foster conversation between practitioners and researchers to improve the effectiveness of technology transfer in the requirements engineering community.",
            "Award": ""
        }
    ],
    "Sessions": [
        {
            "Id": "Xeing2ca9p",
            "Title": "Requirements on a shoestring: how to cope in industry projects with poor requirements engineering awareness",
            "ShortTitle": "Requirements on a shoestring: how to cope in industry projects with poor requirements engineering awareness",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-25 08:30 Requirements on a shoestring: how to cope in industry projects with poor requirements engineering awareness",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "A303",
            "LocationIndex": "12",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "ioy4eiW5se",
            "Title": "4th Workshop on Empirical Requirements Engineerin (EmpiRE)",
            "ShortTitle": "4th Workshop on Empirical Requirements Engineerin (EmpiRE)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-25 08:30 4th Workshop on Empirical Requirements Engineerin (EmpiRE)",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "C235",
            "LocationIndex": "3",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "oNg0ooquoa",
            "Title": "1st Workshop on Evolving Security and Privacy Requirements Engineering (ESPRE)",
            "ShortTitle": "1st Workshop on Evolving Security and Privacy Requirements Engineering (ESPRE)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-25 08:30 1st Workshop on Evolving Security and Privacy Requirements Engineering (ESPRE)",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "C236",
            "LocationIndex": "4",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Shuxuy2wee",
            "Title": "4th International Model-Driven Requirements Engineering Workshop (MoDRE)",
            "ShortTitle": "4th International Model-Driven Requirements Engineering Workshop (MoDRE)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-25 08:30 4th International Model-Driven Requirements Engineering Workshop (MoDRE)",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "C237",
            "LocationIndex": "5",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Ac3ohVayek",
            "Title": "Modeling and analysis with the User Requirements Notation 2.0: features, goals, and scenarios",
            "ShortTitle": "Modeling and analysis with the User Requirements Notation 2.0: features, goals, and scenarios",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-25 08:30 Modeling and analysis with the User Requirements Notation 2.0: features, goals, and scenarios",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "C245",
            "LocationIndex": "13",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "raeRee3ohF",
            "Title": "Requirements driven innovation",
            "ShortTitle": "Requirements driven innovation",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-25 08:30 Requirements driven innovation",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "C444",
            "LocationIndex": "10",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "rieveil6Eo",
            "Title": "Case studies in requirements engineering",
            "ShortTitle": "Case studies in requirements engineering",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-25 08:30 Case studies in requirements engineering",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "C445",
            "LocationIndex": "14",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "em3Eaja5ze",
            "Title": "Unlocking creative collaboration in RE and product management: theory and practice through improvisation",
            "ShortTitle": "Unlocking creative collaboration in RE and product management: theory and practice through improvisation",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-25 08:30 Unlocking creative collaboration in RE and product management: theory and practice through improvisation",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "C446",
            "LocationIndex": "15",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "eitu8VaiYi",
            "Title": "2nd International Workshop on Usability and Accessibility focused Requirements Engineering (UsARE)",
            "ShortTitle": "2nd International Workshop on Usability and Accessibility focused Requirements Engineering (UsARE)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-25 08:30 2nd International Workshop on Usability and Accessibility focused Requirements Engineering (UsARE)",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "J1270",
            "LocationIndex": "8",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Uuheg2yie4",
            "Title": "Workshop on Requirements Engineering Education &amp; Training (REET)",
            "ShortTitle": "Workshop on Requirements Engineering Education &amp; Training (REET)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-25 08:30 Workshop on Requirements Engineering Education &amp; Training (REET)",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "J1280",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "ohX6aixie4",
            "Title": "1st International Workshop on the Interrelations between Requirements Engineering &amp; Business Process Management (REBPM)",
            "ShortTitle": "1st International Workshop on the Interrelations between Requirements Engineering &amp; Business Process Management (REBPM)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-25 08:30 1st International Workshop on the Interrelations between Requirements Engineering &amp; Business Process Management (REBPM)",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "J1360",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "quoos0uLoh",
            "Title": "Product management essentials",
            "ShortTitle": "Product management essentials",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-25 08:30 Product management essentials",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "J3423",
            "LocationIndex": "9",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "meichu8Na4",
            "Title": "Driving Architectural Design in Agile Projects: A Persona-Centric Approach",
            "ShortTitle": "Driving Architectural Design in Agile Projects: A Persona-Centric Approach",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-25 08:30 Driving Architectural Design in Agile Projects: A Persona-Centric Approach",
            "Day": "2014-08-25",
            "Time": "08:30 - 17:00",
            "Location": "J3506",
            "LocationIndex": "11",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "EidohR3oob",
            "Title": "Doctoral Symposium",
            "ShortTitle": "Doctoral Symposium",
            "Type": "Doctoral Symposium",
            "ShortType": "Doctoral Symposium",
            "Key": "2014-08-25 09:00 Doctoral Symposium",
            "Day": "2014-08-25",
            "Time": "09:00 - 17:00",
            "Location": "J1640-J1650",
            "LocationIndex": "16",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14DOC",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14doc-docid4-p",
                "re14doc-docid5-p",
                "re14doc-docid2-p",
                "re14doc-docid8-p",
                "re14doc-docid3-p",
                "re14doc-docid6-p",
                "re14doc-docid1-p",
                "re14doc-docid11-p",
                "re14doc-docid12-p"
            ]
        },
        {
            "Id": "chu2yie8Iw",
            "Title": "1st International Workshop on Artificial Intelligence for Requirements Engineering (AIRE)",
            "ShortTitle": "1st International Workshop on Artificial Intelligence for Requirements Engineering (AIRE)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-26 08:30 1st International Workshop on Artificial Intelligence for Requirements Engineering (AIRE)",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "C235",
            "LocationIndex": "3",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "go0rohQua0",
            "Title": "8th International Workshop on Software Product Management (IWSPM)",
            "ShortTitle": "8th International Workshop on Software Product Management (IWSPM)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-26 08:30 8th International Workshop on Software Product Management (IWSPM)",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "C236",
            "LocationIndex": "4",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Ahha8shee3",
            "Title": "4th International Workshop on Requirements Patterns (RePa)",
            "ShortTitle": "4th International Workshop on Requirements Patterns (RePa)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-26 08:30 4th International Workshop on Requirements Patterns (RePa)",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "C237",
            "LocationIndex": "5",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "ahji3fei1B",
            "Title": "Model driven requirements engineering",
            "ShortTitle": "Model driven requirements engineering",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-26 08:30 Model driven requirements engineering",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "C245",
            "LocationIndex": "13",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "aeWie0Se6i",
            "Title": "Eliciting unstated requirements",
            "ShortTitle": "Eliciting unstated requirements",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-26 08:30 Eliciting unstated requirements",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "C444",
            "LocationIndex": "10",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "hieGaibu5i",
            "Title": "Writing good requirements",
            "ShortTitle": "Writing good requirements",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-26 08:30 Writing good requirements",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "C445",
            "LocationIndex": "14",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "ooSh8shaeM",
            "Title": "Developing modelling toolkits for requirements engineering",
            "ShortTitle": "Developing modelling toolkits for requirements engineering",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-26 08:30 Developing modelling toolkits for requirements engineering",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "C446",
            "LocationIndex": "15",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "uboo8thi4U",
            "Title": "1st International Workshop on Requirements Engineering and Testing (RET)",
            "ShortTitle": "1st International Workshop on Requirements Engineering and Testing (RET)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-26 08:30 1st International Workshop on Requirements Engineering and Testing (RET)",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "J1270",
            "LocationIndex": "8",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "aiphij1Yi1",
            "Title": "5th International Workshop on Requirements Prioritization and Communication (RePriCo)",
            "ShortTitle": "5th International Workshop on Requirements Prioritization and Communication (RePriCo)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-26 08:30 5th International Workshop on Requirements Prioritization and Communication (RePriCo)",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "J1280",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "shahZ6aeHi",
            "Title": "7th International Workshop on Requirements Engineering and Law (RELAW)",
            "ShortTitle": "7th International Workshop on Requirements Engineering and Law (RELAW)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-26 08:30 7th International Workshop on Requirements Engineering and Law (RELAW)",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "J1360",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Jo3aiv4Aer",
            "Title": "3rd International Workshop on Requirements Engineering for Sustainable Systems (RE4SuSy)",
            "ShortTitle": "3rd International Workshop on Requirements Engineering for Sustainable Systems (RE4SuSy)",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2014-08-26 08:30 3rd International Workshop on Requirements Engineering for Sustainable Systems (RE4SuSy)",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "J3423",
            "LocationIndex": "9",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Eyee6Idaeb",
            "Title": "Product and user driven requirement specifications derived from your business model",
            "ShortTitle": "Product and user driven requirement specifications derived from your business model",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2014-08-26 08:30 Product and user driven requirement specifications derived from your business model",
            "Day": "2014-08-26",
            "Time": "08:30 - 17:00",
            "Location": "J3506",
            "LocationIndex": "11",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "voh4Joong4",
            "Title": "Opening",
            "ShortTitle": "Opening",
            "Type": "Plenary",
            "ShortType": "Plenary",
            "Key": "2014-08-27 08:30 Opening",
            "Day": "2014-08-27",
            "Time": "08:30 - 09:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Tony Gorschek and Robyn Lutz",
            "Chairs": [
                "Tony Gorschek @",
                "Robyn Lutz @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Uw1eito0qu",
            "Title": "Startups and Requirements (Keynote)",
            "ShortTitle": "Startups and Requirements (Keynote)",
            "Type": "Keynotes",
            "ShortType": "Keynotes",
            "Key": "2014-08-27 09:00 Startups and Requirements (Keynote)",
            "Day": "2014-08-27",
            "Time": "09:00 - 10:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Claes Wohlin",
            "Chairs": [
                "Claes Wohlin @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14KEY",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14key-key01-p"
            ]
        },
        {
            "Id": "johSoh8jae",
            "Title": "Formal Modeling and Analysis",
            "ShortTitle": "Formal Modeling and Analysis",
            "Type": "Research Track B",
            "ShortType": "Research Track B",
            "Key": "2014-08-27 10:30 Formal Modeling and Analysis",
            "Day": "2014-08-27",
            "Time": "10:30 - 12:00",
            "Location": "J1610",
            "LocationIndex": "2",
            "ChairsString": "Mats Heimdahl",
            "Chairs": [
                "Mats Heimdahl @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp066-p",
                "re14main-mainp076-p",
                "re14main-mainp093-p"
            ]
        },
        {
            "Id": "soot0pheiV",
            "Title": "Empirical Studies in Elicitation",
            "ShortTitle": "Empirical Studies in Elicitation",
            "Type": "Research Track A",
            "ShortType": "Research Track A",
            "Key": "2014-08-27 10:30 Empirical Studies in Elicitation",
            "Day": "2014-08-27",
            "Time": "10:30 - 12:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Daniel Amyot",
            "Chairs": [
                "Daniel Amyot @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp126-p",
                "re14main-mainp035-p",
                "re14main-mainp074-p"
            ]
        },
        {
            "Id": "alaevae1Ph",
            "Title": "Lightweight RE Methods",
            "ShortTitle": "Lightweight RE Methods",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2014-08-27 10:30 Lightweight RE Methods",
            "Day": "2014-08-27",
            "Time": "10:30 - 12:00",
            "Location": "J1620",
            "LocationIndex": "1",
            "ChairsString": "David Callele",
            "Chairs": [
                "David Callele @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14IND",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14ind-indp002-p",
                "re14ind-indp027-p",
                "re14ind-indp014-p"
            ]
        },
        {
            "Id": "Ahw3ohTilo",
            "Title": "Handling Change and Evolution",
            "ShortTitle": "Handling Change and Evolution",
            "Type": "Research Track B",
            "ShortType": "Research Track B",
            "Key": "2014-08-27 13:30 Handling Change and Evolution",
            "Day": "2014-08-27",
            "Time": "13:30 - 15:00",
            "Location": "J1610",
            "LocationIndex": "2",
            "ChairsString": "Nelly Bencomo",
            "Chairs": [
                "Nelly Bencomo @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp065-p",
                "re14main-mainp131-p",
                "re14main-mainp062-p"
            ]
        },
        {
            "Id": "exay7ohFee",
            "Title": "Legal and Regulatory Requirements",
            "ShortTitle": "Legal and Regulatory Requirements",
            "Type": "Research Track A",
            "ShortType": "Research Track A",
            "Key": "2014-08-27 13:30 Legal and Regulatory Requirements",
            "Day": "2014-08-27",
            "Time": "13:30 - 15:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Seok-Won Lee",
            "Chairs": [
                "Seok-Won Lee @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp009-p",
                "re14main-mainp098-p",
                "re14main-mainp071-p"
            ]
        },
        {
            "Id": "Oidobahh1i",
            "Title": "Stakeholder Collaboration",
            "ShortTitle": "Stakeholder Collaboration",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2014-08-27 13:30 Stakeholder Collaboration",
            "Day": "2014-08-27",
            "Time": "13:30 - 15:00",
            "Location": "J1620",
            "LocationIndex": "1",
            "ChairsString": "Sami Jantunen",
            "Chairs": [
                "Sami Jantunen @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14IND",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14ind-indp037-p",
                "re14ind-indp024-p",
                "re14ind-indp025-p"
            ]
        },
        {
            "Id": "Eical4gai5",
            "Title": "Most Influential Paper 10 Years Later (from RE’04) and Posters Lightning Round",
            "ShortTitle": "Most Influential Paper 10 Years Later (from RE’04) and Posters Lightning Round",
            "Type": "Meeting",
            "ShortType": "Meeting",
            "Key": "2014-08-27 15:30 Most Influential Paper 10 Years Later (from RE’04) and Posters Lightning Round",
            "Day": "2014-08-27",
            "Time": "15:30 - 17:00",
            "Location": "J1610",
            "LocationIndex": "2",
            "ChairsString": "Neil Maiden and Jennifer Horkoff",
            "Chairs": [
                "Neil Maiden @",
                "Jennifer Horkoff @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": "RE2004 Most Influential Paper: \"Speeding up Requirements Management in a Product Software Company: Linking Customer Wishes to Product Requirements through Linguistic Engineering\", Johan Natt och Dag, Vincenzo Gervasi, Sjaak Brinkkemper, and Björn Regnell"
        },
        {
            "Id": "neiSh8eev7",
            "Title": "Traceability",
            "ShortTitle": "Traceability",
            "Type": "Research Track A",
            "ShortType": "Research Track A",
            "Key": "2014-08-27 15:30 Traceability",
            "Day": "2014-08-27",
            "Time": "15:30 - 17:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Emmanuel Letier",
            "Chairs": [
                "Emmanuel Letier @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp038-p",
                "re14main-mainp114-p",
                "re14main-mainp084-p"
            ]
        },
        {
            "Id": "eKahjee7ai",
            "Title": "RE in Practice: Experiences from the Field I",
            "ShortTitle": "RE in Practice: Experiences from the Field I",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2014-08-27 15:30 RE in Practice: Experiences from the Field I",
            "Day": "2014-08-27",
            "Time": "15:30 - 17:00",
            "Location": "J1620",
            "LocationIndex": "1",
            "ChairsString": "Smita Ghaisas",
            "Chairs": [
                "Smita Ghaisas @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14IND",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14ind-indp012-p",
                "re14ind-indp022-p",
                "re14ind-indp017-p"
            ]
        },
        {
            "Id": "chaeye8Mie",
            "Title": "Now More Than Ever: Privacy and Security Are Required (Keynote)",
            "ShortTitle": "Now More Than Ever: Privacy and Security Are Required (Keynote)",
            "Type": "Keynotes",
            "ShortType": "Keynotes",
            "Key": "2014-08-28 08:45 Now More Than Ever: Privacy and Security Are Required (Keynote)",
            "Day": "2014-08-28",
            "Time": "08:45 - 10:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Alistair Sutcliffe",
            "Chairs": [
                "Alistair Sutcliffe @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14KEY",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14key-key02-p"
            ]
        },
        {
            "Id": "aCae6ea4ve",
            "Title": "Industry Laboratory 1: Invited company talks",
            "ShortTitle": "Industry Laboratory 1: Invited company talks",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2014-08-28 10:30 Industry Laboratory 1: Invited company talks",
            "Day": "2014-08-28",
            "Time": "10:30 - 12:00",
            "Location": "J1620",
            "LocationIndex": "1",
            "ChairsString": "Alistair Mavin and Eero Uusitalo",
            "Chairs": [
                "Alistair Mavin @",
                "Eero Uusitalo @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "da5wuaM3de",
            "Title": "Security and Privacy Requirements",
            "ShortTitle": "Security and Privacy Requirements",
            "Type": "Research Track B",
            "ShortType": "Research Track B",
            "Key": "2014-08-28 10:30 Security and Privacy Requirements",
            "Day": "2014-08-28",
            "Time": "10:30 - 12:00",
            "Location": "J1610",
            "LocationIndex": "2",
            "ChairsString": "Nancy Mead",
            "Chairs": [
                "Nancy Mead @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp037-p",
                "re14main-mainp040-p",
                "re14main-mainp127-p"
            ]
        },
        {
            "Id": "aighufoQu9",
            "Title": "Discovering Requirements",
            "ShortTitle": "Discovering Requirements",
            "Type": "Research Track A",
            "ShortType": "Research Track A",
            "Key": "2014-08-28 10:30 Discovering Requirements",
            "Day": "2014-08-28",
            "Time": "10:30 - 12:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Vincenzo Gervasi",
            "Chairs": [
                "Vincenzo Gervasi @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp080-p",
                "re14main-mainp059-p",
                "re14main-mainp101-p"
            ]
        },
        {
            "Id": "iyu5Ahlei5",
            "Title": "Communicating Requirements",
            "ShortTitle": "Communicating Requirements",
            "Type": "Research Track A",
            "ShortType": "Research Track A",
            "Key": "2014-08-28 13:30 Communicating Requirements",
            "Day": "2014-08-28",
            "Time": "13:30 - 15:00",
            "Location": "J1610",
            "LocationIndex": "2",
            "ChairsString": "John Mylopoulos",
            "Chairs": [
                "John Mylopoulos @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp003-p",
                "re14main-mainp018-p",
                "re14main-mainp136-p"
            ]
        },
        {
            "Id": "ohXaig2ja9",
            "Title": "Ready-Set-Transfer! Technology Transfer in the Requirements Engineering Domain (Panel)",
            "ShortTitle": "Ready-Set-Transfer! Technology Transfer in the Requirements Engineering Domain (Panel)",
            "Type": "Panel",
            "ShortType": "Panel",
            "Key": "2014-08-28 13:30 Ready-Set-Transfer! Technology Transfer in the Requirements Engineering Domain (Panel)",
            "Day": "2014-08-28",
            "Time": "13:30 - 15:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Jane Hayes and Didar Zowghi",
            "Chairs": [
                "Jane Hayes @",
                "Didar Zowghi @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14PAN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14pan-panp1-p"
            ]
        },
        {
            "Id": "lah5Choo5o",
            "Title": "Industry Laboratory 2: Invited company talks",
            "ShortTitle": "Industry Laboratory 2: Invited company talks",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2014-08-28 15:30 Industry Laboratory 2: Invited company talks",
            "Day": "2014-08-28",
            "Time": "15:30 - 17:00",
            "Location": "J1620",
            "LocationIndex": "1",
            "ChairsString": "Alistair Mavin and Eero Uusitalo",
            "Chairs": [
                "Alistair Mavin @",
                "Eero Uusitalo @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "ieTohsao3n",
            "Title": "Automated Support for Eliciting Requirements",
            "ShortTitle": "Automated Support for Eliciting Requirements",
            "Type": "Research Track A",
            "ShortType": "Research Track A",
            "Key": "2014-08-28 15:30 Automated Support for Eliciting Requirements",
            "Day": "2014-08-28",
            "Time": "15:30 - 17:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Zhi Jin",
            "Chairs": [
                "Zhi Jin @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp110-p",
                "re14main-mainp039-p",
                "re14ind-indp015-p"
            ]
        },
        {
            "Id": "Ahkaih1oyu",
            "Title": "Tool Demonstrations and Posters",
            "ShortTitle": "Tool Demonstrations and Posters",
            "Type": "Tool Demonstrations and Posters",
            "ShortType": "Tool Demonstrations and Posters",
            "Key": "2014-08-28 15:30 Tool Demonstrations and Posters",
            "Day": "2014-08-28",
            "Time": "15:30 - 17:00",
            "Location": "J1610",
            "LocationIndex": "2",
            "ChairsString": "Jennifer Horkoff and Richard Berntsson Svensson",
            "Chairs": [
                "Jennifer Horkoff @",
                "Richard Berntsson Svensson @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14DEMOPOSTERS",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14demoposters-demopostersid5-p",
                "re14demoposters-demopostersid15-p",
                "re14demoposters-demopostersid7-p",
                "re14demoposters-demopostersid11-p",
                "re14demoposters-demopostersid12-p",
                "re14demoposters-demopostersid1-p",
                "re14demoposters-demopostersid8-p",
                "re14demoposters-demopostersid6-p",
                "re14demoposters-demopostersid4-p",
                "re14demoposters-demopostersid9-p",
                "re14demoposters-demopostersid16-p"
            ]
        },
        {
            "Id": "ieBook8doo",
            "Title": "Rethinking Software: Business Change and the Consequences for Software Engineering (Keynote)",
            "ShortTitle": "Rethinking Software: Business Change and the Consequences for Software Engineering (Keynote)",
            "Type": "Keynotes",
            "ShortType": "Keynotes",
            "Key": "2014-08-29 08:45 Rethinking Software: Business Change and the Consequences for Software Engineering (Keynote)",
            "Day": "2014-08-29",
            "Time": "08:45 - 10:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Robyn Lutz",
            "Chairs": [
                "Robyn Lutz @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": "",
            "Items": [
                "Anthony Finkelstein @ University College London, UK : Rethinking Software: Business Change and the Consequences for Software Engineering (Keynote)"
            ]
        },
        {
            "Id": "miVie6ahCi",
            "Title": "Workshop highlights",
            "ShortTitle": "Workshop highlights",
            "Type": "Meeting",
            "ShortType": "Meeting",
            "Key": "2014-08-29 10:30 Workshop highlights",
            "Day": "2014-08-29",
            "Time": "10:30 - 12:00",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Travis Breaux and Eric Knauss",
            "Chairs": [
                "Travis Breaux @",
                "Eric Knauss @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "thaiw5ohDa",
            "Title": "Requirements Management Concerns",
            "ShortTitle": "Requirements Management Concerns",
            "Type": "Research Track A",
            "ShortType": "Research Track A",
            "Key": "2014-08-29 10:30 Requirements Management Concerns",
            "Day": "2014-08-29",
            "Time": "10:30 - 12:00",
            "Location": "J1610",
            "LocationIndex": "2",
            "ChairsString": "Didar Zowghi",
            "Chairs": [
                "Didar Zowghi @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp019-p",
                "re14main-mainp102-p",
                "re14main-mainp005-p"
            ]
        },
        {
            "Id": "iesheo0ioN",
            "Title": "RE in Practice: Experiences from the Field II",
            "ShortTitle": "RE in Practice: Experiences from the Field II",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2014-08-29 10:30 RE in Practice: Experiences from the Field II",
            "Day": "2014-08-29",
            "Time": "10:30 - 12:00",
            "Location": "J1620",
            "LocationIndex": "1",
            "ChairsString": "Michael Panis",
            "Chairs": [
                "Michael Panis @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14IND",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14ind-indp018-p",
                "re14ind-indp032-p",
                "re14ind-indp028-p"
            ]
        },
        {
            "Id": "Ceeph0mooJ",
            "Title": "Mini-tutorial: How to write an industrial RE paper",
            "ShortTitle": "Mini-tutorial: How to write an industrial RE paper",
            "Type": "Industry Track",
            "ShortType": "Industry Track",
            "Key": "2014-08-29 13:30 Mini-tutorial: How to write an industrial RE paper",
            "Day": "2014-08-29",
            "Time": "13:30 - 14:30",
            "Location": "J1620",
            "LocationIndex": "1",
            "ChairsString": "Sarah Gregory",
            "Chairs": [
                "Sarah Gregory @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Seaph7thai",
            "Title": "Panel: Educational and industrial RE needs",
            "ShortTitle": "Panel: Educational and industrial RE needs",
            "Type": "Panel",
            "ShortType": "Panel",
            "Key": "2014-08-29 13:30 Panel: Educational and industrial RE needs",
            "Day": "2014-08-29",
            "Time": "13:30 - 14:30",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Bashar Nuseibeh",
            "Chairs": [
                "Bashar Nuseibeh @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "quee5xiePh",
            "Title": "Quality Goals",
            "ShortTitle": "Quality Goals",
            "Type": "Research Track A",
            "ShortType": "Research Track A",
            "Key": "2014-08-29 13:30 Quality Goals",
            "Day": "2014-08-29",
            "Time": "13:30 - 14:30",
            "Location": "J1610",
            "LocationIndex": "2",
            "ChairsString": "Jane Cleland Huang",
            "Chairs": [
                "Jane Cleland Huang @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re14main-mainp070-p",
                "re14main-mainp120-p"
            ]
        },
        {
            "Id": "pu5ka4Ri8e",
            "Title": "Closing session: “Farewell with ice-cream” and presentation of next year’s RE",
            "ShortTitle": "Closing session: “Farewell with ice-cream” and presentation of next year’s RE",
            "Type": "Plenary",
            "ShortType": "Plenary",
            "Key": "2014-08-29 14:30 Closing session: “Farewell with ice-cream” and presentation of next year’s RE",
            "Day": "2014-08-29",
            "Time": "14:30 - 15:15",
            "Location": "Multiroom",
            "LocationIndex": "0",
            "ChairsString": "Tony Gorschek and Robyn Lutz",
            "Chairs": [
                "Tony Gorschek @",
                "Robyn Lutz @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE14",
            "URL": "",
            "Abstract": ""
        }
    ],
    "People": [
        {
            "Name": "Morayo Adedjouma",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Morayo Adedjouma @ University of Luxembourg, Luxembourg",
            "Id": "f941b487e9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Abdulrhman Alkhanifer",
            "Affiliation": "Rochester Institute of Technology, USA",
            "Key": "Abdulrhman Alkhanifer @ Rochester Institute of Technology, USA",
            "Id": "e36b033436",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohamed Almorsy",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Mohamed Almorsy @ Swinburne University of Technology, Australia",
            "Id": "3b8efa6691",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Carina Alves",
            "Affiliation": "Federal University of Pernambuco, Brazil",
            "Key": "Carina Alves @ Federal University of Pernambuco, Brazil",
            "Id": "6e2fea5d63",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sorawit Amornborvornwong",
            "Affiliation": "DePaul University, USA",
            "Key": "Sorawit Amornborvornwong @ DePaul University, USA",
            "Id": "410501aab0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Amyot",
            "Affiliation": "",
            "Key": "Daniel Amyot @",
            "Id": "7897313d5e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Amyot",
            "Affiliation": "University of Ottawa, Canada",
            "Key": "Daniel Amyot @ University of Ottawa, Canada",
            "Id": "542a82a2d8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Preethu Rose Anish",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Preethu Rose Anish @ Tata Consultancy Services, India",
            "Id": "cf60ab3ee9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Annie I. Antón",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Annie I. Antón @ Georgia Tech, USA",
            "Id": "7150797553",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Leandro Antonelli",
            "Affiliation": "Universidad Nacional de La Plata, Argentina",
            "Key": "Leandro Antonelli @ Universidad Nacional de La Plata, Argentina",
            "Id": "bbd389c5e3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mikio Aoyama",
            "Affiliation": "Nanzan University, Japan",
            "Key": "Mikio Aoyama @ Nanzan University, Japan",
            "Id": "2642a724b8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rundale Aquanette",
            "Affiliation": "DePaul University, USA",
            "Key": "Rundale Aquanette @ DePaul University, USA",
            "Id": "addd29e530",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "F. Başak Aydemir",
            "Affiliation": "University of Trento, Italy",
            "Key": "F. Başak Aydemir @ University of Trento, Italy",
            "Id": "39ddcb0079",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Julia Badger",
            "Affiliation": "NASA, USA",
            "Key": "Julia Badger @ NASA, USA",
            "Id": "37d42f200f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Muneera Bano",
            "Affiliation": "University of Technology Sydney, Australia",
            "Key": "Muneera Bano @ University of Technology Sydney, Australia",
            "Id": "a4c818b426",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Steffen Becker",
            "Affiliation": "University of Paderborn, Germany",
            "Key": "Steffen Becker @ University of Paderborn, Germany",
            "Id": "840b5c2ca0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nelly Bencomo",
            "Affiliation": "",
            "Key": "Nelly Bencomo @",
            "Id": "f195f78194",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tanmay Bhowmik",
            "Affiliation": "Mississippi State University, USA",
            "Key": "Tanmay Bhowmik @ Mississippi State University, USA",
            "Id": "11a8eb6f0d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Boris Böttcher",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Boris Böttcher @ University of Hamburg, Germany",
            "Id": "ef0a63d433",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Camilla Bomfim",
            "Affiliation": "State University of Rio de Janeiro, Brazil",
            "Key": "Camilla Bomfim @ State University of Rio de Janeiro, Brazil",
            "Id": "db7b24edf7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alexander Borgida",
            "Affiliation": "Rutgers University, USA",
            "Key": "Alexander Borgida @ Rutgers University, USA",
            "Id": "79403001b0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Arber Borici",
            "Affiliation": "University of Victoria, Canada",
            "Key": "Arber Borici @ University of Victoria, Canada",
            "Id": "3fbca6c2df",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Travis Breaux",
            "Affiliation": "",
            "Key": "Travis Breaux @",
            "Id": "d6c33a5e54",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Travis D. Breaux",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Travis D. Breaux @ Carnegie Mellon University, USA",
            "Id": "4b661d414d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lionel C. Briand",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Lionel C. Briand @ University of Luxembourg, Luxembourg",
            "Id": "a7933979fa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sjaak Brinkkemper",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Sjaak Brinkkemper @ Utrecht University, Netherlands",
            "Id": "1447dbc013",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lars Bruun",
            "Affiliation": "Bankdata, Denmark",
            "Key": "Lars Bruun @ Bankdata, Denmark",
            "Id": "199c7f2e8a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jens Bürger",
            "Affiliation": "TU Dortmund, Germany",
            "Key": "Jens Bürger @ TU Dortmund, Germany",
            "Id": "a6dc75ef1c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ilze Buksa",
            "Affiliation": "Riga Technical University, Latvia",
            "Key": "Ilze Buksa @ Riga Technical University, Latvia",
            "Id": "fe2e7fffc4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christopher N. Bull",
            "Affiliation": "Lancaster University, UK",
            "Key": "Christopher N. Bull @ Lancaster University, UK",
            "Id": "57597525bd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Antoine Cailliau",
            "Affiliation": "Université Catholique de Louvain, Belgium",
            "Key": "Antoine Cailliau @ Université Catholique de Louvain, Belgium",
            "Id": "e8e8a4ebcf",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Callele",
            "Affiliation": "",
            "Key": "David Callele @",
            "Id": "367aff61e7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rachna Chakraborty",
            "Affiliation": "GrayPE Systems, India",
            "Key": "Rachna Chakraborty @ GrayPE Systems, India",
            "Id": "08a8d927b5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marsha Chechik",
            "Affiliation": "University of Toronto, Canada",
            "Key": "Marsha Chechik @ University of Toronto, Canada",
            "Id": "e839efce16",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bihuan Chen",
            "Affiliation": "Fudan University, China",
            "Key": "Bihuan Chen @ Fudan University, China",
            "Id": "98a61e7473",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Feng Chen",
            "Affiliation": "University of Limerick, Ireland / Lero, Ireland",
            "Key": "Feng Chen @ University of Limerick, Ireland / Lero, Ireland",
            "Id": "bc37e4432e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jinghui Cheng",
            "Affiliation": "DePaul University, USA",
            "Key": "Jinghui Cheng @ DePaul University, USA",
            "Id": "f1bac9fa0a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Amit K. Chopra",
            "Affiliation": "Lancaster University, UK",
            "Key": "Amit K. Chopra @ Lancaster University, UK",
            "Id": "ac1d3a1e08",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Charles Claunch",
            "Affiliation": "NASA, USA",
            "Key": "Charles Claunch @ NASA, USA",
            "Id": "af612473f2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Cleland-Huang",
            "Affiliation": "DePaul University, USA",
            "Key": "Jane Cleland-Huang @ DePaul University, USA",
            "Id": "64f5ba02ff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fabiano Dalpiaz",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Fabiano Dalpiaz @ Utrecht University, Netherlands",
            "Id": "9b8566914f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniela Damian",
            "Affiliation": "University of Victoria, Canada",
            "Key": "Daniela Damian @ University of Victoria, Canada",
            "Id": "b741b3a670",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maya Daneva",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Maya Daneva @ University of Twente, Netherlands",
            "Id": "bce83aefb9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Thijmen de Gooijer",
            "Affiliation": "ABB Research, Sweden",
            "Key": "Thijmen de Gooijer @ ABB Research, Sweden",
            "Id": "a43983040a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tiago de Oliveira",
            "Affiliation": "Federal University of São Paulo, Brazil",
            "Key": "Tiago de Oliveira @ Federal University of São Paulo, Brazil",
            "Id": "80883eeec0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alessio Di Sandro",
            "Affiliation": "University of Toronto, Canada",
            "Key": "Alessio Di Sandro @ University of Toronto, Canada",
            "Id": "612fa2b9eb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Leticia Duboc",
            "Affiliation": "State University of Rio de Janeiro, Brazil",
            "Key": "Leticia Duboc @ State University of Rio de Janeiro, Brazil",
            "Id": "c7ff8dad4a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eric Dubois",
            "Affiliation": "CRP Henri Tudor, Luxembourg",
            "Key": "Eric Dubois @ CRP Henri Tudor, Luxembourg",
            "Id": "3996a50087",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sven Feja",
            "Affiliation": "Kiel University, Germany",
            "Key": "Sven Feja @ Kiel University, Germany",
            "Id": "de0e4438cb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marília Guterres Ferreira",
            "Affiliation": "PUC-Rio, Brazil",
            "Key": "Marília Guterres Ferreira @ PUC-Rio, Brazil",
            "Id": "4febf00a1e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Markus Fiedler",
            "Affiliation": "Blekinge Institute of Technology, Sweden",
            "Key": "Markus Fiedler @ Blekinge Institute of Technology, Sweden",
            "Id": "4c6ddfac11",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Predrag Filipovikj",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Predrag Filipovikj @ Mälardalen University, Sweden",
            "Id": "9565115a05",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anthony Finkelstein",
            "Affiliation": "University College London, UK",
            "Key": "Anthony Finkelstein @ University College London, UK",
            "Id": "70d984a6cb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Farnaz Fotrousi",
            "Affiliation": "Blekinge Institute of Technology, Sweden",
            "Key": "Farnaz Fotrousi @ Blekinge Institute of Technology, Sweden",
            "Id": "03a9e901b4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Samuel A. Fricker",
            "Affiliation": "Blekinge Institute of Technology, Sweden",
            "Key": "Samuel A. Fricker @ Blekinge Institute of Technology, Sweden",
            "Id": "2570ea74fd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Emmerich Fuchs",
            "Affiliation": "Zühlke Management Consultants, Switzerland",
            "Key": "Emmerich Fuchs @ Zühlke Management Consultants, Switzerland",
            "Id": "80cb3b05e6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stefan Gärtner",
            "Affiliation": "Leibniz Universität Hannover, Germany",
            "Key": "Stefan Gärtner @ Leibniz Universität Hannover, Germany",
            "Id": "9f53aeb350",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Vincenzo Gervasi",
            "Affiliation": "",
            "Key": "Vincenzo Gervasi @",
            "Id": "c5eefca29d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Vincenzo Gervasi",
            "Affiliation": "University of Pisa, Italy",
            "Key": "Vincenzo Gervasi @ University of Pisa, Italy",
            "Id": "e02e659a6e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Smita Ghaisas",
            "Affiliation": "",
            "Key": "Smita Ghaisas @",
            "Id": "4064fac7d3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Smita Ghaisas",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Smita Ghaisas @ Tata Consultancy Services, India",
            "Id": "d639749ee5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sepideh Ghanavati",
            "Affiliation": "CRP Henri Tudor, Luxembourg",
            "Key": "Sepideh Ghanavati @ CRP Henri Tudor, Luxembourg",
            "Id": "3d1b9938ef",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Carlo Ghezzi",
            "Affiliation": "Politecnico di Milano, Italy",
            "Key": "Carlo Ghezzi @ Politecnico di Milano, Italy",
            "Id": "02192d70a6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paolo Giorgini",
            "Affiliation": "University of Trento, Italy",
            "Key": "Paolo Giorgini @ University of Trento, Italy",
            "Id": "8a7fdfc29d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Glinz",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Martin Glinz @ University of Zurich, Switzerland",
            "Id": "b894e77c4b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David G. Gordon",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "David G. Gordon @ Carnegie Mellon University, USA",
            "Id": "87625a0396",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tony Gorschek",
            "Affiliation": "",
            "Key": "Tony Gorschek @",
            "Id": "feae3e5f4a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andreas Gregoriades",
            "Affiliation": "European University Cyprus, Cyprus",
            "Key": "Andreas Gregoriades @ European University Cyprus, Cyprus",
            "Id": "fdb4f5213d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sarah Gregory",
            "Affiliation": "",
            "Key": "Sarah Gregory @",
            "Id": "a992436b57",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "John Grundy",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "John Grundy @ Swinburne University of Technology, Australia",
            "Id": "62e2882729",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Giancarlo Guizzardi",
            "Affiliation": "Federal University of Espírito Santo, Brazil",
            "Key": "Giancarlo Guizzardi @ Federal University of Espírito Santo, Brazil",
            "Id": "9695a09ffb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Renata S. S. Guizzardi",
            "Affiliation": "Federal University of Espírito Santo, Brazil",
            "Key": "Renata S. S. Guizzardi @ Federal University of Espírito Santo, Brazil",
            "Id": "d162028b0a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Emitza Guzman",
            "Affiliation": "TU München, Germany",
            "Key": "Emitza Guzman @ TU München, Germany",
            "Id": "2f33bbf5bd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christian Hadler",
            "Affiliation": "Kiel University, Germany",
            "Key": "Christian Hadler @ Kiel University, Germany",
            "Id": "bf1d67296a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Imed Hammouda",
            "Affiliation": "Chalmers, Sweden / University of Gothenburg, Sweden",
            "Key": "Imed Hammouda @ Chalmers, Sweden / University of Gothenburg, Sweden",
            "Id": "827ef53157",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mikkel Bovbjerg Hansen",
            "Affiliation": "Bankdata, Denmark",
            "Key": "Mikkel Bovbjerg Hansen @ Bankdata, Denmark",
            "Id": "ae6631463b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Hayes",
            "Affiliation": "",
            "Key": "Jane Hayes @",
            "Id": "ef0ba3342f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Virgínia Heimann",
            "Affiliation": "Federal University of Pernambuco, Brazil",
            "Key": "Virgínia Heimann @ Federal University of Pernambuco, Brazil",
            "Id": "f83e80955f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mats Heimdahl",
            "Affiliation": "",
            "Key": "Mats Heimdahl @",
            "Id": "48ca6cffa0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anne Hess",
            "Affiliation": "Fraunhofer IESE, Germany",
            "Key": "Anne Hess @ Fraunhofer IESE, Germany",
            "Id": "71aa9054aa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maryam Al Hinai",
            "Affiliation": "University of Leicester, UK",
            "Key": "Maryam Al Hinai @ University of Leicester, UK",
            "Id": "46813b23e4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Frank Hogrebe",
            "Affiliation": "Hessische Hochschule für Polizei und Verwaltung Wiesbaden, Germany",
            "Key": "Frank Hogrebe @ Hessische Hochschule für Polizei und Verwaltung Wiesbaden, Germany",
            "Id": "3c9c8c9e86",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jennifer Horkoff",
            "Affiliation": "",
            "Key": "Jennifer Horkoff @",
            "Id": "b65db1e3a9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jennifer Horkoff",
            "Affiliation": "University of Trento, Italy",
            "Key": "Jennifer Horkoff @ University of Trento, Italy",
            "Id": "cb64bce136",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Cleland Huang",
            "Affiliation": "",
            "Key": "Jane Cleland Huang @",
            "Id": "c11c08f9d1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Huffman Hayes",
            "Affiliation": "University of Kentucky, USA",
            "Key": "Jane Huffman Hayes @ University of Kentucky, USA",
            "Id": "1aed38bd93",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Silvia Ingolfo",
            "Affiliation": "University of Trento, Italy",
            "Key": "Silvia Ingolfo @ University of Trento, Italy",
            "Id": "3268113bab",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dan Ionita",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Dan Ionita @ University of Twente, Netherlands",
            "Id": "311cd84bfd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jørgen Bøndergaard Iversen",
            "Affiliation": "Mjølner Informatics, Denmark",
            "Key": "Jørgen Bøndergaard Iversen @ Mjølner Informatics, Denmark",
            "Id": "963ba28888",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Slinger Jansen",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Slinger Jansen @ Utrecht University, Netherlands",
            "Id": "38f2838d10",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sami Jantunen",
            "Affiliation": "",
            "Key": "Sami Jantunen @",
            "Id": "63900c63e8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhi Jin",
            "Affiliation": "",
            "Key": "Zhi Jin @",
            "Id": "5ec005ae6b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jens Bæk Jørgensen",
            "Affiliation": "Mjølner Informatics, Denmark",
            "Key": "Jens Bæk Jørgensen @ Mjølner Informatics, Denmark",
            "Id": "5e73e5dc1b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jan Jürjens",
            "Affiliation": "TU Dortmund, Germany",
            "Key": "Jan Jürjens @ TU Dortmund, Germany",
            "Id": "f504ec1b13",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Karlsson",
            "Affiliation": "Volvo, Sweden",
            "Key": "Daniel Karlsson @ Volvo, Sweden",
            "Id": "57f5d605a9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marjo Kauppinen",
            "Affiliation": "Aalto University, Finland",
            "Key": "Marjo Kauppinen @ Aalto University, Finland",
            "Id": "7e2561d80c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jason King",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Jason King @ North Carolina State University, USA",
            "Id": "f486a8c3bb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alessia Knauss",
            "Affiliation": "University of Victoria, Canada",
            "Key": "Alessia Knauss @ University of Victoria, Canada",
            "Id": "e91b67ea64",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eric Knauss",
            "Affiliation": "",
            "Key": "Eric Knauss @",
            "Id": "8e37754ff6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eric Knauss",
            "Affiliation": "Chalmers, Sweden / University of Gothenburg, Sweden",
            "Key": "Eric Knauss @ Chalmers, Sweden / University of Gothenburg, Sweden",
            "Id": "8c55497950",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bjarne Knudsen",
            "Affiliation": "Mjølner Informatics, Denmark",
            "Key": "Bjarne Knudsen @ Mjølner Informatics, Denmark",
            "Id": "2104c880bc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anne Koziolek",
            "Affiliation": "KIT, Germany",
            "Key": "Anne Koziolek @ KIT, Germany",
            "Id": "4529d932dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Axel van Lamsweerde",
            "Affiliation": "Université Catholique de Louvain, Belgium",
            "Key": "Axel van Lamsweerde @ Université Catholique de Louvain, Belgium",
            "Id": "b3d3dc510c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ralf Laue",
            "Affiliation": "University of Applied Sciences Zwickau, Germany",
            "Key": "Ralf Laue @ University of Applied Sciences Zwickau, Germany",
            "Id": "1426a87650",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Seok-Won Lee",
            "Affiliation": "",
            "Key": "Seok-Won Lee @",
            "Id": "dd60282d2a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jean-Michel Lehker",
            "Affiliation": "University of Texas at San Antonio, USA",
            "Key": "Jean-Michel Lehker @ University of Texas at San Antonio, USA",
            "Id": "635622ae91",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Julio Cesar Sampaio do Prado Leite",
            "Affiliation": "PUC-Rio, Brazil",
            "Key": "Julio Cesar Sampaio do Prado Leite @ PUC-Rio, Brazil",
            "Id": "e4fe326f28",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Emmanuel Letier",
            "Affiliation": "",
            "Key": "Emmanuel Letier @",
            "Id": "2b4b3c292c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Emmanuel Letier",
            "Affiliation": "University College London, UK",
            "Key": "Emmanuel Letier @ University College London, UK",
            "Id": "bc10dce48d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Oleksandr Letychevskyi",
            "Affiliation": "Glushkov Institute of Cybernetics, Ukraine",
            "Key": "Oleksandr Letychevskyi @ Glushkov Institute of Cybernetics, Ukraine",
            "Id": "0f58faa41d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Feng-Lin Li",
            "Affiliation": "University of Trento, Italy",
            "Key": "Feng-Lin Li @ University of Trento, Italy",
            "Id": "e9c44e61b3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hui Liu",
            "Affiliation": "Beijing Institute of Technology, China",
            "Key": "Hui Liu @ Beijing Institute of Technology, China",
            "Id": "5f6ea2d7ba",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lin Liu",
            "Affiliation": "Tsinghua University, China",
            "Key": "Lin Liu @ Tsinghua University, China",
            "Id": "cc79576123",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yanji Liu",
            "Affiliation": "McGill University, Canada",
            "Key": "Yanji Liu @ McGill University, Canada",
            "Id": "4671010395",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bo Liwång",
            "Affiliation": "Swedish Radiation Safety Authority, Sweden",
            "Key": "Bo Liwång @ Swedish Radiation Safety Authority, Sweden",
            "Id": "4b0300eb0c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Henrik Lönn",
            "Affiliation": "Volvo, Sweden",
            "Key": "Henrik Lönn @ Volvo, Sweden",
            "Id": "a010c5d5c4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sugandha Lohar",
            "Affiliation": "DePaul University, USA",
            "Key": "Sugandha Lohar @ DePaul University, USA",
            "Id": "c79ca50cf2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yue Lu",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Yue Lu @ Mälardalen University, Sweden",
            "Id": "bb2a7c7813",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stephanie Ludi",
            "Affiliation": "Rochester Institute of Technology, USA",
            "Key": "Stephanie Ludi @ Rochester Institute of Technology, USA",
            "Id": "b7303b4cff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kristina Lundqvist",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Kristina Lundqvist @ Mälardalen University, Sweden",
            "Id": "e5baed5a2b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Robyn Lutz",
            "Affiliation": "",
            "Key": "Robyn Lutz @",
            "Id": "d41f159b19",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Walid Maalej",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Walid Maalej @ University of Hamburg, Germany",
            "Id": "3b34bea334",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tomi Männistö",
            "Affiliation": "University of Helsinki, Finland",
            "Key": "Tomi Männistö @ University of Helsinki, Finland",
            "Id": "b8443377a4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anas Mahmoud",
            "Affiliation": "Mississippi State University, USA",
            "Key": "Anas Mahmoud @ Mississippi State University, USA",
            "Id": "e2744f11a8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Neil Maiden",
            "Affiliation": "",
            "Key": "Neil Maiden @",
            "Id": "ea1c156202",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Neil Maiden",
            "Affiliation": "City University London, UK",
            "Key": "Neil Maiden @ City University London, UK",
            "Id": "0835e19fa6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Luiz Eduardo Galvão Martins",
            "Affiliation": "Federal University of São Paulo, Brazil",
            "Key": "Luiz Eduardo Galvão Martins @ Federal University of São Paulo, Brazil",
            "Id": "7dd6cac99a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fabio Massacci",
            "Affiliation": "University of Trento, Italy",
            "Key": "Fabio Massacci @ University of Trento, Italy",
            "Id": "c7a9d21318",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aaron K. Massey",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Aaron K. Massey @ Georgia Tech, USA",
            "Id": "26d386f6b6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alistair Mavin",
            "Affiliation": "",
            "Key": "Alistair Mavin @",
            "Id": "deece1439e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nancy Mead",
            "Affiliation": "",
            "Key": "Nancy Mead @",
            "Id": "c301f1ce74",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Claudio Menghi",
            "Affiliation": "Politecnico di Milano, Italy",
            "Key": "Claudio Menghi @ Politecnico di Milano, Italy",
            "Id": "7a096ee459",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mehdi Mirakhorli",
            "Affiliation": "DePaul University, USA",
            "Key": "Mehdi Mirakhorli @ DePaul University, USA",
            "Id": "ae04c12ce2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dongyue Mou",
            "Affiliation": "fortiss, Germany",
            "Key": "Dongyue Mou @ fortiss, Germany",
            "Id": "3af36488a0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gunter Mussbacher",
            "Affiliation": "McGill University, Canada",
            "Key": "Gunter Mussbacher @ McGill University, Canada",
            "Id": "d9f43fb1ba",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "John Mylopoulos",
            "Affiliation": "",
            "Key": "John Mylopoulos @",
            "Id": "3951e8017c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "John Mylopoulos",
            "Affiliation": "University of Trento, Italy",
            "Key": "John Mylopoulos @ University of Trento, Italy",
            "Id": "46a66c3c54",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tuong Huan Nguyen",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Tuong Huan Nguyen @ Swinburne University of Technology, Australia",
            "Id": "3867d87325",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jianwei Niu",
            "Affiliation": "University of Texas at San Antonio, USA",
            "Key": "Jianwei Niu @ University of Texas at San Antonio, USA",
            "Id": "de60e07d3c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nan Niu",
            "Affiliation": "University of Cincinnati, USA",
            "Key": "Nan Niu @ University of Cincinnati, USA",
            "Id": "ade836e689",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhendong Niu",
            "Affiliation": "Beijing Institute of Technology, China",
            "Key": "Zhendong Niu @ Beijing Institute of Technology, China",
            "Id": "8eae1b0584",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Markus Nüttgens",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Markus Nüttgens @ University of Hamburg, Germany",
            "Id": "86ff1a33e9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Wesley Nunes",
            "Affiliation": "State University of Rio de Janeiro, Brazil",
            "Key": "Wesley Nunes @ State University of Rio de Janeiro, Brazil",
            "Id": "730e9de2ea",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bashar Nuseibeh",
            "Affiliation": "",
            "Key": "Bashar Nuseibeh @",
            "Id": "cd83cc0b2d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bashar Nuseibeh",
            "Affiliation": "Open University, UK / Lero, Ireland",
            "Key": "Bashar Nuseibeh @ Open University, UK / Lero, Ireland",
            "Id": "9f80335fa8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mattias Nyberg",
            "Affiliation": "Scania, Sweden",
            "Key": "Mattias Nyberg @ Scania, Sweden",
            "Id": "54a8733119",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alejandro Oliveros",
            "Affiliation": "Universidad Argentina de la Empresa, Argentina",
            "Key": "Alejandro Oliveros @ Universidad Argentina de la Empresa, Argentina",
            "Id": "7cbfc8cd7f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Greg Ott",
            "Affiliation": "DePaul University, USA",
            "Key": "Greg Ott @ DePaul University, USA",
            "Id": "7a7b315a91",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maria Pampaka",
            "Affiliation": "University of Manchester, UK",
            "Key": "Maria Pampaka @ University of Manchester, UK",
            "Id": "a2709690ef",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Panis",
            "Affiliation": "",
            "Key": "Michael Panis @",
            "Id": "16f6e04863",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Liliana Pasquale",
            "Affiliation": "Lero, Ireland",
            "Key": "Liliana Pasquale @ Lero, Ireland",
            "Id": "90e64fd963",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xin Peng",
            "Affiliation": "Fudan University, China",
            "Key": "Xin Peng @ Fudan University, China",
            "Id": "822e10ae4a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maria Pinto-Albuquerque",
            "Affiliation": "Lisbon University Institute, Portugal / Lancaster University, UK",
            "Key": "Maria Pinto-Albuquerque @ Lisbon University Institute, Portugal / Lancaster University, UK",
            "Id": "bef32aed03",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chris Porter",
            "Affiliation": "University College London, UK",
            "Key": "Chris Porter @ University College London, UK",
            "Id": "eb299808b6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Piotr Pruski",
            "Affiliation": "DePaul University, USA",
            "Key": "Piotr Pruski @ DePaul University, USA",
            "Id": "90ead3a34a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cynthia Putnam",
            "Affiliation": "DePaul University, USA",
            "Key": "Cynthia Putnam @ DePaul University, USA",
            "Id": "425a60878c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Wenyi Qian",
            "Affiliation": "Fudan University, China",
            "Key": "Wenyi Qian @ Fudan University, China",
            "Id": "0b8702128b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mona Rahimi",
            "Affiliation": "DePaul University, USA",
            "Key": "Mona Rahimi @ DePaul University, USA",
            "Id": "4816272e60",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Rapp",
            "Affiliation": "Zühlke Management Consultants, Switzerland",
            "Key": "Daniel Rapp @ Zühlke Management Consultants, Switzerland",
            "Id": "c8d6cb44b6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Awais Rashid",
            "Affiliation": "Lancaster University, UK",
            "Key": "Awais Rashid @ Lancaster University, UK",
            "Id": "8279bc6000",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alexander Rasin",
            "Affiliation": "DePaul University, USA",
            "Key": "Alexander Rasin @ DePaul University, USA",
            "Id": "4f2df5c7f0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Ratiu",
            "Affiliation": "fortiss, Germany",
            "Key": "Daniel Ratiu @ fortiss, Germany",
            "Id": "1f01b5d5aa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paul Rayson",
            "Affiliation": "Lancaster University, UK",
            "Key": "Paul Rayson @ Lancaster University, UK",
            "Id": "72803c452a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maria Riaz",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Maria Riaz @ North Carolina State University, USA",
            "Id": "3eeff4ed41",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "André Rifaut",
            "Affiliation": "CRP Henri Tudor, Luxembourg",
            "Key": "André Rifaut @ CRP Henri Tudor, Luxembourg",
            "Id": "24986dc653",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Guillermo Rodriguez-Navas",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Guillermo Rodriguez-Navas @ Mälardalen University, Sweden",
            "Id": "136d2a333f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gustavo Rossi",
            "Affiliation": "Universidad Nacional de La Plata, Argentina",
            "Key": "Gustavo Rossi @ Universidad Nacional de La Plata, Argentina",
            "Id": "27f93ddf37",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Amanda Rubython",
            "Affiliation": "City&Guilds Kineo, UK",
            "Key": "Amanda Rubython @ City&Guilds Kineo, UK",
            "Id": "756143c7a7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Thomas Ruhroth",
            "Affiliation": "TU Dortmund, Germany",
            "Key": "Thomas Ruhroth @ TU Dortmund, Germany",
            "Id": "ea68dde780",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Richard L. Rutledge",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Richard L. Rutledge @ Georgia Tech, USA",
            "Id": "2415b2826e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mehrdad Sabetzadeh",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Mehrdad Sabetzadeh @ University of Luxembourg, Luxembourg",
            "Id": "80f00f8653",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shinobu Saito",
            "Affiliation": "NTT DATA, Japan",
            "Key": "Shinobu Saito @ NTT DATA, Japan",
            "Id": "c4a04becb2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rick Salay",
            "Affiliation": "University of Toronto, Canada",
            "Key": "Rick Salay @ University of Toronto, Canada",
            "Id": "afe85e21eb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "M. Angela Sasse",
            "Affiliation": "University College London, UK",
            "Key": "M. Angela Sasse @ University College London, UK",
            "Id": "079bc50b6f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Juha Savolainen",
            "Affiliation": "Danfoss, Denmark",
            "Key": "Juha Savolainen @ Danfoss, Denmark",
            "Id": "62dcd79180",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pete Sawyer",
            "Affiliation": "Lancaster University, UK",
            "Key": "Pete Sawyer @ Lancaster University, UK",
            "Id": "f540917603",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sanjaya Kumar Saxena",
            "Affiliation": "GrayPE Systems, India",
            "Key": "Sanjaya Kumar Saxena @ GrayPE Systems, India",
            "Id": "574866ef59",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Florian Schaub",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Florian Schaub @ Carnegie Mellon University, USA",
            "Id": "d2f4f561a6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kurt Schneider",
            "Affiliation": "Leibniz Universität Hannover, Germany",
            "Key": "Kurt Schneider @ Leibniz Universität Hannover, Germany",
            "Id": "50ac80fc9c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marcelo Schots",
            "Affiliation": "Federal University of Rio de Janeiro, Brazil",
            "Key": "Marcelo Schots @ Federal University of Rio de Janeiro, Brazil",
            "Id": "7a29715213",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Norbert Seyff",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Norbert Seyff @ University of Zurich, Switzerland",
            "Id": "d60bda0efc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alberto Siena",
            "Affiliation": "University of Trento, Italy",
            "Key": "Alberto Siena @ University of Trento, Italy",
            "Id": "b8f01027b4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Munindar P. Singh",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Munindar P. Singh @ North Carolina State University, USA",
            "Id": "2f9a5259e3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "John Slankas",
            "Affiliation": "North Carolina State University, USA",
            "Key": "John Slankas @ North Carolina State University, USA",
            "Id": "21333eac12",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rocky Slavin",
            "Affiliation": "University of Texas at San Antonio, USA",
            "Key": "Rocky Slavin @ University of Texas at San Antonio, USA",
            "Id": "6dced4e380",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andreas Speck",
            "Affiliation": "Kiel University, Germany",
            "Key": "Andreas Speck @ Kiel University, Germany",
            "Id": "000dc6f7e9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Peter Spörri",
            "Affiliation": "Zühlke Management Consultants, Switzerland",
            "Key": "Peter Spörri @ Zühlke Management Consultants, Switzerland",
            "Id": "3ea216d3c5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tor Stålhane",
            "Affiliation": "Norwegian University of Science and Technology, Norway",
            "Key": "Tor Stålhane @ Norwegian University of Science and Technology, Norway",
            "Id": "b32ceb9c8e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yukun Su",
            "Affiliation": "McGill University, Canada",
            "Key": "Yukun Su @ McGill University, Canada",
            "Id": "1150c2171b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alistair Sutcliffe",
            "Affiliation": "",
            "Key": "Alistair Sutcliffe @",
            "Id": "ef4ab3d07d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alistair Sutcliffe",
            "Affiliation": "Lancaster University, UK",
            "Key": "Alistair Sutcliffe @ Lancaster University, UK",
            "Id": "ae6e92ccff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alistair Sutcliffe",
            "Affiliation": "University of Manchester, UK",
            "Key": "Alistair Sutcliffe @ University of Manchester, UK",
            "Id": "f84b057577",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Richard Berntsson Svensson",
            "Affiliation": "",
            "Key": "Richard Berntsson Svensson @",
            "Id": "de7fea655b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Peter P. Swire",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Peter P. Swire @ Georgia Tech, USA",
            "Id": "19c0f845df",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mutsuki Takeuchi",
            "Affiliation": "NTT DATA, Japan",
            "Key": "Mutsuki Takeuchi @ NTT DATA, Japan",
            "Id": "40228fe656",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Miguel A. Teruel",
            "Affiliation": "University of Castile–La Mancha, Spain",
            "Key": "Miguel A. Teruel @ University of Castile–La Mancha, Spain",
            "Id": "c6f83f620b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Throop",
            "Affiliation": "Boeing, USA",
            "Key": "David Throop @ Boeing, USA",
            "Id": "bf58db95e8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Harri Töhönen",
            "Affiliation": "Aalto University, Finland",
            "Key": "Harri Töhönen @ Aalto University, Finland",
            "Id": "fa7874d023",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Le Minh Sang Tran",
            "Affiliation": "University of Trento, Italy",
            "Key": "Le Minh Sang Tran @ University of Trento, Italy",
            "Id": "46b53cdbd4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christos Tsigkanos",
            "Affiliation": "Politecnico di Milano, Italy",
            "Key": "Christos Tsigkanos @ Politecnico di Milano, Italy",
            "Id": "5c36e11e68",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eero Uusitalo",
            "Affiliation": "",
            "Key": "Eero Uusitalo @",
            "Id": "ea73453bdb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "George Valença",
            "Affiliation": "Federal Rural University of Pernambuco, Brazil",
            "Key": "George Valença @ Federal Rural University of Pernambuco, Brazil",
            "Id": "259635bcb3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Huanhuan Wang",
            "Affiliation": "Fudan University, China",
            "Key": "Huanhuan Wang @ Fudan University, China",
            "Id": "74335f33d7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anthony I. Wasserman",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Anthony I. Wasserman @ Carnegie Mellon University, USA",
            "Id": "26444e8541",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Thomas Weigert",
            "Affiliation": "Uniquesoft LLC, USA",
            "Key": "Thomas Weigert @ Uniquesoft LLC, USA",
            "Id": "96ec294b74",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tormod Wien",
            "Affiliation": "ABB Research, Norway",
            "Key": "Tormod Wien @ ABB Research, Norway",
            "Id": "a4f5fc26f5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Laurie Williams",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Laurie Williams @ North Carolina State University, USA",
            "Id": "ffaa5e5776",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sören Witt",
            "Affiliation": "Kiel University, Germany",
            "Key": "Sören Witt @ Kiel University, Germany",
            "Id": "4f7862bae3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Claes Wohlin",
            "Affiliation": "",
            "Key": "Claes Wohlin @",
            "Id": "c58b6ce492",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rebekka Wohlrab",
            "Affiliation": "ABB Research, Sweden",
            "Key": "Rebekka Wohlrab @ ABB Research, Sweden",
            "Id": "867a363ac5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Setsuo Yamada",
            "Affiliation": "NTT, Japan",
            "Key": "Setsuo Yamada @ NTT, Japan",
            "Id": "b57e97c6e2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xinshang Yin",
            "Affiliation": "McGill University, Canada",
            "Key": "Xinshang Yin @ McGill University, Canada",
            "Id": "3822500a7a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Wenyun Zhao",
            "Affiliation": "Fudan University, China",
            "Key": "Wenyun Zhao @ Fudan University, China",
            "Id": "648b81dcad",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jiale Zhou",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Jiale Zhou @ Mälardalen University, Sweden",
            "Id": "ce769ec015",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xiuna Zhu",
            "Affiliation": "TU München, Germany",
            "Key": "Xiuna Zhu @ TU München, Germany",
            "Id": "afc4a0af9e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Didar Zowghi",
            "Affiliation": "",
            "Key": "Didar Zowghi @",
            "Id": "7a45d63b06",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Didar Zowghi",
            "Affiliation": "University of Technology Sydney, Australia",
            "Key": "Didar Zowghi @ University of Technology Sydney, Australia",
            "Id": "e818c5e605",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        }
    ]
}
 

