{
    "DataRevision": 1404973350,
    "Preliminary": false,
    "Event": "ISSTA 2014",
    "Name": "ISSTA 2014",
    "Description": "",
    "Location": "San Jose, CA, USA",
    "Sponsors": "",
    "URL": "http://issta2014.org/",
    "MultiTrack": "false",
    "Organization": {
        "General Chairs": [
                "Corina S. Păsăreanu"
        ],
        "PC Chairs": [
                "Darko Marinov"
        ]
    },
    "SocialFeeds": [
    ],
    "VenueInfo": {
        "Name": "",
        "GPS": {
            "Latitude": 0,
            "Longitude": 0
        }
    },
    "InfoPage": {
        "xaml": "foo",
        "Elements": [
            {
                "XamlName": "ConferenceCenterMap",
                "Type": "Map",
                "GPS": {
                    "Latitude": 0,
                    "Longitude": 0
                },
                "MapLabel": ""
            },
            {
                "XamlName": "LicenseButton",
                "Type": "WebLink",
                "URL": "http://research.microsoft.com/en-US/projects/confapp/terms.aspx"
            },
            {
                "XamlName": "PrivacyButton",
                "Type": "WebLink",
                "URL": "http://privacy.microsoft.com/en-us/default.msp"
            }
        ]
    },
    "SessionPriorities": [
        "Award",
        "Invited Talk",
        "Other"
    ],
    "Items": [
        {
            "Title": "Runtime Prevention of Concurrency Related Type-State Violations in Multithreaded Applications",
            "Type": "Full Paper",
            "Key": "issta14main-mainid95-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLu+Zhang+and+Chao+Wang+%22Runtime+Prevention+of+Concurrency+Related+Type-State+Violations+in+Multithreaded+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610405",
            "PersonsString": "Lu Zhang and Chao Wang",
            "AffiliationsString": "Virginia Tech, USA",
            "Authors": [
                "Lu Zhang @ Virginia Tech, USA",
                "Chao Wang @ Virginia Tech, USA"
            ],
            "Affiliations": [
                "Virginia Tech, USA",
                "Virginia Tech, USA"
            ],
            "Abstract": "We propose a new method for runtime prevention of type state violations in multithreaded applications due to erroneous thread interleavings. The new method employs a combination of static and dynamic program analysis techniques to control the execution order of the method calls to suppress illegal call sequences. The legal behavior of a shared object is specified by a type-state automaton, which serves as the guidance for our method to delay certain method calls at run time. Our main contribution is a new theoretical framework for ensuring that the runtime prevention strategy is always safe, i.e., they do not introduce new erroneous interleavings. Furthermore, whenever the static program analysis is precise enough, our method guarantees to steer the program to a failurefree interleaving as long as such interleaving exists. We have implemented the new method in a tool based on the LLVM compiler framework. Our experiments on a set of multithreaded C/C++ applications show that the method is both efficient and effective in suppressing concurrency related type-state violations.",
            "Award": ""
        },
        {
            "Title": "Performance Regression Testing of Concurrent Classes",
            "Type": "Full Paper",
            "Key": "issta14main-mainid80-p",
            "URL": "http%3A%2F%2Fmp.binaervarianz.de%2Fissta2014.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fmp.binaervarianz.de%2FSpeedGun%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610393",
            "PersonsString": "Michael Pradel, Markus Huggler, and Thomas R. Gross",
            "AffiliationsString": "University of California at Berkeley, USA; ETH Zurich, Switzerland",
            "Authors": [
                "Michael Pradel @ University of California at Berkeley, USA",
                "Markus Huggler @ ETH Zurich, Switzerland",
                "Thomas R. Gross @ ETH Zurich, Switzerland"
            ],
            "Affiliations": [
                "University of California at Berkeley, USA",
                "ETH Zurich, Switzerland",
                "ETH Zurich, Switzerland"
            ],
            "Abstract": "Developers of thread-safe classes struggle with two opposing goals. The class must be correct, which requires synchronizing concurrent accesses, and the class should provide reasonable performance, which is difficult to realize in the presence of unnecessary synchronization. Validating the performance of a thread-safe class is challenging because it requires diverse workloads that use the class, because existing performance analysis techniques focus on individual bottleneck methods, and because reliably measuring the performance of concurrent executions is difficult. This paper presents SpeedGun, an automatic performance regression testing technique for thread-safe classes. The key idea is to generate multi-threaded performance tests and to compare two versions of a class with each other. The analysis notifies developers when changing a thread-safe class significantly influences the performance of clients of this class. An evaluation with 113 pairs of classes from popular Java projects shows that the analysis effectively identifies 13 performance differences, including performance regressions that the respective developers were not aware of.",
            "Award": ""
        },
        {
            "Title": "Verifying Atomicity via Data Independence",
            "Type": "Full Paper",
            "Key": "issta14main-mainid48-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DOhad+Shacham%2C+Eran+Yahav%2C+Guy+Golan+Gueta%2C+Alex+Aiken%2C+Nathan+Bronson%2C+Mooly+Sagiv%2C+and+Martin+Vechev+%22Verifying+Atomicity+via+Data+Independence%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610402",
            "PersonsString": "Ohad Shacham, Eran Yahav, Guy Golan Gueta, Alex Aiken, Nathan Bronson, Mooly Sagiv, and Martin Vechev",
            "AffiliationsString": "Yahoo Labs, Israel; Technion, Israel; Stanford University, USA; Tel Aviv University, Israel; ETH Zurich, Switzerland",
            "Authors": [
                "Ohad Shacham @ Yahoo Labs, Israel",
                "Eran Yahav @ Technion, Israel",
                "Guy Golan Gueta @ Yahoo Labs, Israel",
                "Alex Aiken @ Stanford University, USA",
                "Nathan Bronson @ Stanford University, USA",
                "Mooly Sagiv @ Tel Aviv University, Israel",
                "Martin Vechev @ ETH Zurich, Switzerland"
            ],
            "Affiliations": [
                "Yahoo Labs, Israel",
                "Technion, Israel",
                "Yahoo Labs, Israel",
                "Stanford University, USA",
                "Stanford University, USA",
                "Tel Aviv University, Israel",
                "ETH Zurich, Switzerland"
            ],
            "Abstract": "We present a technique for automatically verifying atomicity of composed concurrent operations. The main observation behind our approach is that many composed concurrent operations which occur in practice are data-independent. That is, the control-flow of the composed operation does not depend on specific input values. While verifying data-independence is undecidable in the general case, we provide succint sufficient conditions that can be used to establish a composed operation as data-independent. We show that for the common case of concurrent maps, data-independence reduces the hard problem of verifying linearizability to a verification problem that can be solved efficiently with a bounded number of keys and values. We implemented our approach in a tool called VINE and evaluated it on all composed operations from 57 real-world applications (112 composed operations). We show that many composed operations (49 out of 112) are data-independent, and automatically verify 30 of them as linearizable and the rest 19 as having violations of linearizability that could be repaired and then subsequently automatically verified. Moreover, we show that the remaining 63 operations are not linearizable, thus indicating that data independence does not limit the expressiveness of writing realistic linearizable composed operations.",
            "Award": ""
        },
        {
            "Title": "Verification-Aided Regression Testing",
            "Type": "Full Paper",
            "Key": "issta14main-mainid55-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DFabrizio+Pastore%2C+Leonardo+Mariani%2C+Antti+E.+J.+Hyv%C3%A4rinen%2C+Grigory+Fedyukovich%2C+Natasha+Sharygina%2C+Stephan+Sehestedt%2C+and+Ali+Muhammad+%22Verification-Aided+Regression+Testing%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610387",
            "PersonsString": "Fabrizio Pastore, Leonardo Mariani, Antti E. J. Hyvärinen, Grigory Fedyukovich, Natasha Sharygina, Stephan Sehestedt, and Ali Muhammad",
            "AffiliationsString": "University of Milano-Bicocca, Italy; University of Lugano, Switzerland; ABB Research, Germany; VTT Technical Research, Finland",
            "Authors": [
                "Fabrizio Pastore @ University of Milano-Bicocca, Italy",
                "Leonardo Mariani @ University of Milano-Bicocca, Italy",
                "Antti E. J. Hyvärinen @ University of Lugano, Switzerland",
                "Grigory Fedyukovich @ University of Lugano, Switzerland",
                "Natasha Sharygina @ University of Lugano, Switzerland",
                "Stephan Sehestedt @ ABB Research, Germany",
                "Ali Muhammad @ VTT Technical Research, Finland"
            ],
            "Affiliations": [
                "University of Milano-Bicocca, Italy",
                "University of Milano-Bicocca, Italy",
                "University of Lugano, Switzerland",
                "University of Lugano, Switzerland",
                "University of Lugano, Switzerland",
                "ABB Research, Germany",
                "VTT Technical Research, Finland"
            ],
            "Abstract": "In this paper we present Verification-Aided Regression Testing (VART), a novel extension of regression testing that uses model checking to increase the fault revealing capability of existing test suites. The key idea in VART is to extend the use of test case executions from the conventional direct fault discovery to the generation of behavioral properties specific to the upgrade, by (i) automatically producing properties that are proved to hold for the base version of a program, (ii) automatically identifying and checking on the upgraded program only the properties that, according to the developers’ intention, must be preserved by the upgrade, and (iii) reporting the faults and the corresponding counter-examples that are not revealed by the regression tests. Our empirical study on both open source and industrial software systems shows that VART automatically produces properties that increase the effectiveness of testing by automatically detecting faults unnoticed by the existing regression test suites.",
            "Award": ""
        },
        {
            "Title": "Hybrid Security Analysis of Web JavaScript Code via Dynamic Partial Evaluation",
            "Type": "Full Paper",
            "Key": "issta14main-mainid31-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DOmer+Tripp%2C+Pietro+Ferrara%2C+and+Marco+Pistoia+%22Hybrid+Security+Analysis+of+Web+JavaScript+Code+via+Dynamic+Partial+Evaluation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610385",
            "PersonsString": "Omer Tripp, Pietro Ferrara, and Marco Pistoia",
            "AffiliationsString": "IBM Research, USA",
            "Authors": [
                "Omer Tripp @ IBM Research, USA",
                "Pietro Ferrara @ IBM Research, USA",
                "Marco Pistoia @ IBM Research, USA"
            ],
            "Affiliations": [
                "IBM Research, USA",
                "IBM Research, USA",
                "IBM Research, USA"
            ],
            "Abstract": "This paper addresses the problem of detecting JavaScript security vulnerabilities in the client side of Web applications. Such vulnerabilities are becoming a source of growing concern due to the rapid migration of server-side business logic to the client side, combined with new JavaScript-backed Web technologies, such as AJAX and HTML5. Detection of client-side vulnerabilities is challenging given the dynamic and event-driven nature of JavaScript. We present a hybrid form of JavaScript analysis, which augments static analysis with (semi-)concrete information by applying partial evaluation to JavaScript functions according to dynamic data recorded by the Web crawler. The dynamic component rewrites the program per the enclosing HTML environment, and the static component then explores all possible behaviors of the partially evaluated program (while treating user-controlled aspects of the environment conservatively).  We have implemented this hybrid architecture as the JSA analysis tool, which is integrated into the IBM AppScan Standard Edition product. We formalize the static analysis and prove useful properties over it. We also tested the system across a set of 170,000 Web pages, comparing it with purely static and dynamic alternatives. The results provide conclusive evidence in favor of our hybrid approach. Only 10% of the reports by JSA are false alarms compared to 63% of the alarms flagged by its purely static counterpart, while not a single true warning is lost. This represents a reduction of 94% in false alarms. Compared with a commercial testing algorithm, JSA detects vulnerabilities in &gt;4x more Web sites with only 4 false alarms.",
            "Award": ""
        },
        {
            "Title": "Virtual DOM Coverage for Effective Testing of Dynamic Web Applications",
            "Type": "Full Paper",
            "Key": "issta14main-mainid109-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DYunxiao+Zou%2C+Zhenyu+Chen%2C+Yunhui+Zheng%2C+Xiangyu+Zhang%2C+and+Zebao+Gao+%22Virtual+DOM+Coverage+for+Effective+Testing+of+Dynamic+Web+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610399",
            "PersonsString": "Yunxiao Zou, Zhenyu Chen, Yunhui Zheng, Xiangyu Zhang, and Zebao Gao",
            "AffiliationsString": "Nanjing University, China; Purdue University, USA; University of Maryland at College Park, USA",
            "Authors": [
                "Yunxiao Zou @ Nanjing University, China / Purdue University, USA",
                "Zhenyu Chen @ Nanjing University, China",
                "Yunhui Zheng @ Purdue University, USA",
                "Xiangyu Zhang @ Purdue University, USA",
                "Zebao Gao @ Nanjing University, China / University of Maryland at College Park, USA"
            ],
            "Affiliations": [
                "Nanjing University, China / Purdue University, USA",
                "Nanjing University, China",
                "Purdue University, USA",
                "Purdue University, USA",
                "Nanjing University, China / University of Maryland at College Park, USA"
            ],
            "Abstract": "Test adequacy criteria are fundamental in software testing. Among them, code coverage criterion is widely used due to its simplicity and effectiveness. However, in dynamic web application testing, merely covering server-side script code is inadequate because it neglects client-side execution, which plays an important role in triggering client-server interactions to reach important execution states. Similarly, a criterion aiming at covering the UI elements on client-side pages ignores the server-side execution, leading to insufficiency.  In this paper, we propose Virtual DOM (V-DOM) Coverage, a novel criterion, for effective web application testing. With static analysis, we first aggregate all the DOM objects that may be produced by a piece of server script to construct a V-DOM tree. The tree models execution on both the client- and server-sides such that V-DOM coverage is more effective than existing coverage criteria in web application testing. We conduct an empirical study on five real world dynamic web applications. We find that V-DOM tree can model much more DOM objects than a web crawling based technique. Test selection based on V-DOM tree criterion substantially outperforms the existing code coverage and UI element coverage, by detecting more faults.",
            "Award": ""
        },
        {
            "Title": "DOM-Based Test Adequacy Criteria for Web Applications",
            "Type": "Full Paper",
            "Key": "issta14main-mainid96-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMehdi+Mirzaaghaei+and+Ali+Mesbah+%22DOM-Based+Test+Adequacy+Criteria+for+Web+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610406",
            "PersonsString": "Mehdi Mirzaaghaei and Ali Mesbah",
            "AffiliationsString": "University of British Columbia, Canada",
            "Authors": [
                "Mehdi Mirzaaghaei @ University of British Columbia, Canada",
                "Ali Mesbah @ University of British Columbia, Canada"
            ],
            "Affiliations": [
                "University of British Columbia, Canada",
                "University of British Columbia, Canada"
            ],
            "Abstract": "To assess the quality of web application test cases, web developers currently measure code coverage. Although code coverage has traditionally been a popular test adequacy criterion, we believe it alone is not adequate for assessing the quality of web application test cases. We propose a set of novel DOM-based test adequacy criteria for web applications. These criteria aim at measuring coverage at two granularity levels, (1) the percentage of DOM states and transitions covered in the total state space of the web application under test, and (2) the percentage of elements covered in each particular DOM state. We present a technique and tool, called DomCovery, which automatically extracts and measures the proposed adequacy criteria and generates a visual DOM coverage report. Our evaluation shows that there is no correlation between code coverage and DOM coverage. A controlled experiment illustrates that participants using DomCovery completed coverage related tasks 22% more accurately and 66% faster.",
            "Award": ""
        },
        {
            "Title": "Cross-Platform Feature Matching for Web Applications",
            "Type": "Full Paper",
            "Key": "issta14main-mainid129-p",
            "URL": "http%3A%2F%2Fshauvik.com%2Fpublic%2Fpubs%2Froychoudhary14issta.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fgatech.github.io%2Ffmap",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610409",
            "PersonsString": "Shauvik Roy Choudhary, Mukul R. Prasad, and Alessandro Orso",
            "AffiliationsString": "Georgia Tech, USA; Fujitsu Labs, USA",
            "Authors": [
                "Shauvik Roy Choudhary @ Georgia Tech, USA",
                "Mukul R. Prasad @ Fujitsu Labs, USA",
                "Alessandro Orso @ Georgia Tech, USA"
            ],
            "Affiliations": [
                "Georgia Tech, USA",
                "Fujitsu Labs, USA",
                "Georgia Tech, USA"
            ],
            "Abstract": "With the emergence of new computing platforms, software written for traditional platforms is being re-targeted to reach the users on these new platforms. In particular, due to the proliferation of mobile computing devices, it is common practice for companies to build mobile-specific versions of their existing web applications to provide mobile users with a better experience. Because the differences between desktop and mobile versions of a web application are not only cosmetic, but can also include substantial rewrites of key components, it is not uncommon for these different versions to provide different sets of features. Whereas some of these differences are intentional, such as the addition of location-based features on mobile devices, others are not and can negatively affect the user experience, as confirmed by numerous user reports and complaints. Unfortunately, checking and maintaining the consistency of different versions of an application by hand is not only time consuming, but also error prone. To address this problem, and help developers in this difficult task, we propose an automated technique for matching features across different versions of a multi-platform web application. We implemented our technique in a tool, called FMAP, and used it to perform a preliminary empirical evaluation on nine real-world multi-platform web applications. The results of our evaluation are promising, as FMAP was able to correctly identify missing features between desktop and mobile versions of the web applications considered, as confirmed by our analysis of user reports and software fixes for these applications.",
            "Award": ""
        },
        {
            "Title": "Covrig: A Framework for the Analysis of Code, Test, and Coverage Evolution in Real Software",
            "Type": "Full Paper",
            "Key": "issta14main-mainid79-p",
            "URL": "http%3A%2F%2Fsrg.doc.ic.ac.uk%2Ffiles%2Fpapers%2Fcovrig-issta-14.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fsrg.doc.ic.ac.uk%2Fprojects%2Fcovrig%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610419",
            "PersonsString": "Paul Marinescu, Petr Hosek, and Cristian Cadar",
            "AffiliationsString": "Imperial College London, UK",
            "Authors": [
                "Paul Marinescu @ Imperial College London, UK",
                "Petr Hosek @ Imperial College London, UK",
                "Cristian Cadar @ Imperial College London, UK"
            ],
            "Affiliations": [
                "Imperial College London, UK",
                "Imperial College London, UK",
                "Imperial College London, UK"
            ],
            "Abstract": "Software repositories provide rich information about the construction and evolution of software systems. While static data that can be mined directly from version control systems has been extensively studied, dynamic metrics concerning the execution of the software have received much less attention, due to the inherent difficulty of running and monitoring a large number of software versions. In this paper, we present Covrig, a flexible infrastructure that can be used to run each version of a system in isolation and collect static and dynamic software metrics, using a lightweight virtual machine environment that can be deployed on a cluster of local or cloud machines. We use Covrig to conduct an empirical study examining how code and tests co-evolve in six popular open-source systems. We report the main characteristics of software patches, analyse the evolution of program and patch coverage, assess the impact of nondeterminism on the execution of test suites, and investigate whether the coverage of code containing bugs and bug fixes is higher than average.",
            "Award": ""
        },
        {
            "Title": "CoREBench: Studying Complexity of Regression Errors",
            "Type": "Full Paper",
            "Key": "issta14main-mainid38-p",
            "URL": "http%3A%2F%2Fwww.comp.nus.edu.sg%2F%7Emboehme%2Fpaper%2FISSTA14.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.comp.nus.edu.sg%2F%7Erelease%2Fcorebench",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2628058",
            "PersonsString": "Marcel Böhme and Abhik Roychoudhury",
            "AffiliationsString": "Saarland University, Germany; National University of Singapore, Singapore",
            "Authors": [
                "Marcel Böhme @ Saarland University, Germany",
                "Abhik Roychoudhury @ National University of Singapore, Singapore"
            ],
            "Affiliations": [
                "Saarland University, Germany",
                "National University of Singapore, Singapore"
            ],
            "Abstract": "Intuitively we know, some software errors are more complex than others. If the error can be fixed by changing one faulty statement, it is a simple error. The more substantial the fix must be, the more complex we consider the error.  In this work, we formally define and quantify the complexity of an error w.r.t. the complexity of the error&#039;s least complex, correct fix. As a concrete measure of complexity for such fixes, we introduce Cyclomatic Change Complexity which is inspired by existing program complexity metrics.  Moreover, we introduce CoREBench, a collection of 70 regression errors systematically extracted from several open-source C-projects and compare their complexity with that of the seeded errors in the two most popular error benchmarks, SIR and the Siemens Suite. We find that seeded errors are significantly less complex, i.e., require significantly less substantial fixes, compared to actual regression errors. For example, among the seeded errors more than 42% are simple compared to 8% among the actual ones. This is a concern for the external validity of studies based on seeded errors and we propose CoREBench for the controlled study of regression testing, debugging, and repair techniques.",
            "Award": ""
        },
        {
            "Title": "ARC++: Effective Typestate and Lifetime Dependency Analysis",
            "Type": "Full Paper",
            "Key": "issta14main-mainid10-p",
            "URL": "https%3A%2F%2Fdl.dropboxusercontent.com%2Fu%2F10145042%2Fcpluspluspattern.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610395",
            "PersonsString": "Xusheng Xiao, Gogul Balakrishnan, Franjo Ivančić, Naoto Maeda, Aarti Gupta, and Deepak Chhetri",
            "AffiliationsString": "NEC Labs, USA; North Carolina State University, USA; Google, USA; NEC, Japan; NEC, India",
            "Authors": [
                "Xusheng Xiao @ NEC Labs, USA / North Carolina State University, USA",
                "Gogul Balakrishnan @ NEC Labs, USA",
                "Franjo Ivančić @ Google, USA",
                "Naoto Maeda @ NEC, Japan",
                "Aarti Gupta @ NEC Labs, USA",
                "Deepak Chhetri @ NEC, India"
            ],
            "Affiliations": [
                "NEC Labs, USA / North Carolina State University, USA",
                "NEC Labs, USA",
                "Google, USA",
                "NEC, Japan",
                "NEC Labs, USA",
                "NEC, India"
            ],
            "Abstract": "The ever-increasing reliance of today&#039;s society on software requires scalable and precise techniques for checking the correctness, reliability, and robustness of software. Object-oriented languages have been used extensively to build large-scale systems, including Java and C++. While many scalable static analysis approaches for C and Java have been proposed, there has been comparatively little work on the static analysis of C++ programs. In this paper, we provide an abstract representation to model C++ objects, containers, references, raw pointers, and smart pointers. Further, we present a new analysis called lifetime dependency analysis, which allows us to precisely track the complex lifetime semantics of temporary objects in C++. Finally, we propose an implementation of our techniques and present promising %experimental results on a large variety of open-source software.",
            "Award": ""
        },
        {
            "Title": "A Type System for Format Strings",
            "Type": "Full Paper",
            "Key": "issta14main-mainid108-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DKonstantin+Weitz%2C+Gene+Kim%2C+Siwakorn+Srisakaokul%2C+and+Michael+D.+Ernst+%22A+Type+System+for+Format+Strings%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610417",
            "PersonsString": "Konstantin Weitz, Gene Kim, Siwakorn Srisakaokul, and Michael D. Ernst",
            "AffiliationsString": "University of Washington, USA",
            "Authors": [
                "Konstantin Weitz @ University of Washington, USA",
                "Gene Kim @ University of Washington, USA",
                "Siwakorn Srisakaokul @ University of Washington, USA",
                "Michael D. Ernst @ University of Washington, USA"
            ],
            "Affiliations": [
                "University of Washington, USA",
                "University of Washington, USA",
                "University of Washington, USA",
                "University of Washington, USA"
            ],
            "Abstract": "Most programming languages support format strings, but their use is error-prone. Using the wrong format string syntax, or passing the wrong number or type of arguments, leads to unintelligible text output, program crashes, or security vulnerabilities.  This paper presents a type system that guarantees that calls to format string APIs will never fail. In Java, this means that the API will not throw exceptions. In C, this means that the API will not return negative values, corrupt memory, etc.  We instantiated this type system for Java’s Formatter API, and evaluated it on 6 large and well-maintained open-source projects. Format string bugs are common in practice (our type system found 104 bugs), and the annotation burden on the user of our type system is low (on average, for every bug found, only 1.0 annotations need to be written).",
            "Award": ""
        },
        {
            "Title": "Scalable Detection of Missed Cross-Function Refactorings",
            "Type": "Full Paper",
            "Key": "issta14main-mainid123-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DNarcisa+Andreea+Milea%2C+Lingxiao+Jiang%2C+and+Siau-Cheng+Khoo+%22Scalable+Detection+of+Missed+Cross-Function+Refactorings%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610394",
            "PersonsString": "Narcisa Andreea Milea, Lingxiao Jiang, and Siau-Cheng Khoo",
            "AffiliationsString": "National University of Singapore, Singapore; Singapore Management University, Singapore",
            "Authors": [
                "Narcisa Andreea Milea @ National University of Singapore, Singapore",
                "Lingxiao Jiang @ Singapore Management University, Singapore",
                "Siau-Cheng Khoo @ National University of Singapore, Singapore"
            ],
            "Affiliations": [
                "National University of Singapore, Singapore",
                "Singapore Management University, Singapore",
                "National University of Singapore, Singapore"
            ],
            "Abstract": "Refactoring is an important way to improve the design of existing code. Identifying refactoring opportunities (i.e., code fragments that can be refactored) in large code bases is a challenging task. In this paper, we propose a novel, automated and scalable technique for identifying cross-function refactoring opportunities that span more than one function (e.g., Extract Method and Inline Method). The key of our technique is the design of efficient vector inlining operations that emulate the effect of method inlining among code fragments, so that the problem of identifying cross-function refactoring can be reduced to the problem of finding similar vectors before and after inlining. We have implemented our technique in a prototype tool named ReDex which encodes Java programs to particular vectors. We have applied the tool to a large code base, 4.5 million lines of code, comprising of 200 bundle projects in the Eclipse ecosystem (e.g., Eclipse JDT, Eclipse PDE, Apache Commons, Hamcrest, etc.). Also, different from many other studies on detecting refactoring, ReDex only searches for code fragments that can be, but have not yet been, refactored in a way similar to some refactoring that happened in the code base. Our results show that ReDex can find 277 cross-function refactoring opportunities in 2 minutes, and 223 cases were labelled as true opportunities by users, and cover many categories of cross-function refactoring operations in classical refactoring books, such as Self Encapsulate Field, Decompose Conditional Expression, Hide Delegate, Preserve Whole Object, etc.",
            "Award": ""
        },
        {
            "Title": "Tailored Source Code Transformations to Synthesize Computationally Diverse Program Variants",
            "Type": "Full Paper",
            "Key": "issta14main-mainid46-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DBenoit+Baudry%2C+Simon+Allier%2C+and+Martin+Monperrus+%22Tailored+Source+Code+Transformations+to+Synthesize+Computationally+Diverse+Program+Variants%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610415",
            "PersonsString": "Benoit Baudry, Simon Allier, and Martin Monperrus",
            "AffiliationsString": "INRIA, France; IRISA, France; University of Lille, France",
            "Authors": [
                "Benoit Baudry @ INRIA, France / IRISA, France",
                "Simon Allier @ INRIA, France / IRISA, France",
                "Martin Monperrus @ University of Lille, France / INRIA, France"
            ],
            "Affiliations": [
                "INRIA, France / IRISA, France",
                "INRIA, France / IRISA, France",
                "University of Lille, France / INRIA, France"
            ],
            "Abstract": "The predictability of program execution provides attackers a rich source of knowledge who can exploit it to spy or remotely control the program. Moving target defense ad- dresses this issue by constantly switching between many di- verse variants of a program, which reduces the certainty that an attacker can have about the program execution. The ef- fectiveness of this approach relies on the availability of a large number of software variants that exhibit dierent ex- ecutions. However, current approaches rely on the natural diversity provided by o-the-shelf components, which is very limited. In this paper, we explore the automatic synthe- sis of large sets of program variants, called sosies. Sosies provide the same expected functionality as the original pro- gram, while exhibiting dierent executions. They are said to be computationally diverse. This work addresses two objectives: comparing dierent transformations for increasing the likelihood of sosie synthe- sis (densifying the search space for sosies); demonstrating computation diversity in synthesized sosies. We synthesized 30 184 sosies in total, for 9 large, real-world, open source ap- plications. For all these programs we identied one type of program analysis that systematically increases the density of sosies; we measured computation diversity for sosies of 3 programs and found diversity in method calls or data in more than 40% of sosies. This is a step towards controlled massive unpredictability of software.",
            "Award": ""
        },
        {
            "Title": "Using Test Case Reduction and Prioritization to Improve Symbolic Execution",
            "Type": "Full Paper",
            "Key": "issta14main-mainid76-p",
            "URL": "http%3A%2F%2Fweb.engr.oregonstate.edu%2F%7Ealipour%2Fpub%2Fissta14.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610392",
            "PersonsString": "Chaoqiang Zhang, Alex Groce, and Mohammad Amin Alipour",
            "AffiliationsString": "Oregon State University, USA",
            "Authors": [
                "Chaoqiang Zhang @ Oregon State University, USA",
                "Alex Groce @ Oregon State University, USA",
                "Mohammad Amin Alipour @ Oregon State University, USA"
            ],
            "Affiliations": [
                "Oregon State University, USA",
                "Oregon State University, USA",
                "Oregon State University, USA"
            ],
            "Abstract": "Scaling symbolic execution to large programs or programs with complex inputs remains difficult due to path explosion and complex constraints, as well as external method calls. Additionally, creating an effective test structure with symbolic inputs can be difficult. A popular symbolic execution strategy in practice is to perform symbolic execution not “from scratch” but based on existing test cases. This paper proposes that the effectiveness of this approach to symbolic execution can be enhanced by (1) reducing the size of seed test cases and (2) prioritizing seed test cases to maximize exploration efficiency. The proposed test case reduction strategy is based on a recently introduced generalization of delta debugging, and our prioritization techniques include novel methods that, for this purpose, can outperform some traditional regression testing algorithms. We show that applying these methods can significantly improve the effectiveness of symbolic execution based on existing test cases.",
            "Award": ""
        },
        {
            "Title": "FLOWER: Optimal Test Suite Reduction as a Network Maximum Flow",
            "Type": "Full Paper",
            "Key": "issta14main-mainid60-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DArnaud+Gotlieb+and+Dusica+Marijan+%22FLOWER%3A+Optimal+Test+Suite+Reduction+as+a+Network+Maximum+Flow%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610416",
            "PersonsString": "Arnaud Gotlieb and Dusica Marijan",
            "AffiliationsString": "Simula Research Laboratory, Norway",
            "Authors": [
                "Arnaud Gotlieb @ Simula Research Laboratory, Norway",
                "Dusica Marijan @ Simula Research Laboratory, Norway"
            ],
            "Affiliations": [
                "Simula Research Laboratory, Norway",
                "Simula Research Laboratory, Norway"
            ],
            "Abstract": "A trend in software testing is reducing the size of a test suite while preserving its overall quality. Given a test suite and a set of requirements covered by the suite, test suite reduction aims at selecting a subset of test cases that cover the same set of requirements. Even though this problem has received considerable attention, finding the smallest subset of test cases is still challenging and commonly-used approaches address this problem only with approximated solutions. When executing a single test case requires much manual effort (e.g., hours of preparation), finding the minimal subset is needed to reduce the testing costs. In this paper, we introduce a radically new approach to test suite reduction, called FLOWER, based on a search among network maximum flows. From a given test suite and the requirements covered by the suite, FLOWER forms a flow network (with specific constraints) that is then traversed to find its maximum flows. FLOWER leverages the Ford-Fulkerson method to compute maximum flows and Constraint Programming techniques to search among optimal flows. FLOWER is an exact method that computes a minimum-sized test suite, preserving the coverage of requirements. The experimental results show that FLOWER outperforms a non-optimized implementation of the Integer Linear Programming approach by 15-3000 times in terms of the time needed to find an optimal solution, and a simple greedy approach by 5-15% in terms of the size of reduced test suite.",
            "Award": ""
        },
        {
            "Title": "Coverage and Fault Detection of the Output-Uniqueness Test Selection Criteria",
            "Type": "Full Paper",
            "Key": "issta14main-mainid90-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DNadia+Alshahwan+and+Mark+Harman+%22Coverage+and+Fault+Detection+of+the+Output-Uniqueness+Test+Selection+Criteria%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610413",
            "PersonsString": "Nadia Alshahwan and Mark Harman",
            "AffiliationsString": "University College London, UK",
            "Authors": [
                "Nadia Alshahwan @ University College London, UK",
                "Mark Harman @ University College London, UK"
            ],
            "Affiliations": [
                "University College London, UK",
                "University College London, UK"
            ],
            "Abstract": "This paper studies the whitebox coverage and fault detection achieved by Output Uniqueness, a newly proposed blackbox test criterion, using 6 web applications. We find that output uniqueness exhibits average correlation coefficients of 0.85, 0.83 and 0.97 with statement, branch and path coverage respectively. More interestingly, output uniqueness finds 92% of the real faults found by branch coverage (and a further 47% that remained undetected by such whitebox techniques). These results suggest that output uniqueness may provide a useful surrogate when whitebox techniques are inapplicable and an effective complement where they are.",
            "Award": ""
        },
        {
            "Title": "Dodona: Automated Oracle Data Set Selection",
            "Type": "Full Paper",
            "Key": "issta14main-mainid128-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DPablo+Loyola%2C+Matt+Staats%2C+In-Young+Ko%2C+and+Gregg+Rothermel+%22Dodona%3A+Automated+Oracle+Data+Set+Selection%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610408",
            "PersonsString": "Pablo Loyola, Matt Staats, In-Young Ko, and Gregg Rothermel",
            "AffiliationsString": "University of Chile, Chile; University of Luxembourg, Luxembourg; KAIST, South Korea; University of Nebraska-Lincoln, USA",
            "Authors": [
                "Pablo Loyola @ University of Chile, Chile",
                "Matt Staats @ University of Luxembourg, Luxembourg",
                "In-Young Ko @ KAIST, South Korea",
                "Gregg Rothermel @ University of Nebraska-Lincoln, USA"
            ],
            "Affiliations": [
                "University of Chile, Chile",
                "University of Luxembourg, Luxembourg",
                "KAIST, South Korea",
                "University of Nebraska-Lincoln, USA"
            ],
            "Abstract": "Software complexity has increased the need for automated software testing. Most research on automating testing, however, has focused on creating test input data. While careful selection of input data is necessary to reach faulty states in a system under test, test oracles are needed to actually detect failures. In this work, we describe Dodona, a system that supports the generation of test oracles. Dodona ranks program variables based on the interactions and dependencies observed between them during program execution. Using this ranking, Dodona proposes a set of variables to be monitored, that can be used by engineers to construct assertion-based oracles. Our empirical study of Dodona reveals that it is more effective and efficient than the current state-of-the-art approach for generating oracle data sets, and can often yield oracles that are almost as effective as oracles hand-crafted by engineers without support.",
            "Award": ""
        },
        {
            "Title": "CrashLocator: Locating Crashing Faults Based on Crash Stacks",
            "Type": "Full Paper",
            "Key": "issta14main-mainid43-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DRongxin+Wu%2C+Hongyu+Zhang%2C+Shing-Chi+Cheung%2C+and+Sunghun+Kim+%22CrashLocator%3A+Locating+Crashing+Faults+Based+on+Crash+Stacks%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610386",
            "PersonsString": "Rongxin Wu, Hongyu Zhang, Shing-Chi Cheung, and Sunghun Kim",
            "AffiliationsString": "Hong Kong University of Science and Technology, China; Microsoft Research, China",
            "Authors": [
                "Rongxin Wu @ Hong Kong University of Science and Technology, China",
                "Hongyu Zhang @ Microsoft Research, China",
                "Shing-Chi Cheung @ Hong Kong University of Science and Technology, China",
                "Sunghun Kim @ Hong Kong University of Science and Technology, China"
            ],
            "Affiliations": [
                "Hong Kong University of Science and Technology, China",
                "Microsoft Research, China",
                "Hong Kong University of Science and Technology, China",
                "Hong Kong University of Science and Technology, China"
            ],
            "Abstract": "Software crash is common. When a crash occurs, software developers can receive a report upon user permission. A crash report typically includes a call stack at the time of crash. An important step of debugging a crash is to identify faulty functions, which is often a tedious and labor-intensive task. In this paper, we propose CrashLocator, a method to locate faulty functions using the crash stack information in crash reports. It deduces possible crash traces (the failing execution traces that lead to crash) by expanding the crash stack with functions in static call graph. It then calculates the suspiciousness of each function in the approximate crash traces. The functions are then ranked by their suspiciousness scores and are recommended to developers for further investigation. We evaluate our approach using real-world Mozilla crash data. The results show that our approach is effective: we can locate 50.6%, 63.7% and 67.5% of crashing faults by examining top 1, 5 and 10 functions recommended by CrashLocator, respectively. Our approach outperforms the conventional stack-only methods significantly.",
            "Award": ""
        },
        {
            "Title": "Efficient Predicated Bug Signature Mining via Hierarchical Instrumentation",
            "Type": "Full Paper",
            "Key": "issta14main-mainid110-p",
            "URL": "http%3A%2F%2Fwww.comp.nus.edu.sg%2F%7Ea0068965%2Fresearch%2Fissta-2014%2FHIMPS.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610400",
            "PersonsString": "Zhiqiang Zuo, Siau-Cheng Khoo, and Chengnian Sun",
            "AffiliationsString": "National University of Singapore, Singapore; University of California at Davis, USA",
            "Authors": [
                "Zhiqiang Zuo @ National University of Singapore, Singapore",
                "Siau-Cheng Khoo @ National University of Singapore, Singapore",
                "Chengnian Sun @ University of California at Davis, USA"
            ],
            "Affiliations": [
                "National University of Singapore, Singapore",
                "National University of Singapore, Singapore",
                "University of California at Davis, USA"
            ],
            "Abstract": "Debugging is known to be a notoriously painstaking and time-consuming task. An essential and yet expensive process in debugging is bug isolation. As one major family of automatic bug isolation, statistical bug isolation approaches have been well studied in the past decade. A recent advancement in this area is the introduction of bug signature that provides contextual information to assist in debugging and several bug signature mining approaches have been reported. All these approaches instrument the entire buggy program to produce profiles for debugging. Consequently, they often incur hefty instrumentation and analysis cost. However, as in fact major part of the program code is error-free, full-scale program instrumentation is wasteful and unnecessary. In this paper, we devise a novel hierarchical instrumentation (HI) technique to perform selective instrumentation so as to enhance the efficiency of statistical debugging. We employ HI technique to predicated bug signature mining (called MPS) recently developed and propose an approach called HIMPS. The empirical study reveals that our technique can achieve around 40% to 60% saving in disk storage usage, time and memory consumption, and performs especially well on large programs. It greatly improves the efficiency of bug signature mining, making a step forward to painless debugging.",
            "Award": ""
        },
        {
            "Title": "Semantic Differential Repair for Input Validation and Sanitization",
            "Type": "Full Paper",
            "Key": "issta14main-mainid114-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DMuath+Alkhalaf%2C+Abdulbaki+Aydin%2C+and+Tevfik+Bultan+%22Semantic+Differential+Repair+for+Input+Validation+and+Sanitization%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610401",
            "PersonsString": "Muath Alkhalaf, Abdulbaki Aydin, and Tevfik Bultan",
            "AffiliationsString": "University of California at Santa Barbara, USA",
            "Authors": [
                "Muath Alkhalaf @ University of California at Santa Barbara, USA",
                "Abdulbaki Aydin @ University of California at Santa Barbara, USA",
                "Tevfik Bultan @ University of California at Santa Barbara, USA"
            ],
            "Affiliations": [
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA"
            ],
            "Abstract": "Correct validation and sanitization of user input is crucial in web applications for avoiding security vulnerabilities and erroneous application behavior. We present an automated differential repair technique for input validation and sanitization functions. Differential repair can be used within an application to repair client and server-side code with respect to each other, or across applications in order to strengthen the validation and sanitization checks. Given a reference and a target function, our differential repair technique strengthens the validation and sanitization operations in the target function based on the reference function. It does this by synthesizing three patches: a validation, a length, and a sanitization patch. Our automated patch synthesis algorithms are based on forward and backward symbolic string analyses that use automata as a symbolic representation. Composition of the three automatically synthesized patches with the original target function results in the repaired function, which provides stronger validation and sanitization than both the target and the reference functions.",
            "Award": ""
        },
        {
            "Title": "Automatic Repair for Multi-threaded Programs with Deadlock/Livelock using Maximum Satisfiability",
            "Type": "Full Paper",
            "Key": "issta14main-mainid89-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DYiyan+Lin+and+Sandeep+S.+Kulkarni+%22Automatic+Repair+for+Multi-threaded+Programs+with+Deadlock%2FLivelock+using+Maximum+Satisfiability%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610398",
            "PersonsString": "Yiyan Lin and Sandeep S. Kulkarni",
            "AffiliationsString": "Michigan State University, USA",
            "Authors": [
                "Yiyan Lin @ Michigan State University, USA",
                "Sandeep S. Kulkarni @ Michigan State University, USA"
            ],
            "Affiliations": [
                "Michigan State University, USA",
                "Michigan State University, USA"
            ],
            "Abstract": "Deadlock-freedom is a major challenge in developing multi-threaded programs, as a deadlock cannot be resolved until one restarts the program (mostly by using manual intervention). To avoid the risk of blocking, a program may use the trylock operations rather than lock operations. In this case, if a thread fails to acquire a lock using trylock, since trylock is non-blocking, the thread can release acquired locks to avoid a deadlock after trylock returns. Although this approach avoids deadlocks, it may also introduce bugs such as livelock and deadlivelock. Moreover, when such bugs are identified in a program, revising the program manually is error-prone.  With this motivation, in this paper, we propose an approach for avoiding deadlocks, livelocks and deadlivelocks in the given multi-threaded program. In our approach, we first identify cyclic lock dependencies that may lead to deadlocks, livelocks or deadlivelocks. Subsequently, we map the problem of ensuring freedom from deadlocks, livelocks and deadlivelocks to the weighted partial maximum satisfiability problem. To ensure that the repaired program preserves most of original design, our approach attempts to make minimal changes to the original program.",
            "Award": ""
        },
        {
            "Title": "Make It Work, Make It Right, Make It Fast: Building a Platform-Neutral Whole-System Dynamic Binary Analysis Platform",
            "Type": "Full Paper",
            "Key": "issta14main-mainid101-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAndrew+Henderson%2C+Aravind+Prakash%2C+Lok+Kwong+Yan%2C+Xunchao+Hu%2C+Xujiewen+Wang%2C+Rundong+Zhou%2C+and+Heng+Yin+%22Make+It+Work%2C+Make+It+Right%2C+Make+It+Fast%3A+Building+a+Platform-Neutral+Whole-System+Dynamic+Binary+Analysis+Platform%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610407",
            "PersonsString": "Andrew Henderson, Aravind Prakash, Lok Kwong Yan, Xunchao Hu, Xujiewen Wang, Rundong Zhou, and Heng Yin",
            "AffiliationsString": "Syracuse University, USA; Rome Laboratory, USA",
            "Authors": [
                "Andrew Henderson @ Syracuse University, USA",
                "Aravind Prakash @ Syracuse University, USA",
                "Lok Kwong Yan @ Rome Laboratory, USA",
                "Xunchao Hu @ Syracuse University, USA",
                "Xujiewen Wang @ Syracuse University, USA",
                "Rundong Zhou @ Syracuse University, USA",
                "Heng Yin @ Syracuse University, USA"
            ],
            "Affiliations": [
                "Syracuse University, USA",
                "Syracuse University, USA",
                "Rome Laboratory, USA",
                "Syracuse University, USA",
                "Syracuse University, USA",
                "Syracuse University, USA",
                "Syracuse University, USA"
            ],
            "Abstract": "Dynamic binary analysis is a prevalent and indispensable technique in program analysis. While several dynamic binary analysis tools and frameworks have been proposed, all suffer from one or more of: prohibitive performance degradation, semantic gap between the analysis code and the program being analyzed, architecture/OS specificity, being user-mode only, lacking APIs, etc. We present DECAF, a virtual machine based, multi-target, whole-system dynamic binary analysis framework built on top of QEMU. DECAF provides Just-In-Time Virtual Machine Introspection combined with a novel TCG instruction-level tainting at bit granularity, backed by a plugin based, simple-to-use event driven programming interface. DECAF exercises fine control over the TCG instructions to accomplish on-the-fly optimizations. We present 3 platform-neutral plugins - Instruction Tracer, Keylogger Detector, and API Tracer, to demonstrate the ease of use and effectiveness of DECAF in writing cross-platform and system-wide analysis tools. Implementation of DECAF consists of 9550 lines of C++ code and 10270 lines of C code and we evaluate DECAF using CPU2006 SPEC benchmarks and show average overhead of 605% for system wide tainting and 12% for VMI.",
            "Award": ""
        },
        {
            "Title": "Automated Testing for SQL Injection Vulnerabilities: An Input Mutation Approach",
            "Type": "Full Paper",
            "Key": "issta14main-mainid69-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDennis+Appelt%2C+Cu+Duy+Nguyen%2C+Lionel+C.+Briand%2C+and+Nadia+Alshahwan+%22Automated+Testing+for+SQL+Injection+Vulnerabilities%3A+An+Input+Mutation+Approach%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610403",
            "PersonsString": "Dennis Appelt, Cu Duy Nguyen, Lionel C. Briand, and Nadia Alshahwan",
            "AffiliationsString": "University of Luxembourg, Luxembourg; University College London, UK",
            "Authors": [
                "Dennis Appelt @ University of Luxembourg, Luxembourg",
                "Cu Duy Nguyen @ University of Luxembourg, Luxembourg",
                "Lionel C. Briand @ University of Luxembourg, Luxembourg",
                "Nadia Alshahwan @ University College London, UK"
            ],
            "Affiliations": [
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg",
                "University College London, UK"
            ],
            "Abstract": "Web services are increasingly adopted in various domains, from finance and e-government to social media. As they are built on top of the web technologies, they suffer also an unprecedented amount of attacks and exploitations like the Web. Among the attacks, those that target SQL injection vulnerabilities have consistently been top-ranked for the last years. Testing to detect such vulnerabilities before making web services public is crucial. We present in this paper an automated testing approach, namely μ4SQLi, and its underpinning set of mutation operators. μ4SQLi can produce effective inputs that lead to executable and harmful SQL statements. Executability is key as otherwise no injection vulnerability can be exploited. Our evaluation demonstrated that the approach is effective to detect SQL injection vulnerabilities and to produce inputs that bypass application firewalls, which is a common configuration in real world.",
            "Award": ""
        },
        {
            "Title": "Reducing GUI Test Suites via Program Slicing",
            "Type": "Full Paper",
            "Key": "issta14main-mainid52-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DStephan+Arlt%2C+Andreas+Podelski%2C+and+Martin+Wehrle+%22Reducing+GUI+Test+Suites+via+Program+Slicing%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610391",
            "PersonsString": "Stephan Arlt, Andreas Podelski, and Martin Wehrle",
            "AffiliationsString": "University of Luxembourg, Luxembourg; University of Freiburg, Germany; University of Basel, Switzerland",
            "Authors": [
                "Stephan Arlt @ University of Luxembourg, Luxembourg",
                "Andreas Podelski @ University of Freiburg, Germany",
                "Martin Wehrle @ University of Basel, Switzerland"
            ],
            "Affiliations": [
                "University of Luxembourg, Luxembourg",
                "University of Freiburg, Germany",
                "University of Basel, Switzerland"
            ],
            "Abstract": "A crucial problem in GUI testing is the identification of accurate event sequences that encode corresponding user interactions with the GUI. Ultimately, event sequences should be both feasible (i. e., executable on the GUI) and relevant (i.e., cover as much of the code as possible). So far, most work on GUI testing focused on approaches to generate feasible event sequences. In addition, based on event dependency analyses, a recently proposed static analysis approach systematically aims at selecting both relevant and feasible event sequences. However, statically analyzing event dependencies can cause the generation of a huge number of event sequences, leading to unmanageable GUI test suites that are not executable within reasonable time. In this paper we propose a refined static analysis approach based on program slicing. On the theoretical side, our approach identifies and eliminates redundant event sequences in GUI test suites. Redundant event sequences have the property that they are guaranteed to not affect the test effectiveness. On the practical side, we have implemented a slicing-based test suite reduction algorithm that approximatively identifies redundant event sequences. Our experiments on six open source GUI applications show that our reduction algorithm significantly reduces the size of GUI test suites. As a result, the overall execution time could significantly be reduced without losing test effectiveness.",
            "Award": ""
        },
        {
            "Title": "SunCat: Helping Developers Understand and Predict Performance Problems in Smartphone Applications",
            "Type": "Full Paper",
            "Key": "issta14main-mainid5-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAdrian+Nistor+and+Lenin+Ravindranath+%22SunCat%3A+Helping+Developers+Understand+and+Predict+Performance+Problems+in+Smartphone+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610410",
            "PersonsString": "Adrian Nistor and Lenin Ravindranath",
            "AffiliationsString": "Chapman University, USA; Massachusetts Institute of Technology, USA",
            "Authors": [
                "Adrian Nistor @ Chapman University, USA",
                "Lenin Ravindranath @ Massachusetts Institute of Technology, USA"
            ],
            "Affiliations": [
                "Chapman University, USA",
                "Massachusetts Institute of Technology, USA"
            ],
            "Abstract": "The number of smartphones shipped in 2014 will be four times larger than the number of PCs. Compared to PCs, smartphones have limited computing resources, and smartphone applications are more prone to performance problems. Traditionally, developers use profilers to detect performance problems by running applications with relatively large inputs. Unfortunately, for smartphone applications, the developer cannot easily control the input, because smartphone applications interact heavily with the environment.  Given a run on a small input, how can a developer detect performance problems that would occur for a run with large input? We present SUNCAT, a novel technique that helps developers understand and predict performance problems in smartphone applications. The developer runs the application using a common input, typically small, and SUNCAT presents a prioritized list of repetition patterns that summarize the current run plus additional information to help the developer understand how these patterns may grow in the future runs with large inputs. We implemented SUNCAT for Windows Phone systems and used it to understand the performance characteristics of 29 usage scenarios in 5 popular applications. We found one performance problem that was confirmed and fixed, four problems that were confirmed, one confirmed problem that was a duplicate of an older report, and three more potential performance problems that developers agree may be improved.",
            "Award": ""
        },
        {
            "Title": "A Variability-Based Testing Approach for Synthesizing Video Sequences",
            "Type": "Full Paper",
            "Key": "issta14main-mainid71-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DJos%C3%A9+A.+Galindo%2C+Mauricio+Alf%C3%A9rez%2C+Mathieu+Acher%2C+Benoit+Baudry%2C+and+David+Benavides+%22A+Variability-Based+Testing+Approach+for+Synthesizing+Video+Sequences%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610411",
            "PersonsString": "José A. Galindo, Mauricio Alférez, Mathieu Acher, Benoit Baudry, and David Benavides",
            "AffiliationsString": "INRIA, France; University of Rennes 1, France; University of Seville, Spain",
            "Authors": [
                "José A. Galindo @ INRIA, France",
                "Mauricio Alférez @ INRIA, France",
                "Mathieu Acher @ University of Rennes 1, France / INRIA, France",
                "Benoit Baudry @ INRIA, France",
                "David Benavides @ University of Seville, Spain"
            ],
            "Affiliations": [
                "INRIA, France",
                "INRIA, France",
                "University of Rennes 1, France / INRIA, France",
                "INRIA, France",
                "University of Seville, Spain"
            ],
            "Abstract": "A key problem when developing video processing software is the difficulty to test different input combinations. In this paper, we present VANE, a variability-based testing approach to derive video sequence variants. The ideas of VANE are i) to encode in a variability model what can vary within a video sequence; ii) to exploit the variability model to generate testable configurations; iii) to synthesize variants of video sequences corresponding to configurations. VANE computes T-wise covering sets while optimizing a function over attributes. Also, we present a preliminary validation of the scalability and practicality of VANE in the context of an industrial project involving the test of video processing algorithms.",
            "Award": ""
        },
        {
            "Title": "Robust Test Automation using Contextual Clues",
            "Type": "Full Paper",
            "Key": "issta14main-mainid107-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DRahulkrishna+Yandrapally%2C+Suresh+Thummalapenta%2C+Saurabh+Sinha%2C+and+Satish+Chandra+%22Robust+Test+Automation+using+Contextual+Clues%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610390",
            "PersonsString": "Rahulkrishna Yandrapally, Suresh Thummalapenta, Saurabh Sinha, and Satish Chandra",
            "AffiliationsString": "IBM Research, India; Microsoft, USA; Samsung Research, USA",
            "Authors": [
                "Rahulkrishna Yandrapally @ IBM Research, India",
                "Suresh Thummalapenta @ Microsoft, USA",
                "Saurabh Sinha @ IBM Research, India",
                "Satish Chandra @ Samsung Research, USA"
            ],
            "Affiliations": [
                "IBM Research, India",
                "Microsoft, USA",
                "IBM Research, India",
                "Samsung Research, USA"
            ],
            "Abstract": "Despite the seemingly obvious advantage of test automation, significant skepticism exists in the industry regarding its cost-benefit tradeoffs. Test scripts for web applications are fragile: even small changes in the page layout can break a number of tests, requiring the expense of re-automating them. Moreover, a test script created for one browser cannot be relied upon to run on a different web browser: it requires duplicate effort to create and maintain versions of tests for a variety of browsers. Because of these hidden costs, organizations often fall back to manual testing.  We present a fresh solution to the problem of test-script fragility. Often, the root cause of test-script fragility is that, to identify UI elements on a page, tools typically record some metadata that depends on the internal representation of the page in a browser. Our technique eliminates metadata almost entirely. Instead, it identifies UI elements relative to other prominent elements on the page. The core of our technique automatically identifies a series of contextual clues that unambiguously identify a UI element, without recording anything about the internal representation.  Empirical evidence shows that our technique is highly accurate in computing contextual clues, and outperforms existing techniques in its resilience to UI changes as well as browser changes.",
            "Award": ""
        },
        {
            "Title": "Efficient Mutation Analysis by Propagating and Partitioning Infected Execution States",
            "Type": "Full Paper",
            "Key": "issta14main-mainid103-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DRen%C3%A9+Just%2C+Michael+D.+Ernst%2C+and+Gordon+Fraser+%22Efficient+Mutation+Analysis+by+Propagating+and+Partitioning+Infected+Execution+States%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610388",
            "PersonsString": "René Just, Michael D. Ernst, and Gordon Fraser",
            "AffiliationsString": "University of Washington, USA; University of Sheffield, UK",
            "Authors": [
                "René Just @ University of Washington, USA",
                "Michael D. Ernst @ University of Washington, USA",
                "Gordon Fraser @ University of Sheffield, UK"
            ],
            "Affiliations": [
                "University of Washington, USA",
                "University of Washington, USA",
                "University of Sheffield, UK"
            ],
            "Abstract": "Mutation analysis evaluates a testing technique by measur- ing how well it detects seeded faults (mutants). Mutation analysis is hampered by inherent scalability problems — a test suite is executed for each of a large number of mutants. Despite numerous optimizations presented in the literature, this scalability issue remains, and this is one of the reasons why mutation analysis is hardly used in practice. Whereas most previous optimizations attempted to stati- cally reduce the number of executions or their computational overhead, this paper exploits information available only at run time to further reduce the number of executions. First, state infection conditions can reveal — with a single test execution of the unmutated program — which mutants would lead to a different state, thus avoiding unnecessary test executions. Second, determining whether an infected execution state propagates can further reduce the number of executions. Mutants that are embedded in compound expressions may infect the state locally without affecting the outcome of the compound expression. Third, those mutants that do infect the state can be partitioned based on the resulting infected state — if two mutants lead to the same infected state, only one needs to be executed as the result of the other can be inferred. We have implemented these optimizations in the Major mu- tation framework and empirically evaluated them on 14 open source programs. The optimizations reduced the mutation analysis time by 40% on average.",
            "Award": ""
        },
        {
            "Title": "Lightweight Automated Detection of Unsafe Information Leakage via Exceptions",
            "Type": "Full Paper",
            "Key": "issta14main-mainid83-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DBenwen+Zhang+and+James+Clause+%22Lightweight+Automated+Detection+of+Unsafe+Information+Leakage+via+Exceptions%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610412",
            "PersonsString": "Benwen Zhang and James Clause",
            "AffiliationsString": "University of Delaware, USA",
            "Authors": [
                "Benwen Zhang @ University of Delaware, USA",
                "James Clause @ University of Delaware, USA"
            ],
            "Affiliations": [
                "University of Delaware, USA",
                "University of Delaware, USA"
            ],
            "Abstract": "Unintended information leakage is one of the most common and severe problems facing modern applications. To help developers detect information leaks before they can be leveraged by attackers, we present a new static analysis-based technique for detecting a specific type of information leak: information leaks via exceptions. Because it focuses on a specific type of leak, the technique is able to be efficient, effective, and easy to use, qualities that are often lacking in more general techniques. We implemented our technique in a prototype tool, UDLD, and performed an extensive empirical evaluation using 19 real web applications. The results of the evaluation show that UDLD is both efficient and effective at detecting unsafe information leaks via exceptions; for the subjects that we considered, UDLD is the fastest among several alternative tools. Moreover, it reported more true leaks than existing state-of-the-art tools with no known false negatives and no false positives.",
            "Award": ""
        },
        {
            "Title": "Integrated Energy-Directed Test Suite Optimization",
            "Type": "Full Paper",
            "Key": "issta14main-mainid97-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DDing+Li%2C+Yuchen+Jin%2C+Cagri+Sahin%2C+James+Clause%2C+and+William+G.+J.+Halfond+%22Integrated+Energy-Directed+Test+Suite+Optimization%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610414",
            "PersonsString": "Ding Li, Yuchen Jin, Cagri Sahin, James Clause, and William G. J. Halfond",
            "AffiliationsString": "University of Southern California, USA; University of Delaware, USA",
            "Authors": [
                "Ding Li @ University of Southern California, USA",
                "Yuchen Jin @ University of Southern California, USA",
                "Cagri Sahin @ University of Delaware, USA",
                "James Clause @ University of Delaware, USA",
                "William G. J. Halfond @ University of Southern California, USA"
            ],
            "Affiliations": [
                "University of Southern California, USA",
                "University of Southern California, USA",
                "University of Delaware, USA",
                "University of Delaware, USA",
                "University of Southern California, USA"
            ],
            "Abstract": "In situ testing techniques have become an important means of ensuring the reliability of embedded systems after they are deployed in the field. However, these techniques do not help testers optimize the energy consumption of their in situ test suites, which can needlessly waste the limited battery power of these systems. In this work, we extend prior techniques for test suite minimization in such a way as to allow testers to generate energy-efficient, minimized test suites with only minimal modifications to their existing work flow. We perform an extensive empirical evaluation of our approach using the test suites provided for real world applications. The results of the evaluation show that our technique is effective at generating, in less than one second, test suites that consume up to 95% less energy while maintaining coverage of the testing requirements.",
            "Award": ""
        },
        {
            "Title": "Identifying Optimal Trade-Offs between CPU Time Usage and Temporal Constraints Using Search",
            "Type": "Full Paper",
            "Key": "issta14main-mainid29-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DShiva+Nejati+and+Lionel+C.+Briand+%22Identifying+Optimal+Trade-Offs+between+CPU+Time+Usage+and+Temporal+Constraints+Using+Search%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610396",
            "PersonsString": "Shiva Nejati and Lionel C. Briand",
            "AffiliationsString": "University of Luxembourg, Luxembourg",
            "Authors": [
                "Shiva Nejati @ University of Luxembourg, Luxembourg",
                "Lionel C. Briand @ University of Luxembourg, Luxembourg"
            ],
            "Affiliations": [
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg"
            ],
            "Abstract": "Integration of software from different sources is a critical activity in many embedded systems across most industry sectors. Software integrators are responsible for producing reliable systems that fulfil various functional and performance requirements. In many situations, these requirements inversely impact one another. In particular, embedded system integrators often need to make compromises regarding some of the functional system properties to optimize the use of various resources, such as CPU time. In this paper, motivated by challenges faced by industry, we introduce a multi-objective decision support approach to help balance the minimization of CPU time usage and the satisfaction of temporal constraints in automotive systems. We develop a multi-objective, search-based optimization algorithm, specifically designed to work for large search spaces, to identify optimal trade-off solutions fulfilling these two objectives. We evaluated our algorithm by applying it to a large automotive system. Our results show that our algorithm can find solutions that are very close to the estimated ideal optimal values, and further, it finds significantly better solutions than a random strategy while being faster. Finally, our approach efficiently identifies a large number of diverse solutions, helping domain experts and other stakeholders negotiate the solutions to reach an agreement.",
            "Award": ""
        },
        {
            "Title": "Feedback-Driven Dynamic Invariant Discovery",
            "Type": "Full Paper",
            "Key": "issta14main-mainid106-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLingming+Zhang%2C+Guowei+Yang%2C+Neha+Rungta%2C+Suzette+Person%2C+and+Sarfraz+Khurshid+%22Feedback-Driven+Dynamic+Invariant+Discovery%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610389",
            "PersonsString": "Lingming Zhang, Guowei Yang, Neha Rungta, Suzette Person, and Sarfraz Khurshid",
            "AffiliationsString": "University of Texas at Austin, USA; Texas State University, USA; NASA Ames Research Center, USA; NASA Langley Research Center, USA",
            "Authors": [
                "Lingming Zhang @ University of Texas at Austin, USA",
                "Guowei Yang @ Texas State University, USA",
                "Neha Rungta @ NASA Ames Research Center, USA",
                "Suzette Person @ NASA Langley Research Center, USA",
                "Sarfraz Khurshid @ University of Texas at Austin, USA"
            ],
            "Affiliations": [
                "University of Texas at Austin, USA",
                "Texas State University, USA",
                "NASA Ames Research Center, USA",
                "NASA Langley Research Center, USA",
                "University of Texas at Austin, USA"
            ],
            "Abstract": "Program invariants can help software developers identify program properties that must be preserved as the software evolves, however, formulating correct invariants can be challenging. In this work, we introduce iDiscovery, a technique which leverages symbolic execution to improve the quality of dynamically discovered invariants computed by Daikon. Candidate invariants generated by Daikon are synthesized into assertions and instrumented onto the program. The instrumented code is executed symbolically to generate new test cases that are fed back to Daikon to help further refine the set of candidate invariants. This feedback loop is executed until a fix-point is reached. To mitigate the cost of symbolic execution, we present optimizations to prune the symbolic state space and to reduce the complexity of the generated path conditions. We also leverage recent advances in constraint solution reuse techniques to avoid computing results for the same constraints across iterations. Experimental results show that iDiscovery converges to a set of higher quality invariants compared to the initial set of candidate invariants in a small number of iterations.",
            "Award": ""
        },
        {
            "Title": "Link: Exploiting the Web of Data to Generate Test Inputs",
            "Type": "Full Paper",
            "Key": "issta14main-mainid63-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DLeonardo+Mariani%2C+Mauro+Pezz%C3%A8%2C+Oliviero+Riganelli%2C+and+Mauro+Santoro+%22Link%3A+Exploiting+the+Web+of+Data+to+Generate+Test+Inputs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610397",
            "PersonsString": "Leonardo Mariani, Mauro Pezzè, Oliviero Riganelli, and Mauro Santoro",
            "AffiliationsString": "University of Milano-Bicocca, Italy; University of Lugano, Switzerland",
            "Authors": [
                "Leonardo Mariani @ University of Milano-Bicocca, Italy",
                "Mauro Pezzè @ University of Lugano, Switzerland / University of Milano-Bicocca, Italy",
                "Oliviero Riganelli @ University of Milano-Bicocca, Italy",
                "Mauro Santoro @ University of Milano-Bicocca, Italy"
            ],
            "Affiliations": [
                "University of Milano-Bicocca, Italy",
                "University of Lugano, Switzerland / University of Milano-Bicocca, Italy",
                "University of Milano-Bicocca, Italy",
                "University of Milano-Bicocca, Italy"
            ],
            "Abstract": "Applications that process complex data, such as maps, personal data, book information, travel data, etc., are becoming extremely common. Testing such applications is hard, because they require realistic and coherent test inputs that are expensive to generate manually and difficult to synthesize automatically. So far the research on test case generation techniques has focused mostly on generating test sequences and synthetic test inputs, and has payed little attention to the generation of complex test inputs.  This paper presents Link, a technique to automatically generate test cases for applications that process complex data. The novel idea of Link is to exploit the Web of Data to generate test data that match the semantics of the related fields, and satisfy the semantic constraints that arise among interrelated fields. Link automatically analyzes the GUI of the application under test, generates a model of the required inputs, queries DBPedia to extract the data that can be used in the tests, and uses the extracted data to generate complex system test inputs.  The experimental results show that Link can generate realistic and coherent test inputs that can exercise behaviors difficult to exercise with currently available techniques.",
            "Award": ""
        },
        {
            "Title": "Empirically Revisiting the Test Independence Assumption",
            "Type": "Full Paper",
            "Key": "issta14main-mainid91-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DSai+Zhang%2C+Darioush+Jalali%2C+Jochen+Wuttke%2C+K%C4%B1van%C3%A7+Mu%C5%9Flu%2C+Wing+Lam%2C+Michael+D.+Ernst%2C+and+David+Notkin+%22Empirically+Revisiting+the+Test+Independence+Assumption%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610404",
            "PersonsString": "Sai Zhang, Darioush Jalali, Jochen Wuttke, Kıvanç Muşlu, Wing Lam, Michael D. Ernst, and David Notkin",
            "AffiliationsString": "University of Washington, USA",
            "Authors": [
                "Sai Zhang @ University of Washington, USA",
                "Darioush Jalali @ University of Washington, USA",
                "Jochen Wuttke @ University of Washington, USA",
                "Kıvanç Muşlu @ University of Washington, USA",
                "Wing Lam @ University of Washington, USA",
                "Michael D. Ernst @ University of Washington, USA",
                "David Notkin @ University of Washington, USA"
            ],
            "Affiliations": [
                "University of Washington, USA",
                "University of Washington, USA",
                "University of Washington, USA",
                "University of Washington, USA",
                "University of Washington, USA",
                "University of Washington, USA",
                "University of Washington, USA"
            ],
            "Abstract": "In a test suite, all the test cases should be independent: no test should affect any other test’s result, and running the tests in any order should produce the same test results. Techniques such as test prioritization generally assume that the tests in a suite are independent. Test dependence is a little-studied phenomenon. This paper presents five results related to test dependence.  First, we characterize the test dependence that arises in practice. We studied 96 real-world dependent tests from 5 issue tracking systems. Our study shows that test dependence can be hard for programmers to identify. It also shows that test dependence can cause non-trivial consequences, such as masking program faults and leading to spurious bug reports.  Second, we formally define test dependence in terms of test suites as ordered sequences of tests along with explicit environments in which these tests are executed. We formulate the problem of detecting dependent tests and prove that a useful special case is NP-complete.  Third, guided by the study of real-world dependent tests, we propose and compare four algorithms to detect dependent tests in a test suite.  Fourth, we applied our dependent test detection algorithms to 4 real-world programs and found dependent tests in each human-written and automatically-generated test suite.  Fifth, we empirically assessed the impact of dependent tests on five test prioritization techniques. Dependent tests affect the output of all five techniques; that is, the reordered suite fails even though the original suite did not.",
            "Award": ""
        },
        {
            "Title": "An Empirical Study of Injected versus Actual Interface Errors",
            "Type": "Full Paper",
            "Key": "issta14main-mainid50-p",
            "URL": "http%3A%2F%2Fscholar.google.ca%2Fscholar%3Fq%3DAnna+Lanzaro%2C+Roberto+Natella%2C+Stefan+Winter%2C+Domenico+Cotroneo%2C+and+Neeraj+Suri+%22An+Empirical+Study+of+Injected+versus+Actual+Interface+Errors%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2610384.2610418",
            "PersonsString": "Anna Lanzaro, Roberto Natella, Stefan Winter, Domenico Cotroneo, and Neeraj Suri",
            "AffiliationsString": "Federico II University of Naples, Italy; TU Darmstadt, Germany",
            "Authors": [
                "Anna Lanzaro @ Federico II University of Naples, Italy",
                "Roberto Natella @ Federico II University of Naples, Italy",
                "Stefan Winter @ TU Darmstadt, Germany",
                "Domenico Cotroneo @ Federico II University of Naples, Italy",
                "Neeraj Suri @ TU Darmstadt, Germany"
            ],
            "Affiliations": [
                "Federico II University of Naples, Italy",
                "Federico II University of Naples, Italy",
                "TU Darmstadt, Germany",
                "Federico II University of Naples, Italy",
                "TU Darmstadt, Germany"
            ],
            "Abstract": "The reuse of software components is a common practice in commercial applications and increasingly appearing in safety critical systems as driven also by cost considerations. This practice puts dependability at risk, as differing operating conditions in different reuse scenarios may expose residual software faults in the components. Consequently, software fault injection techniques are used to assess how residual faults of reused software components may affect the system, and to identify appropriate counter-measures. As fault injection in components’ code suffers from a number of practical disadvantages, it is often replaced by error injection at the component interface level. However, it is still an open issue, whether such injected errors are actually representative of the effects of residual faults. To this end, we propose a method for analyzing how software faults turn into interface errors, with the ultimate aim of supporting more representative interface error injection experiments. Our analysis in the context of widely used software libraries reveals that existing interface error models are not suitable for emulating software faults, and provides useful insights for improving the representativeness of interface error injection.",
            "Award": ""
        }
    ],
    "Sessions": [
        {
            "Id": "ahtej3Do7p",
            "Title": "Concurrency and Verification",
            "ShortTitle": "Concurrency and Verification",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-23 10:30 Concurrency and Verification",
            "Day": "2014-07-23",
            "Time": "10:30 - 12:10",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid95-p",
                "issta14main-mainid80-p",
                "issta14main-mainid48-p",
                "issta14main-mainid55-p"
            ]
        },
        {
            "Id": "eesh7Tai8k",
            "Title": "Web Testing",
            "ShortTitle": "Web Testing",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-23 13:30 Web Testing",
            "Day": "2014-07-23",
            "Time": "13:30 - 15:10",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid31-p",
                "issta14main-mainid109-p",
                "issta14main-mainid96-p",
                "issta14main-mainid129-p"
            ]
        },
        {
            "Id": "pai5eige8B",
            "Title": "Artifact Studies",
            "ShortTitle": "Artifact Studies",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-23 15:40 Artifact Studies",
            "Day": "2014-07-23",
            "Time": "15:40 - 16:30",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid79-p",
                "issta14main-mainid38-p"
            ]
        },
        {
            "Id": "Phiekooze4",
            "Title": "Static Analyses and Transformations",
            "ShortTitle": "Static Analyses and Transformations",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-24 10:30 Static Analyses and Transformations",
            "Day": "2014-07-24",
            "Time": "10:30 - 12:10",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid10-p",
                "issta14main-mainid108-p",
                "issta14main-mainid123-p",
                "issta14main-mainid46-p"
            ]
        },
        {
            "Id": "eip2Joh4Au",
            "Title": "Test Selection and Reduction",
            "ShortTitle": "Test Selection and Reduction",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-24 13:30 Test Selection and Reduction",
            "Day": "2014-07-24",
            "Time": "13:30 - 15:10",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid76-p",
                "issta14main-mainid60-p",
                "issta14main-mainid90-p",
                "issta14main-mainid128-p"
            ]
        },
        {
            "Id": "oiNgahd5iw",
            "Title": "Localization and Repair",
            "ShortTitle": "Localization and Repair",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-24 15:40 Localization and Repair",
            "Day": "2014-07-24",
            "Time": "15:40 - 17:20",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid43-p",
                "issta14main-mainid110-p",
                "issta14main-mainid114-p",
                "issta14main-mainid89-p"
            ]
        },
        {
            "Id": "yeihae2Uga",
            "Title": "Security",
            "ShortTitle": "Security",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-25 08:30 Security",
            "Day": "2014-07-25",
            "Time": "08:30 - 10:10",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid101-p",
                "issta14main-mainid69-p"
            ]
        },
        {
            "Id": "Quu9ga2et7",
            "Title": "UI Testing",
            "ShortTitle": "UI Testing",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-25 10:30 UI Testing",
            "Day": "2014-07-25",
            "Time": "10:30 - 12:10",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid52-p",
                "issta14main-mainid5-p",
                "issta14main-mainid71-p",
                "issta14main-mainid107-p"
            ]
        },
        {
            "Id": "Boog5zao6u",
            "Title": "Efficiency and Optimizations",
            "ShortTitle": "Efficiency and Optimizations",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-25 13:30 Efficiency and Optimizations",
            "Day": "2014-07-25",
            "Time": "13:30 - 15:10",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid103-p",
                "issta14main-mainid83-p",
                "issta14main-mainid97-p",
                "issta14main-mainid29-p"
            ]
        },
        {
            "Id": "miisahch7U",
            "Title": "Generation and Propagation",
            "ShortTitle": "Generation and Propagation",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2014-07-25 15:40 Generation and Propagation",
            "Day": "2014-07-25",
            "Time": "15:40 - 17:20",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "ISSTA14MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "issta14main-mainid106-p",
                "issta14main-mainid63-p",
                "issta14main-mainid91-p",
                "issta14main-mainid50-p"
            ]
        }
    ],
    "People": [
        {
            "Name": "Mathieu Acher",
            "Affiliation": "University of Rennes 1, France / INRIA, France",
            "Key": "Mathieu Acher @ University of Rennes 1, France / INRIA, France",
            "Id": "de1aec01d3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alex Aiken",
            "Affiliation": "Stanford University, USA",
            "Key": "Alex Aiken @ Stanford University, USA",
            "Id": "398b80bb9d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mauricio Alférez",
            "Affiliation": "INRIA, France",
            "Key": "Mauricio Alférez @ INRIA, France",
            "Id": "cf978c1bc8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohammad Amin Alipour",
            "Affiliation": "Oregon State University, USA",
            "Key": "Mohammad Amin Alipour @ Oregon State University, USA",
            "Id": "75ecdecfe3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Muath Alkhalaf",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Muath Alkhalaf @ University of California at Santa Barbara, USA",
            "Id": "70904988f9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Simon Allier",
            "Affiliation": "INRIA, France / IRISA, France",
            "Key": "Simon Allier @ INRIA, France / IRISA, France",
            "Id": "56a4471874",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nadia Alshahwan",
            "Affiliation": "University College London, UK",
            "Key": "Nadia Alshahwan @ University College London, UK",
            "Id": "e01c0a7529",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dennis Appelt",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Dennis Appelt @ University of Luxembourg, Luxembourg",
            "Id": "cd4ed7fcec",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stephan Arlt",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Stephan Arlt @ University of Luxembourg, Luxembourg",
            "Id": "4df59b8c50",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Abdulbaki Aydin",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Abdulbaki Aydin @ University of California at Santa Barbara, USA",
            "Id": "11b95003b3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gogul Balakrishnan",
            "Affiliation": "NEC Labs, USA",
            "Key": "Gogul Balakrishnan @ NEC Labs, USA",
            "Id": "273c30d9a7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Benoit Baudry",
            "Affiliation": "INRIA, France",
            "Key": "Benoit Baudry @ INRIA, France",
            "Id": "215c58c589",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Benoit Baudry",
            "Affiliation": "INRIA, France / IRISA, France",
            "Key": "Benoit Baudry @ INRIA, France / IRISA, France",
            "Id": "9e6d6af846",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Benavides",
            "Affiliation": "University of Seville, Spain",
            "Key": "David Benavides @ University of Seville, Spain",
            "Id": "60111febc5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marcel Böhme",
            "Affiliation": "Saarland University, Germany",
            "Key": "Marcel Böhme @ Saarland University, Germany",
            "Id": "cc5738f8cc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lionel C. Briand",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Lionel C. Briand @ University of Luxembourg, Luxembourg",
            "Id": "a7933979fa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nathan Bronson",
            "Affiliation": "Stanford University, USA",
            "Key": "Nathan Bronson @ Stanford University, USA",
            "Id": "fb537e476f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tevfik Bultan",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Tevfik Bultan @ University of California at Santa Barbara, USA",
            "Id": "c3faceff86",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cristian Cadar",
            "Affiliation": "Imperial College London, UK",
            "Key": "Cristian Cadar @ Imperial College London, UK",
            "Id": "931510fe1c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Satish Chandra",
            "Affiliation": "Samsung Research, USA",
            "Key": "Satish Chandra @ Samsung Research, USA",
            "Id": "86435d37f6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhenyu Chen",
            "Affiliation": "Nanjing University, China",
            "Key": "Zhenyu Chen @ Nanjing University, China",
            "Id": "f61c507746",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shing-Chi Cheung",
            "Affiliation": "Hong Kong University of Science and Technology, China",
            "Key": "Shing-Chi Cheung @ Hong Kong University of Science and Technology, China",
            "Id": "520708b6a9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Deepak Chhetri",
            "Affiliation": "NEC, India",
            "Key": "Deepak Chhetri @ NEC, India",
            "Id": "2b19936567",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "James Clause",
            "Affiliation": "University of Delaware, USA",
            "Key": "James Clause @ University of Delaware, USA",
            "Id": "5d38af09dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Domenico Cotroneo",
            "Affiliation": "Federico II University of Naples, Italy",
            "Key": "Domenico Cotroneo @ Federico II University of Naples, Italy",
            "Id": "ed376cedcb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael D. Ernst",
            "Affiliation": "University of Washington, USA",
            "Key": "Michael D. Ernst @ University of Washington, USA",
            "Id": "59f317f35f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Grigory Fedyukovich",
            "Affiliation": "University of Lugano, Switzerland",
            "Key": "Grigory Fedyukovich @ University of Lugano, Switzerland",
            "Id": "4b4572663d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pietro Ferrara",
            "Affiliation": "IBM Research, USA",
            "Key": "Pietro Ferrara @ IBM Research, USA",
            "Id": "95cfc807ce",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gordon Fraser",
            "Affiliation": "University of Sheffield, UK",
            "Key": "Gordon Fraser @ University of Sheffield, UK",
            "Id": "6773c90dc3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "José A. Galindo",
            "Affiliation": "INRIA, France",
            "Key": "José A. Galindo @ INRIA, France",
            "Id": "61a67bb2f3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zebao Gao",
            "Affiliation": "Nanjing University, China / University of Maryland at College Park, USA",
            "Key": "Zebao Gao @ Nanjing University, China / University of Maryland at College Park, USA",
            "Id": "a3fcf6447b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Arnaud Gotlieb",
            "Affiliation": "Simula Research Laboratory, Norway",
            "Key": "Arnaud Gotlieb @ Simula Research Laboratory, Norway",
            "Id": "32616f3ee9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alex Groce",
            "Affiliation": "Oregon State University, USA",
            "Key": "Alex Groce @ Oregon State University, USA",
            "Id": "58e8fb11f0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Thomas R. Gross",
            "Affiliation": "ETH Zurich, Switzerland",
            "Key": "Thomas R. Gross @ ETH Zurich, Switzerland",
            "Id": "44c617db52",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Guy Golan Gueta",
            "Affiliation": "Yahoo Labs, Israel",
            "Key": "Guy Golan Gueta @ Yahoo Labs, Israel",
            "Id": "2cc2aaf3a2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aarti Gupta",
            "Affiliation": "NEC Labs, USA",
            "Key": "Aarti Gupta @ NEC Labs, USA",
            "Id": "2ca97e65e4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "William G. J. Halfond",
            "Affiliation": "University of Southern California, USA",
            "Key": "William G. J. Halfond @ University of Southern California, USA",
            "Id": "a51ce25fff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mark Harman",
            "Affiliation": "University College London, UK",
            "Key": "Mark Harman @ University College London, UK",
            "Id": "bfac79946d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andrew Henderson",
            "Affiliation": "Syracuse University, USA",
            "Key": "Andrew Henderson @ Syracuse University, USA",
            "Id": "29ceb321e2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Petr Hosek",
            "Affiliation": "Imperial College London, UK",
            "Key": "Petr Hosek @ Imperial College London, UK",
            "Id": "30b8a36fe7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xunchao Hu",
            "Affiliation": "Syracuse University, USA",
            "Key": "Xunchao Hu @ Syracuse University, USA",
            "Id": "9d5b0f92d3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Markus Huggler",
            "Affiliation": "ETH Zurich, Switzerland",
            "Key": "Markus Huggler @ ETH Zurich, Switzerland",
            "Id": "f3744ac700",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Antti E. J. Hyvärinen",
            "Affiliation": "University of Lugano, Switzerland",
            "Key": "Antti E. J. Hyvärinen @ University of Lugano, Switzerland",
            "Id": "52067bad72",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Franjo Ivančić",
            "Affiliation": "Google, USA",
            "Key": "Franjo Ivančić @ Google, USA",
            "Id": "c43ff7d6bf",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Darioush Jalali",
            "Affiliation": "University of Washington, USA",
            "Key": "Darioush Jalali @ University of Washington, USA",
            "Id": "387e4478ad",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lingxiao Jiang",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Lingxiao Jiang @ Singapore Management University, Singapore",
            "Id": "ee5e50805e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yuchen Jin",
            "Affiliation": "University of Southern California, USA",
            "Key": "Yuchen Jin @ University of Southern California, USA",
            "Id": "183c2c90ea",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "René Just",
            "Affiliation": "University of Washington, USA",
            "Key": "René Just @ University of Washington, USA",
            "Id": "40764ab090",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Siau-Cheng Khoo",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Siau-Cheng Khoo @ National University of Singapore, Singapore",
            "Id": "b432242119",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sarfraz Khurshid",
            "Affiliation": "University of Texas at Austin, USA",
            "Key": "Sarfraz Khurshid @ University of Texas at Austin, USA",
            "Id": "879b3d768d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gene Kim",
            "Affiliation": "University of Washington, USA",
            "Key": "Gene Kim @ University of Washington, USA",
            "Id": "a3ccb26a6d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sunghun Kim",
            "Affiliation": "Hong Kong University of Science and Technology, China",
            "Key": "Sunghun Kim @ Hong Kong University of Science and Technology, China",
            "Id": "7cb84e284c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "In-Young Ko",
            "Affiliation": "KAIST, South Korea",
            "Key": "In-Young Ko @ KAIST, South Korea",
            "Id": "7bc4bfccd1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sandeep S. Kulkarni",
            "Affiliation": "Michigan State University, USA",
            "Key": "Sandeep S. Kulkarni @ Michigan State University, USA",
            "Id": "6aae9efb6a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Wing Lam",
            "Affiliation": "University of Washington, USA",
            "Key": "Wing Lam @ University of Washington, USA",
            "Id": "e6341d3735",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anna Lanzaro",
            "Affiliation": "Federico II University of Naples, Italy",
            "Key": "Anna Lanzaro @ Federico II University of Naples, Italy",
            "Id": "199e4020ee",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ding Li",
            "Affiliation": "University of Southern California, USA",
            "Key": "Ding Li @ University of Southern California, USA",
            "Id": "b19b2f39c3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yiyan Lin",
            "Affiliation": "Michigan State University, USA",
            "Key": "Yiyan Lin @ Michigan State University, USA",
            "Id": "d32ceb138d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pablo Loyola",
            "Affiliation": "University of Chile, Chile",
            "Key": "Pablo Loyola @ University of Chile, Chile",
            "Id": "090179a3e7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Naoto Maeda",
            "Affiliation": "NEC, Japan",
            "Key": "Naoto Maeda @ NEC, Japan",
            "Id": "33257833d7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Leonardo Mariani",
            "Affiliation": "University of Milano-Bicocca, Italy",
            "Key": "Leonardo Mariani @ University of Milano-Bicocca, Italy",
            "Id": "a6edf463fc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dusica Marijan",
            "Affiliation": "Simula Research Laboratory, Norway",
            "Key": "Dusica Marijan @ Simula Research Laboratory, Norway",
            "Id": "09a818249f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paul Marinescu",
            "Affiliation": "Imperial College London, UK",
            "Key": "Paul Marinescu @ Imperial College London, UK",
            "Id": "0a84f465a6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ali Mesbah",
            "Affiliation": "University of British Columbia, Canada",
            "Key": "Ali Mesbah @ University of British Columbia, Canada",
            "Id": "af25c350f0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Narcisa Andreea Milea",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Narcisa Andreea Milea @ National University of Singapore, Singapore",
            "Id": "81fd03eff4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mehdi Mirzaaghaei",
            "Affiliation": "University of British Columbia, Canada",
            "Key": "Mehdi Mirzaaghaei @ University of British Columbia, Canada",
            "Id": "f892f88eb0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Monperrus",
            "Affiliation": "University of Lille, France / INRIA, France",
            "Key": "Martin Monperrus @ University of Lille, France / INRIA, France",
            "Id": "43f3c5dc2d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ali Muhammad",
            "Affiliation": "VTT Technical Research, Finland",
            "Key": "Ali Muhammad @ VTT Technical Research, Finland",
            "Id": "849299dcf6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kıvanç Muşlu",
            "Affiliation": "University of Washington, USA",
            "Key": "Kıvanç Muşlu @ University of Washington, USA",
            "Id": "d6d2d7a74e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Roberto Natella",
            "Affiliation": "Federico II University of Naples, Italy",
            "Key": "Roberto Natella @ Federico II University of Naples, Italy",
            "Id": "7764944b42",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shiva Nejati",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Shiva Nejati @ University of Luxembourg, Luxembourg",
            "Id": "ec6a1a73c9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cu Duy Nguyen",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Cu Duy Nguyen @ University of Luxembourg, Luxembourg",
            "Id": "d0b9d27558",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Adrian Nistor",
            "Affiliation": "Chapman University, USA",
            "Key": "Adrian Nistor @ Chapman University, USA",
            "Id": "60fa126cac",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Notkin",
            "Affiliation": "University of Washington, USA",
            "Key": "David Notkin @ University of Washington, USA",
            "Id": "95b12c88b5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alessandro Orso",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Alessandro Orso @ Georgia Tech, USA",
            "Id": "8d64bd1adf",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fabrizio Pastore",
            "Affiliation": "University of Milano-Bicocca, Italy",
            "Key": "Fabrizio Pastore @ University of Milano-Bicocca, Italy",
            "Id": "4ebecf7c2a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Suzette Person",
            "Affiliation": "NASA Langley Research Center, USA",
            "Key": "Suzette Person @ NASA Langley Research Center, USA",
            "Id": "427c1cb229",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mauro Pezzè",
            "Affiliation": "University of Lugano, Switzerland / University of Milano-Bicocca, Italy",
            "Key": "Mauro Pezzè @ University of Lugano, Switzerland / University of Milano-Bicocca, Italy",
            "Id": "8579c3da53",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marco Pistoia",
            "Affiliation": "IBM Research, USA",
            "Key": "Marco Pistoia @ IBM Research, USA",
            "Id": "0d0bf12679",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andreas Podelski",
            "Affiliation": "University of Freiburg, Germany",
            "Key": "Andreas Podelski @ University of Freiburg, Germany",
            "Id": "f0348eceee",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Pradel",
            "Affiliation": "University of California at Berkeley, USA",
            "Key": "Michael Pradel @ University of California at Berkeley, USA",
            "Id": "be5d677627",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aravind Prakash",
            "Affiliation": "Syracuse University, USA",
            "Key": "Aravind Prakash @ Syracuse University, USA",
            "Id": "a578b417c1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mukul R. Prasad",
            "Affiliation": "Fujitsu Labs, USA",
            "Key": "Mukul R. Prasad @ Fujitsu Labs, USA",
            "Id": "3c1dd3a4c8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lenin Ravindranath",
            "Affiliation": "Massachusetts Institute of Technology, USA",
            "Key": "Lenin Ravindranath @ Massachusetts Institute of Technology, USA",
            "Id": "9364755394",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Oliviero Riganelli",
            "Affiliation": "University of Milano-Bicocca, Italy",
            "Key": "Oliviero Riganelli @ University of Milano-Bicocca, Italy",
            "Id": "fe11054c94",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gregg Rothermel",
            "Affiliation": "University of Nebraska-Lincoln, USA",
            "Key": "Gregg Rothermel @ University of Nebraska-Lincoln, USA",
            "Id": "1a6579005f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shauvik Roy Choudhary",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Shauvik Roy Choudhary @ Georgia Tech, USA",
            "Id": "58e43be877",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Abhik Roychoudhury",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Abhik Roychoudhury @ National University of Singapore, Singapore",
            "Id": "7273cb3f19",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Neha Rungta",
            "Affiliation": "NASA Ames Research Center, USA",
            "Key": "Neha Rungta @ NASA Ames Research Center, USA",
            "Id": "1d9fbfa26b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mooly Sagiv",
            "Affiliation": "Tel Aviv University, Israel",
            "Key": "Mooly Sagiv @ Tel Aviv University, Israel",
            "Id": "32623c4016",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cagri Sahin",
            "Affiliation": "University of Delaware, USA",
            "Key": "Cagri Sahin @ University of Delaware, USA",
            "Id": "ba6bf8c5ac",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mauro Santoro",
            "Affiliation": "University of Milano-Bicocca, Italy",
            "Key": "Mauro Santoro @ University of Milano-Bicocca, Italy",
            "Id": "42d5b0f37a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stephan Sehestedt",
            "Affiliation": "ABB Research, Germany",
            "Key": "Stephan Sehestedt @ ABB Research, Germany",
            "Id": "03e5f22e8d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ohad Shacham",
            "Affiliation": "Yahoo Labs, Israel",
            "Key": "Ohad Shacham @ Yahoo Labs, Israel",
            "Id": "e5d106362e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Natasha Sharygina",
            "Affiliation": "University of Lugano, Switzerland",
            "Key": "Natasha Sharygina @ University of Lugano, Switzerland",
            "Id": "23cedd322b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Saurabh Sinha",
            "Affiliation": "IBM Research, India",
            "Key": "Saurabh Sinha @ IBM Research, India",
            "Id": "dc564d16ad",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Siwakorn Srisakaokul",
            "Affiliation": "University of Washington, USA",
            "Key": "Siwakorn Srisakaokul @ University of Washington, USA",
            "Id": "e854b1820a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Matt Staats",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Matt Staats @ University of Luxembourg, Luxembourg",
            "Id": "8ca35acce5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chengnian Sun",
            "Affiliation": "University of California at Davis, USA",
            "Key": "Chengnian Sun @ University of California at Davis, USA",
            "Id": "674e810eda",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Neeraj Suri",
            "Affiliation": "TU Darmstadt, Germany",
            "Key": "Neeraj Suri @ TU Darmstadt, Germany",
            "Id": "eb54fcf367",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Suresh Thummalapenta",
            "Affiliation": "Microsoft, USA",
            "Key": "Suresh Thummalapenta @ Microsoft, USA",
            "Id": "eaef2f4d63",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Omer Tripp",
            "Affiliation": "IBM Research, USA",
            "Key": "Omer Tripp @ IBM Research, USA",
            "Id": "0a12a0119e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Vechev",
            "Affiliation": "ETH Zurich, Switzerland",
            "Key": "Martin Vechev @ ETH Zurich, Switzerland",
            "Id": "34f4227aeb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chao Wang",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Chao Wang @ Virginia Tech, USA",
            "Id": "13bfb1daa3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xujiewen Wang",
            "Affiliation": "Syracuse University, USA",
            "Key": "Xujiewen Wang @ Syracuse University, USA",
            "Id": "00f99d91e5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Wehrle",
            "Affiliation": "University of Basel, Switzerland",
            "Key": "Martin Wehrle @ University of Basel, Switzerland",
            "Id": "25f0679329",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Konstantin Weitz",
            "Affiliation": "University of Washington, USA",
            "Key": "Konstantin Weitz @ University of Washington, USA",
            "Id": "da6c0e1db4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stefan Winter",
            "Affiliation": "TU Darmstadt, Germany",
            "Key": "Stefan Winter @ TU Darmstadt, Germany",
            "Id": "08f4ea7510",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rongxin Wu",
            "Affiliation": "Hong Kong University of Science and Technology, China",
            "Key": "Rongxin Wu @ Hong Kong University of Science and Technology, China",
            "Id": "a6cec47ce5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jochen Wuttke",
            "Affiliation": "University of Washington, USA",
            "Key": "Jochen Wuttke @ University of Washington, USA",
            "Id": "9b8453a2ec",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xusheng Xiao",
            "Affiliation": "NEC Labs, USA / North Carolina State University, USA",
            "Key": "Xusheng Xiao @ NEC Labs, USA / North Carolina State University, USA",
            "Id": "1f554342f0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eran Yahav",
            "Affiliation": "Technion, Israel",
            "Key": "Eran Yahav @ Technion, Israel",
            "Id": "17940ed9ef",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lok Kwong Yan",
            "Affiliation": "Rome Laboratory, USA",
            "Key": "Lok Kwong Yan @ Rome Laboratory, USA",
            "Id": "2c5dadac5d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rahulkrishna Yandrapally",
            "Affiliation": "IBM Research, India",
            "Key": "Rahulkrishna Yandrapally @ IBM Research, India",
            "Id": "714b9e96f5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Guowei Yang",
            "Affiliation": "Texas State University, USA",
            "Key": "Guowei Yang @ Texas State University, USA",
            "Id": "a6f649f037",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Heng Yin",
            "Affiliation": "Syracuse University, USA",
            "Key": "Heng Yin @ Syracuse University, USA",
            "Id": "083aa1e4d8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Benwen Zhang",
            "Affiliation": "University of Delaware, USA",
            "Key": "Benwen Zhang @ University of Delaware, USA",
            "Id": "6be178b7f0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chaoqiang Zhang",
            "Affiliation": "Oregon State University, USA",
            "Key": "Chaoqiang Zhang @ Oregon State University, USA",
            "Id": "098caf42ec",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hongyu Zhang",
            "Affiliation": "Microsoft Research, China",
            "Key": "Hongyu Zhang @ Microsoft Research, China",
            "Id": "62b2321fd4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lingming Zhang",
            "Affiliation": "University of Texas at Austin, USA",
            "Key": "Lingming Zhang @ University of Texas at Austin, USA",
            "Id": "733b9fe34e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lu Zhang",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Lu Zhang @ Virginia Tech, USA",
            "Id": "531569a0dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sai Zhang",
            "Affiliation": "University of Washington, USA",
            "Key": "Sai Zhang @ University of Washington, USA",
            "Id": "b9bea4c576",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xiangyu Zhang",
            "Affiliation": "Purdue University, USA",
            "Key": "Xiangyu Zhang @ Purdue University, USA",
            "Id": "8e3ec59fd4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yunhui Zheng",
            "Affiliation": "Purdue University, USA",
            "Key": "Yunhui Zheng @ Purdue University, USA",
            "Id": "3cdf66c309",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rundong Zhou",
            "Affiliation": "Syracuse University, USA",
            "Key": "Rundong Zhou @ Syracuse University, USA",
            "Id": "1ff3479109",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yunxiao Zou",
            "Affiliation": "Nanjing University, China / Purdue University, USA",
            "Key": "Yunxiao Zou @ Nanjing University, China / Purdue University, USA",
            "Id": "31fcedc012",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhiqiang Zuo",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Zhiqiang Zuo @ National University of Singapore, Singapore",
            "Id": "8c34ab35c2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        }
    ]
}
 

