{
    "DataRevision": 1423355119,
    "Preliminary": "false",
    "Event": "SANER 2015",
    "Name": "SANER 2015",
    "Description": "",
    "Date": "March 2-6, 2015",
    "DateStart": "2015-03-02",
    "DateEnd": "2015-03-06",
    "Location": "Montréal, Canada",
    "Sponsors": "",
    "URL": "http://saner.soccerlab.polymtl.ca/",
    "MultiTrack": "false",
    "UseMiniPage": "true",
    "NewPagePerDay": "false",
    "NumOfParallelTracks": 1,
    "Organization": {
        "General Chairs": [
                "Yann-Gaël Guéhéneuc"
        ],
        "PC Chairs": [
                "Bram Adams",
                "Alexander Serebrenik"
        ]
    },
    "SocialFeeds": [
    ],
    "VenueInfo": {
        "Name": "",
        "GPS": {
            "Latitude": 0,
            "Longitude": 0
        }
    },
    "InfoPage": {
        "xaml": "foo",
        "Elements": [
            {
                "XamlName": "ConferenceCenterMap",
                "Type": "Map",
                "GPS": {
                    "Latitude": 0,
                    "Longitude": 0
                },
                "MapLabel": ""
            },
            {
                "XamlName": "LicenseButton",
                "Type": "WebLink",
                "URL": "http://research.microsoft.com/en-US/projects/confapp/terms.aspx"
            },
            {
                "XamlName": "PrivacyButton",
                "Type": "WebLink",
                "URL": "http://privacy.microsoft.com/en-us/default.msp"
            }
        ]
    },
    "SessionPriorities": [
        "Award",
        "Invited Talk",
        "Other"
    ],
    "Items": [
        {
            "Title": "Message from the Chairs",
            "Type": "Frontmatter",
            "Key": "saner15foreword-fm001-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYann-Ga%C3%ABl+Gu%C3%A9h%C3%A9neuc%2C+Bram+Adams%2C+and+Alexander+Serebrenik+%22Message+from+the+Chairs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Yann-Gaël Guéhéneuc, Bram Adams, and Alexander Serebrenik",
            "AffiliationsString": "",
            "Authors": [
                "Yann-Gaël Guéhéneuc @",
                "Bram Adams @",
                "Alexander Serebrenik @"
            ],
            "Affiliations": [
                "",
                "",
                ""
            ],
            "Abstract": "",
            "Award": ""
        },
        {
            "Title": "Modeling the Evolution of Development Topics using Dynamic Topic Models",
            "Type": "Research Track",
            "Key": "saner15main-mainid41-p",
            "URL": "http%3A%2F%2Fwww.risame.net%2Fsun%2Fsaner2015.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jiajun Hu, Xiaobing Sun, David Lo, and Bin Li",
            "AffiliationsString": "Yangzhou University, China; Nanjing University, China; Singapore Management University, Singapore",
            "Authors": [
                "Jiajun Hu @ Yangzhou University, China",
                "Xiaobing Sun @ Yangzhou University, China / Nanjing University, China",
                "David Lo @ Singapore Management University, Singapore",
                "Bin Li @ Yangzhou University, China / Nanjing University, China"
            ],
            "Affiliations": [
                "Yangzhou University, China",
                "Yangzhou University, China / Nanjing University, China",
                "Singapore Management University, Singapore",
                "Yangzhou University, China / Nanjing University, China"
            ],
            "Abstract": "As the development of a software project progresses, its complexity grows accordingly, making it difficult to understand and maintain. During software maintenance and evolution, software developers and stakeholders constantly shift their focus between different tasks and topics. They need to investigate into software repositories (e.g., revision control systems) to know what tasks have recently been worked on and how much effort has been devoted to them. For example, if an important new feature request is received, an amount of work that developers perform on ought to be relevant to the addition of the incoming feature. If this does not happen, project managers might wonder what kind of work developers are currently working on. Several topic analysis tools based on Latent Dirichlet Allocation (LDA) have been proposed to analyze information stored in software repositories to model software evolution, thus helping software stakeholders to be aware of the focus of development efforts at various time during software evolution. Previous LDAbased topic analysis tools can capture either changes on the strengths of various development topics over time (i.e., strength evolution) or changes in the content of existing topics over time (i.e., content evolution). Unfortunately, none of the existing techniques can capture both strength and content evolution. In this paper, we use Dynamic Topic Models (DTM) to analyze commit messages within a project’s lifetime to capture both strength and content evolution simultaneously. We evaluate our approach by conducting a case study on commit messages of two well-known open source software systems, jEdit and PostgreSQL. The results show that our approach could capture not only how the strengths of various development topics change over time, but also how the content of each topic (i.e., words that form the topic) changes over time. Compared with existing topic analysis approaches, our approach can provide a more complete and valuable view of software evolution to help developers better understand the evolution of their projects.",
            "Award": ""
        },
        {
            "Title": "Understanding Developers&#039; Natural Language Queries with Interactive Clarification",
            "Type": "Research Track",
            "Key": "saner15main-mainid71-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DShihai+Jiang%2C+Liwei+Shen%2C+Xin+Peng%2C+Zhaojin+Lv%2C+and+Wenyun+Zhao+%22Understanding+Developers%27+Natural+Language+Queries+with+Interactive+Clarification%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Shihai Jiang, Liwei Shen, Xin Peng, Zhaojin Lv, and Wenyun Zhao",
            "AffiliationsString": "Fudan University, China",
            "Authors": [
                "Shihai Jiang @ Fudan University, China",
                "Liwei Shen @ Fudan University, China",
                "Xin Peng @ Fudan University, China",
                "Zhaojin Lv @ Fudan University, China",
                "Wenyun Zhao @ Fudan University, China"
            ],
            "Affiliations": [
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China"
            ],
            "Abstract": "When performing software maintenance tasks, developers often need to understand a series of background knowledge based on information distributed in different software repositories such as source codes, version control systems and bug tracking systems. An effective way to support developers to understand such knowledge is to provide an integrated knowledge base and allow them to ask questions using natural language. Existing approaches cannot well support natural language questions that involve a series of conceptual relationships and are phrased in a flexible way. In this paper, we propose an interactive approach for understanding developers&#039; natural language queries. The approach can understand a developer&#039;s natural language questions phrased in different ways by generating a set of ranked and human-readable candidate questions and getting feedback from the developer. Based on the candidate question confirmed by the developer, the approach can then synthesize an answer by constructing and executing a structural query to the knowledge base. We have implemented a tool following the proposed approach and conducted a user study using the tool. The results show that our approach can help developers get the desired answers more easily and accurately.",
            "Award": ""
        },
        {
            "Title": "Mining Multi-level API Usage Patterns",
            "Type": "Research Track",
            "Key": "saner15main-mainid126-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMohamed+Aymen+Saied%2C+Omar+Benomar%2C+Hani+Abdeen%2C+and+Houari+Sahraoui+%22Mining+Multi-level+API+Usage+Patterns%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mohamed Aymen Saied, Omar Benomar, Hani Abdeen, and Houari Sahraoui",
            "AffiliationsString": "Université de Montréal, Canada",
            "Authors": [
                "Mohamed Aymen Saied @ Université de Montréal, Canada",
                "Omar Benomar @ Université de Montréal, Canada",
                "Hani Abdeen @ Université de Montréal, Canada",
                "Houari Sahraoui @ Université de Montréal, Canada"
            ],
            "Affiliations": [
                "Université de Montréal, Canada",
                "Université de Montréal, Canada",
                "Université de Montréal, Canada",
                "Université de Montréal, Canada"
            ],
            "Abstract": "Software developers need to cope with complexity of Application Programming Interfaces (APIs) of external libraries or frameworks. However, typical APIs provide several thousands of methods to their client programs, and such large APIs are difficult to learn and use. An API method is generally used within client programs along with other methods of the API of interest. Despite this, co-usage relationships between API methods are often not documented. We propose a technique for mining Multi-Level API Usage Patterns (MLUP) to exhibit the co-usage relationships between methods of the API of interest across interfering usage scenarios. We detect multi-level usage patterns as distinct groups of API methods, where each group is uniformly used across variable client programs, independently of usage contexts. We evaluated our technique through the usage of four APIs having up to 22 client programs per API. For all the studied APIs, our technique was able to detect usage patterns that are, almost all, highly consistent and highly cohesive across a considerable variability of client programs.",
            "Award": ""
        },
        {
            "Title": "An Observational Study on API Usage Constraints and Their Documentation",
            "Type": "Research Track",
            "Key": "saner15main-mainid127-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMohamed+Aymen+Saied%2C+Houari+Sahraoui%2C+and+Bruno+Dufour+%22An+Observational+Study+on+API+Usage+Constraints+and+Their+Documentation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mohamed Aymen Saied, Houari Sahraoui, and Bruno Dufour",
            "AffiliationsString": "Université de Montréal, Canada",
            "Authors": [
                "Mohamed Aymen Saied @ Université de Montréal, Canada",
                "Houari Sahraoui @ Université de Montréal, Canada",
                "Bruno Dufour @ Université de Montréal, Canada"
            ],
            "Affiliations": [
                "Université de Montréal, Canada",
                "Université de Montréal, Canada",
                "Université de Montréal, Canada"
            ],
            "Abstract": "Nowadays, APIs represent the most common reuse form when developing software. However, the reuse benefits depend greatly on the ability of client application developers to use correctly the APIs. In this paper, we present an observational study on the API usage constraints and their documentation. To conduct the study on a large number of APIs, we implemented and validated strategies to automatically detect four types of usage constraints in existing APIs. We observed that some of the constraint types are frequent and that for three types, they are not documented in general. Surprisingly, the absence of documentation is, in general, specific to the constraints and not due to the non documenting habits of developers.",
            "Award": ""
        },
        {
            "Title": "Improving Pattern Tracking with a Language-Aware Tree Differencing Algorithm",
            "Type": "Research Track",
            "Key": "saner15main-mainid49-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DNicolas+Palix%2C+Jean-R%C3%A9my+Falleri%2C+and+Julia+Lawall+%22Improving+Pattern+Tracking+with+a+Language-Aware+Tree+Differencing+Algorithm%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Nicolas Palix, Jean-Rémy Falleri, and Julia Lawall",
            "AffiliationsString": "University of Grenoble, France; LaBRI, France; University of Bordeaux, France; INRIA, France",
            "Authors": [
                "Nicolas Palix @ University of Grenoble, France",
                "Jean-Rémy Falleri @ LaBRI, France / University of Bordeaux, France",
                "Julia Lawall @ INRIA, France"
            ],
            "Affiliations": [
                "University of Grenoble, France",
                "LaBRI, France / University of Bordeaux, France",
                "INRIA, France"
            ],
            "Abstract": "Tracking code fragments of interest is important in monitoring a software project over multiple versions. Various approaches, including our previous work on Herodotos, exploit the notion of Longest Common Subsequence, as computed by readily available tools such as GNU Diff, to map corresponding code fragments. Nevertheless, the efficient code differencing algorithms are typically line-based or word-based, and thus do not report changes at the level of language constructs. Furthermore, they identify only additions and removals, but not the moving of a block of code from one part of a file to another. Code fragments of interest that fall within the added and removed regions of code have to be manually correlated across versions, which is tedious and error-prone. When studying a very large code base over a long time, the number of manual correlations can become an obstacle to the success of a study. In this paper, we investigate the effect of replacing the current line-based algorithm used by Herodotos by tree-matching, as provided by the algorithm of the differencing tool GumTree. In contrast to the line-based approach, the tree-based approach does not generate any manual correlations, but it incurs a high execution time. To address the problem, we propose a hybrid strategy that gives the best of both approaches.",
            "Award": ""
        },
        {
            "Title": "Measuring the Quality of Design Pattern Detection Results",
            "Type": "Research Track",
            "Key": "saner15main-mainid104-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DShouzheng+Yang%2C+Ayesha+Manzer%2C+and+Vassilios+Tzerpos+%22Measuring+the+Quality+of+Design+Pattern+Detection+Results%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Shouzheng Yang, Ayesha Manzer, and Vassilios Tzerpos",
            "AffiliationsString": "York University, Canada",
            "Authors": [
                "Shouzheng Yang @ York University, Canada",
                "Ayesha Manzer @ York University, Canada",
                "Vassilios Tzerpos @ York University, Canada"
            ],
            "Affiliations": [
                "York University, Canada",
                "York University, Canada",
                "York University, Canada"
            ],
            "Abstract": "Detecting design patterns in large software systems is a common reverse engineering task that can help the comprehension process of the system&#039;s design. While several design pattern detection tools presented in the literature are capable of detecting design patterns automatically, evaluating these detection results is usually done in a manual and subjective fashion. Differences in design pattern definitions, as well as pattern instance counting and presenting, exacerbate the difficulty of evaluating design pattern detection results. In this paper, we present a novel approach to evaluating and comparing design pattern detection results. Our approach, called MoRe, introduces a novel way to present design pattern instances in a uniform fashion. Based on this characterization of design pattern instances, we propose four measures for design pattern detection evaluation that convey a concise assessment of the quality of the results produced by a given detection method. We have implemented these measures, and present case studies that showcase their usefulness.",
            "Award": ""
        },
        {
            "Title": "Are PHP Applications Ready for Hack?",
            "Type": "Research Track",
            "Key": "saner15main-mainid101-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLaleh+Eshkevari%2C+Fabien+Dos+Santos%2C+James+R.+Cordy%2C+and+Giuliano+Antoniol+%22Are+PHP+Applications+Ready+for+Hack%3F%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Laleh Eshkevari, Fabien Dos Santos, James R. Cordy, and Giuliano Antoniol",
            "AffiliationsString": "Polytechnique Montréal, Canada; Polytech Montpellier, France; Queen's University, Canada",
            "Authors": [
                "Laleh Eshkevari @ Polytechnique Montréal, Canada",
                "Fabien Dos Santos @ Polytech Montpellier, France",
                "James R. Cordy @ Queen's University, Canada",
                "Giuliano Antoniol @ Polytechnique Montréal, Canada"
            ],
            "Affiliations": [
                "Polytechnique Montréal, Canada",
                "Polytech Montpellier, France",
                "Queen's University, Canada",
                "Polytechnique Montréal, Canada"
            ],
            "Abstract": "PHP is by far the most popular WEB scripting language, accounting for more than 80% of existing websites. PHP is dynamically typed, which means that variables take on the type of the objects that they are assigned, and may change type as execution proceeds. While some type changes are likely not harmful, others involving function calls and global variables may be more difficult to understand and the source of many bugs. Hack, a new PHP variant endorsed by Facebook, attempts to address this problem by adding static typing to PHP variables, which limits them to a single consistent type throughout execution. This paper defines an empirical taxonomy of PHP type changes along three dimensions: the complexity or burden imposed to understand the type change; whether or not the change is potentially harmful; and the actual types changed. We apply static and dynamic analyses to three widely used WEB applications coded in PHP (WordPress, Drupal and phpBB) to investigate (1) to what extent developers really use dynamic typing, (2) what kinds of type changes are actually encountered; and (3) how difficult it might be to refactor the code to avoid type changes, and thus meet the constraints of Hack&#039;s static typing. We report evidence that dynamic typing is actually a relatively uncommon practice in production PHP programs, and that most dynamic type changes are simple representational changes, such as between strings and integers. We observe that most PHP type changes in these programs are relatively simple, and that the largest proportion of them are easy to refactor to consistent static typing using simple local renaming transformations. Overall, the paper casts doubt on the usefulness of dynamic typing in PHP, and indicates that for many production applications, conversion to Hack&#039;s static typing may not be very difficult.",
            "Award": ""
        },
        {
            "Title": "Does JavaScript Software Embrace Classes?",
            "Type": "Research Track",
            "Key": "saner15main-mainid117-p",
            "URL": "http%3A%2F%2Fhomepages.dcc.ufmg.br%2F%7Emtov%2Fpub%2F2015_saner.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Faserg.labsoft.dcc.ufmg.br%2FJSClasses",
            "DOI": "",
            "PersonsString": "Leonardo Humberto Silva, Miguel Ramos, Marco Tulio Valente, Alexandre Bergel, and Nicolas Anquetil",
            "AffiliationsString": "Federal Institute of Northern Minas Gerais, Brazil; Federal University of Minas Gerais, Brazil; University of Chile, Chile; INRIA, France",
            "Authors": [
                "Leonardo Humberto Silva @ Federal Institute of Northern Minas Gerais, Brazil",
                "Miguel Ramos @ Federal University of Minas Gerais, Brazil",
                "Marco Tulio Valente @ Federal University of Minas Gerais, Brazil",
                "Alexandre Bergel @ University of Chile, Chile",
                "Nicolas Anquetil @ INRIA, France"
            ],
            "Affiliations": [
                "Federal Institute of Northern Minas Gerais, Brazil",
                "Federal University of Minas Gerais, Brazil",
                "Federal University of Minas Gerais, Brazil",
                "University of Chile, Chile",
                "INRIA, France"
            ],
            "Abstract": "JavaScript is the de facto programming language for the Web. It is used to implement mail clients, office applications, or IDEs, that can weight hundreds of thousands of lines of code. The language itself is prototype based, but to master the complexity of their application, practitioners commonly rely on informal class abstractions. This practice has never been the target of empirical research in JavaScript. Yet, understanding it is key to adequately tuning programming environments and structure libraries such that they are accessible to programmers. In this paper we report on a large and in-depth study to understand how class emulation is employed in JavaScript applications. We propose a strategy to statically detect class-based abstractions in the source code of JavaScript systems. We used this strategy in a dataset of 50 popular JavaScript applications available from GitHub. We found four types of JavaScript software: class-free (systems that do not make any usage of classes), class-aware (systems that use classes, but marginally), class-friendly (systems that make a relevant usage of classes), and class-oriented (systems that have most of their data structures implemented as classes). The systems in these categories represent, respectively, 26%, 36%, 30%, and 8% of the systems we studied.",
            "Award": ""
        },
        {
            "Title": "Evolution Analysis for Accessibility Excessiveness in Java",
            "Type": "Research Track",
            "Key": "saner15main-mainid13-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKazuo+Kobori%2C+Makoto+Matsushita%2C+and+Katsuro+Inoue+%22Evolution+Analysis+for+Accessibility+Excessiveness+in+Java%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Kazuo Kobori, Makoto Matsushita, and Katsuro Inoue",
            "AffiliationsString": "NTT DATA, Japan; Osaka University, Japan",
            "Authors": [
                "Kazuo Kobori @ NTT DATA, Japan",
                "Makoto Matsushita @ Osaka University, Japan",
                "Katsuro Inoue @ Osaka University, Japan"
            ],
            "Affiliations": [
                "NTT DATA, Japan",
                "Osaka University, Japan",
                "Osaka University, Japan"
            ],
            "Abstract": "In Java programs, access modifiers are used to control the accessibility of fields and methods from other objects. Choosing appropriate access modifiers is one of the key factors to improve program quality and to reduce potential vulnerability. In our previous work, we presented a static analysis method named Accessibility Excessiveness (AE) detection for each field and method in Java program. We have also developed an AE analysis tool named ModiChecker that analyzes each field and method of the input Java programs, and reports their excessiveness. In this paper, we have applied ModiChecker to several OSS repositories to investigate the evolution of AE over versions, and identified transition of AE status and the difference in the amount of AE change between major version releases and minor ones. Also we propose when to evaluate source code with AE analysis.",
            "Award": ""
        },
        {
            "Title": "A Software Quality Model for RPG",
            "Type": "Research Track",
            "Key": "saner15main-mainid96-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DGergely+Lad%C3%A1nyi%2C+Zolt%C3%A1n+T%C3%B3th%2C+Rudolf+Ferenc%2C+and+Tibor+Keresztesi+%22A+Software+Quality+Model+for+RPG%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Gergely Ladányi, Zoltán Tóth, Rudolf Ferenc, and Tibor Keresztesi",
            "AffiliationsString": "University of Szeged, Hungary; R&R Software, Hungary",
            "Authors": [
                "Gergely Ladányi @ University of Szeged, Hungary",
                "Zoltán Tóth @ University of Szeged, Hungary",
                "Rudolf Ferenc @ University of Szeged, Hungary",
                "Tibor Keresztesi @ R&R Software, Hungary"
            ],
            "Affiliations": [
                "University of Szeged, Hungary",
                "University of Szeged, Hungary",
                "University of Szeged, Hungary",
                "R&R Software, Hungary"
            ],
            "Abstract": "The IBM i mainframe was designed to manage business applications for which the reliability and quality is a matter of national security. The RPG programming language is the most frequently used one on this platform. The maintainability of the source code has big influence on the development costs, probably this is the reason why it is one of the most attractive, observed and evaluated quality characteristic of all. For improving or at least preserving the maintainability level of software it is necessary to evaluate it regularly. In this study we present a quality model based on the ISO/IEC 25010 international standard for evaluating the maintainability of software systems written in RPG. As an evaluation step of the quality model we show a case study in which we explain how we integrated the quality model as a continuous quality monitoring tool into the business processes of a mid-size software company which has more than twenty years of experience in developing RPG applications.",
            "Award": ""
        },
        {
            "Title": "JCHARMING: A Bug Reproduction Approach using Crash Traces and Directed Model Checking",
            "Type": "Research Track",
            "Key": "saner15main-mainid178-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMathieu+Nayrolles%2C+Abdelwahab+Hamou-Lhadj%2C+Sofi%C3%A8ne+Tahar%2C+and+Alf+Larsson+%22JCHARMING%3A+A+Bug+Reproduction+Approach+using+Crash+Traces+and+Directed+Model+Checking%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mathieu Nayrolles, Abdelwahab Hamou-Lhadj, Sofiène Tahar, and Alf Larsson",
            "AffiliationsString": "Concordia University, Canada; Ericsson, Sweden",
            "Authors": [
                "Mathieu Nayrolles @ Concordia University, Canada",
                "Abdelwahab Hamou-Lhadj @ Concordia University, Canada",
                "Sofiène Tahar @ Concordia University, Canada",
                "Alf Larsson @ Ericsson, Sweden"
            ],
            "Affiliations": [
                "Concordia University, Canada",
                "Concordia University, Canada",
                "Concordia University, Canada",
                "Ericsson, Sweden"
            ],
            "Abstract": "Due to their inherent complexity, software systems are pledged to be released with bugs. These bugs manifest themselves on client&#039;s computers, causing crashes and undesired behaviors. Field crashes, in particular, are challenging to understand and fix as the information provided by the impacted customers are often scarce and inaccurate. To address this issue, there is a need to find ways for automatically reproducing the crash in a lab environment in order to fully understand its root causes. Crash reproduction is also an important step towards developing adequate patches. In this paper, we propose a novel crash reproduction approach, called JCHARMING (Java CrasH Automatic Reproduction by directed Model checkING). JCHARMING uses crash traces and model checking to identify program statements needed to reproduce a crash. Our approach takes advantage of the completeness provided by model checking while ignoring unneeded system states by means of information found in crash traces combined with static slices. We show the effectiveness of JCHARMING by applying it to seven different open source programs cumulating more than one million lines of code scattered in around 7000 classes. Overall, JCHARMING was able to reproduce 85% of the submitted bugs.",
            "Award": ""
        },
        {
            "Title": "Towards a Common Metamodel for Traces of High Performance Computing Systems to Enable Software Analysis Tasks",
            "Type": "Research Track",
            "Key": "saner15main-mainid125-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLuay+Alawneh%2C+Abdelwahab+Hamou-Lhadj%2C+and+Jameleddine+Hassine+%22Towards+a+Common+Metamodel+for+Traces+of+High+Performance+Computing+Systems+to+Enable+Software+Analysis+Tasks%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Luay Alawneh, Abdelwahab Hamou-Lhadj, and Jameleddine Hassine",
            "AffiliationsString": "Jordan University of Science and Technology, Jordan; Concordia University, Canada; KFUPM, Saudi Arabia",
            "Authors": [
                "Luay Alawneh @ Jordan University of Science and Technology, Jordan",
                "Abdelwahab Hamou-Lhadj @ Concordia University, Canada",
                "Jameleddine Hassine @ KFUPM, Saudi Arabia"
            ],
            "Affiliations": [
                "Jordan University of Science and Technology, Jordan",
                "Concordia University, Canada",
                "KFUPM, Saudi Arabia"
            ],
            "Abstract": "There exist several tools for analyzing traces generated from HPC (High Performance Computing) applications, used by software engineers for debugging and other maintenance tasks. These tools, however, use different formats to represent HPC traces, which hinders interoperability and data exchange. At the present time, there is no standard metamodel that represents HPC trace concepts and their relations. In this paper, we argue that the lack of a common metamodel is a serious impediment for effective analysis for this class of software systems. We aim to fill this void by presenting MTF2 (MPI Trace Format2)—a metamodel for representing HPC system traces. MTF2 is built with expressiveness and scalability in mind. Scalability, an important requirement when working with large traces, is achieved by adopting graph theory concepts to compact large traces. We show through a case study that a trace represented in MTF2 can be in average 49% smaller than a trace represented in a format that does not consider compaction.",
            "Award": ""
        },
        {
            "Title": "Automated Extraction of Failure Reproduction Steps from User Interaction Traces",
            "Type": "Research Track",
            "Key": "saner15main-mainid25-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTobias+Roehm%2C+Stefan+Nosovic%2C+and+Bernd+Bruegge+%22Automated+Extraction+of+Failure+Reproduction+Steps+from+User+Interaction+Traces%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tobias Roehm, Stefan Nosovic, and Bernd Bruegge",
            "AffiliationsString": "TU München, Germany",
            "Authors": [
                "Tobias Roehm @ TU München, Germany",
                "Stefan Nosovic @ TU München, Germany",
                "Bernd Bruegge @ TU München, Germany"
            ],
            "Affiliations": [
                "TU München, Germany",
                "TU München, Germany",
                "TU München, Germany"
            ],
            "Abstract": "Bug reports submitted by users and crash reports collected by crash reporting tools often lack information about reproduction steps, i.e. the steps necessary to reproduce a failure. Hence, developers have difficulties to reproduce field failures and might not be able to fix all reported bugs. We present an approach to automatically extract failure reproduction steps from user interaction traces. We capture interactions between a user and a WIMP GUI using a capture/replay tool. Then, we extract the minimal, failure-inducing subsequence of captured interaction traces. We use three algorithms to perform this extraction: Delta Debugging, Sequential Pattern Mining, and a combination of both. Delta Debugging automatically replays subsequences of an interaction trace to identify the minimal, failure-inducing subsequence. Sequential Pattern Mining identifies the common subsequence in interaction traces inducing the same failure. We evaluated our approach in a case study. We injected four bugs to the code of a mail client application, collected interaction traces of five participants trying to find these bugs, and applied the extraction algorithms. Delta Debugging extracted the minimal, failure-inducing interaction subsequence in 90% of all cases. Sequential Pattern Mining produced failure-inducing interaction sequences in 75% of all cases and removed on average 93% of unnecessary interactions, potentially enabling manual analysis by developers. Both algorithms complement each other because they are applicable in different contexts and can be combined to improve performance.",
            "Award": ""
        },
        {
            "Title": "Misery Loves Company: CrowdStacking Traces to Aid Problem Detection",
            "Type": "Research Track",
            "Key": "saner15main-mainid142-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTommaso+Dal+Sasso%2C+Andrea+Mocci%2C+and+Michele+Lanza+%22Misery+Loves+Company%3A+CrowdStacking+Traces+to+Aid+Problem+Detection%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tommaso Dal Sasso, Andrea Mocci, and Michele Lanza",
            "AffiliationsString": "University of Lugano, Switzerland",
            "Authors": [
                "Tommaso Dal Sasso @ University of Lugano, Switzerland",
                "Andrea Mocci @ University of Lugano, Switzerland",
                "Michele Lanza @ University of Lugano, Switzerland"
            ],
            "Affiliations": [
                "University of Lugano, Switzerland",
                "University of Lugano, Switzerland",
                "University of Lugano, Switzerland"
            ],
            "Abstract": "Abstract—During software development, exceptions are by no means exceptional: Programmers repeatedly try and test their code to ensure that it works as expected. While doing so, runtime exceptions are raised, pointing out various issues, such as inappropriate usage of an API, convoluted code, as well as defects. Such failures result in stack traces, lists composed of the sequence of method invocations that led to the interruption of the program. Stack traces are useful to debug source code, and if shared also enhance the quality of bug reports. However, they are handled manually and individually, while we argue that they can be leveraged automatically and collectively to enable what we call crowdstacking, the automated collection of stack traces on the scale of a whole development community. We present our crowdstacking approach, supported by ShoreLine Reporter, a tool which seamlessly collects stack traces during program development and execution and stores them on a central repository. We illustrate how thousands of stack traces stemming from the IDEs of several developers can be leveraged to identify common hot spots in the code that are involved in failures, using this knowledge to retrieve relevant and related bug reports and to provide an effective, instant context of the problem to the developer.",
            "Award": ""
        },
        {
            "Title": "Who Should Review My Code? A File Location-Based Code-Reviewer Recommendation Approach for Modern Code Review",
            "Type": "Research Track",
            "Key": "saner15main-mainid31-p",
            "URL": "http%3A%2F%2Fpatanamon.com%2Fwp-content%2Fuploads%2F2015%2F01%2Fsaner_thongtanunam.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Patanamon Thongtanunam, Chakkrit Tantithamthavorn, Raula Gaikovina Kula, Norihiro Yoshida, Hajimu Iida, and Kenichi Matsumoto",
            "AffiliationsString": "NAIST, Japan; Osaka University, Japan; Nagoya University, Japan",
            "Authors": [
                "Patanamon Thongtanunam @ NAIST, Japan",
                "Chakkrit Tantithamthavorn @ NAIST, Japan",
                "Raula Gaikovina Kula @ Osaka University, Japan",
                "Norihiro Yoshida @ Nagoya University, Japan",
                "Hajimu Iida @ NAIST, Japan",
                "Kenichi Matsumoto @ NAIST, Japan"
            ],
            "Affiliations": [
                "NAIST, Japan",
                "NAIST, Japan",
                "Osaka University, Japan",
                "Nagoya University, Japan",
                "NAIST, Japan",
                "NAIST, Japan"
            ],
            "Abstract": "Software code review is an inspection of a code change by an independent third-party developer in order to identify and fix defects before an integration. Effectively performing code review can improve the overall software quality. In recent years, Modern Code Review (MCR), a lightweight and tool-based code inspection, has been widely adopted in both proprietary and open-source software systems. Finding appropriate code-reviewers in MCR is a necessary step of reviewing a code change. However, little research is known the difficulty of finding code-reviewers in a distributed software development and its impact on reviewing time. In this paper, we investigate the impact of reviews with code-reviewer assignment problem has on reviewing time. We find that reviews with code-reviewer assignment problem take 12 days longer to approve a code change. To help developers find appropriate code-reviewers, we propose RevFinder, a file location-based code-reviewer recommendation approach. We leverage a similarity of previously reviewed file path to recommend an appropriate code-reviewer. The intuition is that files that are located in similar file paths would be managed and reviewed by similar experienced code-reviewers. Through an empirical evaluation on a case study of 42,045 reviews of Android Open Source Project (AOSP), OpenStack, Qt and LibreOffice projects, we find that RevFinder accurately recommended 79% of reviews with a top 10 recommendation. RevFinder also correctly recommended the code-reviewers with a median rank of 4. The overall ranking of RevFinder is 3 times better than that of a baseline approach. We believe that RevFinder could be applied to MCR in order to help developers find appropriate code-reviewers and speed up the overall code review process.",
            "Award": ""
        },
        {
            "Title": "Code Review: Veni, ViDI, Vici",
            "Type": "Research Track",
            "Key": "saner15main-mainid113-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYuriy+Tymchuk%2C+Andrea+Mocci%2C+and+Michele+Lanza+%22Code+Review%3A+Veni%2C+ViDI%2C+Vici%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Yuriy Tymchuk, Andrea Mocci, and Michele Lanza",
            "AffiliationsString": "University of Lugano, Switzerland",
            "Authors": [
                "Yuriy Tymchuk @ University of Lugano, Switzerland",
                "Andrea Mocci @ University of Lugano, Switzerland",
                "Michele Lanza @ University of Lugano, Switzerland"
            ],
            "Affiliations": [
                "University of Lugano, Switzerland",
                "University of Lugano, Switzerland",
                "University of Lugano, Switzerland"
            ],
            "Abstract": "Modern software development sees code review as a crucial part of the process, because not only does it facilitate the sharing of knowledge about the system at hand, but it may also lead to the early detection of defects, ultimately improving the quality of the produced software. Although supported by numerous approaches and tools, code review is still in its infancy, and indeed researchers have pointed out a number of shortcomings in the state of the art. We present a critical analysis of the state of the art of code review tools and techniques, extracting a set of desired features that code review tools should possess. We then present our vision and initial implementation of a novel code review approach named Visual Design Inspection (ViDI), illustrated through a set of usage scenarios. ViDI is based on a combination of visualization techniques, design heuristics, and static code analysis techniques.",
            "Award": ""
        },
        {
            "Title": "Would Static Analysis Tools Help Developers with Code Reviews?",
            "Type": "Research Track",
            "Key": "saner15main-mainid89-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSebastiano+Panichella%2C+Venera+Arnaoudova%2C+Massimiliano+Di+Penta%2C+and+Giuliano+Antoniol+%22Would+Static+Analysis+Tools+Help+Developers+with+Code+Reviews%3F%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Sebastiano Panichella, Venera Arnaoudova, Massimiliano Di Penta, and Giuliano Antoniol",
            "AffiliationsString": "University of Zurich, Switzerland; Polytechnique Montréal, Canada; University of Sannio, Italy",
            "Authors": [
                "Sebastiano Panichella @ University of Zurich, Switzerland",
                "Venera Arnaoudova @ Polytechnique Montréal, Canada",
                "Massimiliano Di Penta @ University of Sannio, Italy",
                "Giuliano Antoniol @ Polytechnique Montréal, Canada"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "Polytechnique Montréal, Canada",
                "University of Sannio, Italy",
                "Polytechnique Montréal, Canada"
            ],
            "Abstract": "Code reviews have been conducted since decades in software projects, with the aim of improving code quality from many different points of view. During code reviews, developers are supported by checklists, coding standards and, possibly, by various kinds of static analysis tools. This paper investigates whether warnings highlighted by static analysis tools are taken care of during code reviews and, whether there are kinds of warnings that tend to be removed more than others. Results of a study conducted by mining the Gerrit repository of six Java open source projects indicate that the density of warnings only slightly vary after each review. The overall percentage of warnings removed during reviews is slightly higher than what previous studies found for the overall project evolution history. However, when looking (quantitatively and qualitatively) at specific categories of warnings, we found that during code reviews developers focus on certain kinds of problems. For such categories of warnings the removal percentage tend to be very high, often above 50% and sometimes up to 100%. Examples of those are warnings in the imports, regular expressions, and type resolution categories. In conclusion, while a broad warning detection might produce way too many false positives, enforcing the removal of certain warnings prior to the patch submission could reduce the amount of effort provided during the code review process.",
            "Award": ""
        },
        {
            "Title": "Do Code Review Practices Impact Design Quality? A Case Study of the Qt, VTK, and ITK Projects",
            "Type": "Research Track",
            "Key": "saner15main-mainid147-p",
            "URL": "http%3A%2F%2Fswat.polymtl.ca%2Fdata%2FSANER15%2FMorales-saner15.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fswat.polymtl.ca%2Fdata%2FSANER15%2F",
            "DOI": "",
            "PersonsString": "Rodrigo Morales, Shane McIntosh, and Foutse Khomh",
            "AffiliationsString": "Polytechnique Montréal, Canada; Queen's University, Canada",
            "Authors": [
                "Rodrigo Morales @ Polytechnique Montréal, Canada",
                "Shane McIntosh @ Queen's University, Canada",
                "Foutse Khomh @ Polytechnique Montréal, Canada"
            ],
            "Affiliations": [
                "Polytechnique Montréal, Canada",
                "Queen's University, Canada",
                "Polytechnique Montréal, Canada"
            ],
            "Abstract": "Code review is the process of having other team members examine changes to a software system in order to evaluate its technical content and quality. A lightweight variant of this practice, often referred to as Modern Code Review (MCR), is widely adopted by software organizations today. Previous studies have established a relation between the practice of code review and the occurrence of post-release bugs. While the prior work studies the impact of code review practices on software release quality, it is still unclear what impact code review practices have on software design quality. Therefore, using the occurrence of 7 different types of anti-patterns (i.e., poor solutions to design and implementation problems) as a proxy for software design quality, we set out to investigate the relationship between code review practices and software design quality. Through a case study of the Qt, VTK and ITK open source projects, we find that software components with low review coverage or low review participation are often more prone to the occurrence of anti-patterns than those components with more active code review practices.",
            "Award": ""
        },
        {
            "Title": "Scaling up Evaluation of Code Search Tools through Developer Usage Metrics",
            "Type": "Research Track",
            "Key": "saner15main-mainid11-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKostadin+Damevski%2C+David+C.+Shepherd%2C+and+Lori+Pollock+%22Scaling+up+Evaluation+of+Code+Search+Tools+through+Developer+Usage+Metrics%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Kostadin Damevski, David C. Shepherd, and Lori Pollock",
            "AffiliationsString": "Virginia State University, USA; ABB, USA; University of Delaware, USA",
            "Authors": [
                "Kostadin Damevski @ Virginia State University, USA",
                "David C. Shepherd @ ABB, USA",
                "Lori Pollock @ University of Delaware, USA"
            ],
            "Affiliations": [
                "Virginia State University, USA",
                "ABB, USA",
                "University of Delaware, USA"
            ],
            "Abstract": "Code search is a fundamental part of program understanding and software maintenance and thus researchers have developed many techniques to improve its performance, such as corpora preprocessing and query reformulation. Unfortunately, to date, evaluations of code search techniques have largely been in lab settings, while scaling and transitioning to effective practical use demands more empirical feedback from the field. This paper addresses that need by studying metrics based on automatically-gathered anonymous field data from code searches to infer user satisfaction. We describe techniques for addressing important concerns, such as how privacy is retained and how the overhead on the interactive system is minimized. We perform controlled user and field studies which identify metrics that correlate with user satisfaction, enabling the future evaluation of search tools through anonymous usage data. In comparing our metrics to similar metrics used in Internet search we observe differences in the relationship of some of the metrics to user satisfaction. As we further explore the data, we also present a predictive multi-metric model that achieves accuracy of over 70% in determining query satisfaction.",
            "Award": ""
        },
        {
            "Title": "Optimized Feature Selection towards Functional and Non-functional Requirements in Software Product Lines",
            "Type": "Research Track",
            "Key": "saner15main-mainid8-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DXiaoli+Lian+and+Li+Zhang+%22Optimized+Feature+Selection+towards+Functional+and+Non-functional+Requirements+in+Software+Product+Lines%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Xiaoli Lian and Li Zhang",
            "AffiliationsString": "Beihang University, China",
            "Authors": [
                "Xiaoli Lian @ Beihang University, China",
                "Li Zhang @ Beihang University, China"
            ],
            "Affiliations": [
                "Beihang University, China",
                "Beihang University, China"
            ],
            "Abstract": "As an important research issue in software product line, feature selection is extensively studied. Besides the basic functional requirements (FRs), the non-functional requirements (NFRs) are also critical during feature selection. Some NFRs have numerical constraints, while some have not. Without clear criteria, the latter are always expected to be the best possible. However, most existing selection methods ignore the combination of constrained and unconstrained NFRs and FRs. Meanwhile, the complex constraints and dependencies among features are perpetual challenges for feature selection. To this end, this paper proposes a multi-objective optimization algorithm IVEA to optimize the selection of features with NFRs and FRs by considering the relations among these features. Particularly, we first propose a two-dimensional fitness function. One dimension is to optimize the NFRs without quantitative constraints. The other one is to assure the selected features satisfy the FRs, and conform to the relations among features. Second, we propose a violationdominance principle, which guides the optimization under FRs and the relations among features. We conducted comprehensive experiments on two feature models with different sizes to evaluate IVEA with state-of-the-art multi-objective optimization algorithms, including IBEAHD, IBEAɛ+, NSGA-II and SPEA2. The results showed that the IVEA significantly outperforms the above baselines in the NFRs optimization. Meanwhile, our algorithm needs less time to generate a solution that meets the FRs and the constraints on NFRs and fully conforms to the feature model.",
            "Award": ""
        },
        {
            "Title": "Threshold-Free Code Clone Detection for a Large-Scale Heterogeneous Java Repository",
            "Type": "Research Track",
            "Key": "saner15main-mainid162-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DIman+Keivanloo%2C+Feng+Zhang%2C+and+Ying+Zou+%22Threshold-Free+Code+Clone+Detection+for+a+Large-Scale+Heterogeneous+Java+Repository%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Iman Keivanloo, Feng Zhang, and Ying Zou",
            "AffiliationsString": "Queen's University, Canada",
            "Authors": [
                "Iman Keivanloo @ Queen's University, Canada",
                "Feng Zhang @ Queen's University, Canada",
                "Ying Zou @ Queen's University, Canada"
            ],
            "Affiliations": [
                "Queen's University, Canada",
                "Queen's University, Canada",
                "Queen's University, Canada"
            ],
            "Abstract": "Code clones are unavoidable entities in software ecosystems. A variety of clone-detection algorithms are available for finding code clones. For Type-3 clone detection at method granularity (i.e., similar methods with changes in statements), dissimilarity threshold is one of the possible configuration parameters. Existing approaches use a single threshold to detect Type-3 clones across a repository. However, our study shows that to detect Type-3 clones at method granularity on a large-scale heterogeneous repository, multiple thresholds are often required. We find that the performance of clone detection improves if selecting different thresholds for various groups of clones in a heterogeneous repository (i.e., various applications). In this paper, we propose a threshold-free approach to detect Type-3 clones at method granularity across a large number of applications. Our approach uses an unsupervised learning algorithm, i.e., k-means, to determine true and false clones. We use a clone benchmark with 330,840 tagged clones from 24,824 open source Java projects for our study. We observe that our approach improves the performance significantly by 12% in terms of F-measure. Furthermore, our threshold-free approach eliminates the concern of practitioners about possible misconfiguration of Type-3 clone detection tools.",
            "Award": ""
        },
        {
            "Title": "Detecting Duplicate Bug Reports with Software Engineering Domain Knowledge",
            "Type": "Research Track",
            "Key": "saner15main-mainid55-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKaran+Aggarwal%2C+Tanner+Rutgers%2C+Finbarr+Timbers%2C+Abram+Hindle%2C+Russ+Greiner%2C+and+Eleni+Stroulia+%22Detecting+Duplicate+Bug+Reports+with+Software+Engineering+Domain+Knowledge%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Karan Aggarwal, Tanner Rutgers, Finbarr Timbers, Abram Hindle, Russ Greiner, and Eleni Stroulia",
            "AffiliationsString": "University of Alberta, Canada",
            "Authors": [
                "Karan Aggarwal @ University of Alberta, Canada",
                "Tanner Rutgers @ University of Alberta, Canada",
                "Finbarr Timbers @ University of Alberta, Canada",
                "Abram Hindle @ University of Alberta, Canada",
                "Russ Greiner @ University of Alberta, Canada",
                "Eleni Stroulia @ University of Alberta, Canada"
            ],
            "Affiliations": [
                "University of Alberta, Canada",
                "University of Alberta, Canada",
                "University of Alberta, Canada",
                "University of Alberta, Canada",
                "University of Alberta, Canada",
                "University of Alberta, Canada"
            ],
            "Abstract": "In previous work by Alipour et al., a methodology was proposed for detecting duplicate bug reports by comparing the textual content of bug reports to subject-specific contextual material, namely lists of software-engineering terms, such as non-functional requirements and architecture keywords. When a bug report contains a word in these word-list contexts, the bug report is considered to be associated with that context and this information tends to improve bug-deduplication methods. In this paper, we propose a method to partially automate the extraction of contextual word lists from software-engineering literature. Evaluating this software-literature context method on real-world bug reports produces useful results that indicate this semi-automated method has the potential to substantially decrease the manual effort used in contextual bug deduplication while suffering only a minor loss in accuracy.",
            "Award": ""
        },
        {
            "Title": "Impact Analysis Based on a Global Hierarchical Object Graph",
            "Type": "Research Track",
            "Key": "saner15main-mainid60-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMarwan+Abi-Antoun%2C+Yibin+Wang%2C+Ebrahim+Khalaj%2C+Andrew+Giang%2C+and+V%C3%A1clav+Rajlich+%22Impact+Analysis+Based+on+a+Global+Hierarchical+Object+Graph%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.cs.wayne.edu%2F%7Emabianto%2Farch_summary%2F",
            "DOI": "",
            "PersonsString": "Marwan Abi-Antoun, Yibin Wang, Ebrahim Khalaj, Andrew Giang, and Václav Rajlich",
            "AffiliationsString": "Wayne State University, USA",
            "Authors": [
                "Marwan Abi-Antoun @ Wayne State University, USA",
                "Yibin Wang @ Wayne State University, USA",
                "Ebrahim Khalaj @ Wayne State University, USA",
                "Andrew Giang @ Wayne State University, USA",
                "Václav Rajlich @ Wayne State University, USA"
            ],
            "Affiliations": [
                "Wayne State University, USA",
                "Wayne State University, USA",
                "Wayne State University, USA",
                "Wayne State University, USA",
                "Wayne State University, USA"
            ],
            "Abstract": "During impact analysis on object-oriented code, statically extracting dependencies is often complicated by subclassing, programming to interfaces, aliasing, and collections, among others. When a tool recommends a large number of types or does not rank its recommendations, it may lead developers to explore more irrelevant code. We propose to mine and rank dependencies based on a global, hierarchical points-to graph that is extracted using abstract interpretation. A previous whole-program static analysis interprets a program enriched with annotations that express hierarchy, and over-approximates all the objects that may be created at runtime and how they may communicate. In this paper, an analysis mines the hierarchy and the edges in the graph to extract and rank dependencies such as the most important classes related to a class, or the most important classes behind an interface. An evaluation using two case studies on two systems totaling 10,000 lines of code and five completed code modification tasks shows that following dependencies based on abstract interpretation achieves higher effectiveness compared to following dependencies extracted from the abstract syntax tree. As a result, developers explore less irrelevant code.",
            "Award": ""
        },
        {
            "Title": "A Framework for Cost-Effective Dependence-Based Dynamic Impact Analysis",
            "Type": "Research Track",
            "Key": "saner15main-mainid93-p",
            "URL": "http%3A%2F%2Fwww3.nd.edu%2F%7Ehcai%2Fpubs%2Fsaner15-a.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww3.nd.edu%2F%7Ehcai%2Fdiver%2F",
            "DOI": "",
            "PersonsString": "Haipeng Cai and Raul Santelices",
            "AffiliationsString": "University of Notre Dame, USA",
            "Authors": [
                "Haipeng Cai @ University of Notre Dame, USA",
                "Raul Santelices @ University of Notre Dame, USA"
            ],
            "Affiliations": [
                "University of Notre Dame, USA",
                "University of Notre Dame, USA"
            ],
            "Abstract": "Dynamic impact analysis can greatly assist developers with managing software changes by focusing their attention on the effects of potential changes relative to concrete program executions. While dependence-based dynamic impact analysis (DDIA) provides finer-grained results than traceability-based approaches, traditional DDIA techniques often produce imprecise results, incurring excessive costs thus hindering their adoption in many practical situations. In this paper, we present the design and evaluation of a DDIA framework and its three new instances that offer not only much more precise impact sets but also flexible cost-effectiveness options to meet diverse application needs such as different budgets and levels of detail of results. By exploiting both static dependencies and various dynamic information including method-execution traces, statement coverage, and dynamic points-to data, our techniques achieve that goal at reasonable costs according to our experiment results. Our study also suggests that statement coverage has generally stronger effects on the precision and cost-effectiveness of DDIA than dynamic points-to data.",
            "Award": ""
        },
        {
            "Title": "Circular Dependencies and Change-Proneness: An Empirical Study",
            "Type": "Research Track",
            "Key": "saner15main-mainid118-p",
            "URL": "http%3A%2F%2Fwww.idi.ntnu.no%2F%7Etosindo%2Fpublications%2FSANER15_pre_print.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tosin Daniel Oyetoyan, Jens Dietrich, Jean-Rémy Falleri, and Kamil Jezek",
            "AffiliationsString": "NTNU, Norway; Massey University, New Zealand; LaBRI, France; University of Bordeaux, France; University of West Bohemia, Czech Republic",
            "Authors": [
                "Tosin Daniel Oyetoyan @ NTNU, Norway",
                "Jens Dietrich @ Massey University, New Zealand",
                "Jean-Rémy Falleri @ LaBRI, France / University of Bordeaux, France",
                "Kamil Jezek @ University of West Bohemia, Czech Republic"
            ],
            "Affiliations": [
                "NTNU, Norway",
                "Massey University, New Zealand",
                "LaBRI, France / University of Bordeaux, France",
                "University of West Bohemia, Czech Republic"
            ],
            "Abstract": "Advice that circular dependencies between programming artefacts should be avoided goes back to the earliest work on software design, and is well-established and rarely questioned. However, empirical studies have shown that real-world (Java) programs are riddled with circular dependencies between artefacts on different levels of abstraction and aggregation. It has been suggested that additional heuristics could be used to distinguish between bad and harmless cycles, for instances by relating them to the hierarchical structure of the packages within a program, or to violations of additional design principles. In this study, we try to explore this question further by analysing the relationship between different kinds of circular dependencies between Java classes, and their change frequency. We find that (1) the presence of cycles can have a significant impact on the change proneness of the classes near these cycles and (2) neither subtype knowledge nor the location of the cycle within the package containment tree are suitable criteria to distinguish between critical and harmless cycles.",
            "Award": ""
        },
        {
            "Title": "An Empirical Study of Work Fragmentation in Software Evolution Tasks",
            "Type": "Research Track",
            "Key": "saner15main-mainid143-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DHeider+Sanchez%2C+Romain+Robbes%2C+and+Victor+M.+Gonzalez+%22An+Empirical+Study+of+Work+Fragmentation+in+Software+Evolution+Tasks%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Heider Sanchez, Romain Robbes, and Victor M. Gonzalez",
            "AffiliationsString": "University of Chile, Chile; ITAM, Mexico",
            "Authors": [
                "Heider Sanchez @ University of Chile, Chile",
                "Romain Robbes @ University of Chile, Chile",
                "Victor M. Gonzalez @ ITAM, Mexico"
            ],
            "Affiliations": [
                "University of Chile, Chile",
                "University of Chile, Chile",
                "ITAM, Mexico"
            ],
            "Abstract": "Information workers and software developers are exposed to work fragmentation, an interleaving of activities and interruptions during their normal work day. Small-scale observational studies have shown that this can be detrimental to their work. In this paper, we perform a large-scale study of this phenomenon for the particular case of software developers performing software evolution tasks. Our study is based on several thousands interaction traces collected by Mylyn, for dozens of developers. We observe that work fragmentation is correlated to lower observed productivity at both the macro level (for entire sessions), and at the micro level (around markers of work fragmentation); further, longer activity switches seem to strengthen the effect. These observations are basis for subsequent studies investigating the phenomenon of work fragmentation.",
            "Award": ""
        },
        {
            "Title": "Library Functions Identification in Binary Code by Using Graph Isomorphism Testings",
            "Type": "Research Track",
            "Key": "saner15main-mainid153-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJing+Qiu%2C+Xiaohong+Su%2C+and+Peijun+Ma+%22Library+Functions+Identification+in+Binary+Code+by+Using+Graph+Isomorphism+Testings%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jing Qiu, Xiaohong Su, and Peijun Ma",
            "AffiliationsString": "Harbin Institute of Technology, China",
            "Authors": [
                "Jing Qiu @ Harbin Institute of Technology, China",
                "Xiaohong Su @ Harbin Institute of Technology, China",
                "Peijun Ma @ Harbin Institute of Technology, China"
            ],
            "Affiliations": [
                "Harbin Institute of Technology, China",
                "Harbin Institute of Technology, China",
                "Harbin Institute of Technology, China"
            ],
            "Abstract": "Library function identification is a key technique in reverse engineering. Discontinuity and polymorphism of inline and optimized library functions in binary code create a difficult challenge for library function identification. To solve this problem, a novel approach is developed to identify library functions. First, we introduce execution dependence graphs (EDGs) to describe the behavior characteristics of binary code. Then, by finding similar EDG subgraphs in target functions, we identify both full and inline library functions. Experimental results from the prototype tool show that the proposed method is not only capable of identifying inline functions but is also more efficient and precise than the current methods for identifying full library functions.",
            "Award": ""
        },
        {
            "Title": "A Non-convex Abstract Domain for the Value Analysis of Binaries",
            "Type": "Research Track",
            "Key": "saner15main-mainid87-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSven+Mattsen%2C+Arne+Wichmann%2C+and+Sibylle+Schupp+%22A+Non-convex+Abstract+Domain+for+the+Value+Analysis+of+Binaries%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fx-yt-ts%3D1421782837%26v%3DOHKm3L5jNqU",
            "URLinfo": "http%3A%2F%2Fwww.tuhh.de%2Fsts%2Fresearch%2Fprojects%2Fbddstab.html",
            "DOI": "",
            "PersonsString": "Sven Mattsen, Arne Wichmann, and Sibylle Schupp",
            "AffiliationsString": "TU Hamburg, Germany",
            "Authors": [
                "Sven Mattsen @ TU Hamburg, Germany",
                "Arne Wichmann @ TU Hamburg, Germany",
                "Sibylle Schupp @ TU Hamburg, Germany"
            ],
            "Affiliations": [
                "TU Hamburg, Germany",
                "TU Hamburg, Germany",
                "TU Hamburg, Germany"
            ],
            "Abstract": "A challenge in sound reverse engineering of binary executables is to determine sets of possible targets for dynamic jumps. One technique to address this challenge is abstract interpretation, where singleton values in registers and memory locations are overapproximated to collections of possible values. With contemporary abstract interpretation techniques, convexity is usually enforced on these collections, which causes unacceptable loss of precision. We present a non-convex abstract domain, suitable for the analysis of binary executables. The domain is based on binary decision diagrams (BDD) to allow an efficient representation of non-convex sets of integers. Non-convex sets are necessary to represent the results of jump table lookups and bitwise operations, which are more frequent in executables than in high-level code because of optimizing compilers. Our domain computes abstract bitwise and arithmetic operations precisely and looses precision only for division and multiplication. Because the operations are defined on the structure of the BDDs, they remain efficient even if executed on very large sets. In executables, conditional jumps require solving formulas built with negation and conjunction. We implement a constraint solver using the fast intersection and complementation of BDD-based sets. Our domain is implemented as a plug-in, called BDDStab, and integrated with the binary analysis framework Jakstab. We use Jakstab’s k-set and interval domains to discuss the increase in precision for a selection of compiler-generated executables.",
            "Award": ""
        },
        {
            "Title": "Precision vs. Scalability: Context Sensitive Analysis with Prefix Approximation",
            "Type": "Research Track",
            "Key": "saner15main-mainid164-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRaveendra+Kumar+Medicherla+and+Raghavan+Komondoor+%22Precision+vs.+Scalability%3A+Context+Sensitive+Analysis+with+Prefix+Approximation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Raveendra Kumar Medicherla and Raghavan Komondoor",
            "AffiliationsString": "Tata Consultancy Services, India; Indian Institute of Science, India",
            "Authors": [
                "Raveendra Kumar Medicherla @ Tata Consultancy Services, India / Indian Institute of Science, India",
                "Raghavan Komondoor @ Indian Institute of Science, India"
            ],
            "Affiliations": [
                "Tata Consultancy Services, India / Indian Institute of Science, India",
                "Indian Institute of Science, India"
            ],
            "Abstract": "Context sensitive inter-procedural dataflow analysis is a precise approach for static analysis of programs. It is very expensive in its full form. We propose a prefix approximation for context sensitive analysis, wherein a prefix of the full context stack is used to tag dataflow facts. Our technique, which is in contrast with suffix approximation that has been widely used in the literature, is designed to be more scalable when applied to programs with modular structure. We describe an instantiation of our technique in the setting of the classical call-strings approach for inter-procedural analysis. We analyzed several large enterprise programs using an implementation of our technique, and compared it with the fully context sensitive, context insensitive, as well as suffix-approximated variants of the call-strings approach. The precision of our technique was in general less than that of suffix approximation when measured on entire programs. However, the precision that it offered for outer-level procedures, which typically contain key business logic, was better, and its performance was much better.",
            "Award": ""
        },
        {
            "Title": "MG++: Memory Graphs for Analyzing Dynamic Data Structures",
            "Type": "Research Track",
            "Key": "saner15main-mainid56-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DVineet+Singh%2C+Rajiv+Gupta%2C+and+Iulian+Neamtiu+%22MG%2B%2B%3A+Memory+Graphs+for+Analyzing+Dynamic+Data+Structures%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Vineet Singh, Rajiv Gupta, and Iulian Neamtiu",
            "AffiliationsString": "University of California at Riverside, USA",
            "Authors": [
                "Vineet Singh @ University of California at Riverside, USA",
                "Rajiv Gupta @ University of California at Riverside, USA",
                "Iulian Neamtiu @ University of California at Riverside, USA"
            ],
            "Affiliations": [
                "University of California at Riverside, USA",
                "University of California at Riverside, USA",
                "University of California at Riverside, USA"
            ],
            "Abstract": "Memory graphs are very useful in understanding the behavior of programs that use dynamically allocated data structures. We present a new memory graph representation, MG++, and a memory graph construction algorithm, that greatly enhance the utility of memory graphs. First, in addition to capturing the shapes of dynamically-constructed data structures, MG++ also captures how they evolve as the program executes and records the source code statements that play a role in their evolution to assist in debugging. Second, MG++ captures the history of actions performed by the memory allocator. This is useful in debugging programs that internally manage storage or in cases where understanding program behavior requires examining memory allocator actions. Our binary instrumentation-based algorithm for MG++ construction does not rely on the knowledge of memory allocator functions or on symbol table information. Our algorithm works for custom memory allocators as well as for in-program memory management. Experiments studying the time and space efficiency for real-world programs show that MG++ representation is space-efficient and the time overhead for MG++ construction algorithm is practical. We show that MG++ is effective for fault location and for analyzing binaries to detect heap buffer overflow attacks.",
            "Award": ""
        },
        {
            "Title": "SQA-Profiles: Rule-Based Activity Profiles for Continuous Integration Environments",
            "Type": "Research Track",
            "Key": "saner15main-mainid15-p",
            "URL": "https%3A%2F%2Fmbrandt232.github.io%2Fproject%2Fsqa-profiles%2Fpublication.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.ifi.uzh.ch%2Fseal%2Fpeople%2Fbrandtner%2Fprojects%2Fsqa-profiles.html",
            "DOI": "",
            "PersonsString": "Martin Brandtner, Sebastian C. Müller, Philipp Leitner, and Harald C. Gall",
            "AffiliationsString": "University of Zurich, Switzerland",
            "Authors": [
                "Martin Brandtner @ University of Zurich, Switzerland",
                "Sebastian C. Müller @ University of Zurich, Switzerland",
                "Philipp Leitner @ University of Zurich, Switzerland",
                "Harald C. Gall @ University of Zurich, Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "Continuous Integration (CI) environments cope with the repeated integration of source code changes and provide rapid feedback about the status of a software project. However, as the integration cycles become shorter, the amount of data increases, and the effort to find information in CI environments becomes substantial. In modern CI environments, the selection of measurements (e.g., build status, quality metrics) listed in a dashboard does only change with the intervention of a stakeholder (e.g., a project manager). In this paper, we want to address the shortcoming of static views with so-called Software Quality Assessment (SQA) profiles. SQA-Profiles are defined as rulesets and enable a dynamic composition of CI dashboards based on stakeholder activities in tools of a CI environment (e.g., version control system). We present a set of SQA-Profiles for project management committee (PMC) members: Bandleader, Integrator, Gatekeeper, and Onlooker. For this, we mined the commit and issue management activities of PMC members from 20 Apache projects. We implemented a framework to evaluate the performance of our rule-based SQA-Profiles in comparison to a machine learning approach. The results showed that project-independent SQA-Profiles can be used to automatically extract the profiles of PMC members with a precision of 0.92 and a recall of 0.78.",
            "Award": ""
        },
        {
            "Title": "Cross-Project Build Co-change Prediction",
            "Type": "Research Track",
            "Key": "saner15main-mainid83-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DXin+Xia%2C+David+Lo%2C+Shane+McIntosh%2C+Emad+Shihab%2C+and+Ahmed+E.+Hassan+%22Cross-Project+Build+Co-change+Prediction%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Xin Xia, David Lo, Shane McIntosh, Emad Shihab, and Ahmed E. Hassan",
            "AffiliationsString": "Zhejiang University, China; Singapore Management University, Singapore; Queen's University, Canada; Concordia University, Canada",
            "Authors": [
                "Xin Xia @ Zhejiang University, China",
                "David Lo @ Singapore Management University, Singapore",
                "Shane McIntosh @ Queen's University, Canada",
                "Emad Shihab @ Concordia University, Canada",
                "Ahmed E. Hassan @ Queen's University, Canada"
            ],
            "Affiliations": [
                "Zhejiang University, China",
                "Singapore Management University, Singapore",
                "Queen's University, Canada",
                "Concordia University, Canada",
                "Queen's University, Canada"
            ],
            "Abstract": "Build systems orchestrate how human-readable source code is translated into executable programs. In a software project, source code changes can induce changes in the build system (aka. build co-changes). It is difficult for developers to identify when build co-changes are necessary due to the complexity of build systems. Prediction of build co-changes works well if there is a sufficient amount of training data to build a model. However, in practice, for new projects, there exists a limited number of changes. Using training data from other projects to predict the build co-changes in a new project can help improve the performance of the build co-change prediction. We refer to this problem as cross-project build co-change prediction. In this paper, we propose CroBuild, a novel cross-project build co-change prediction approach that iteratively learns new classifiers. CroBuild constructs an ensemble of classifiers by iteratively building classifiers and assigning them weights according to its prediction error rate. Given that only a small proportion of code changes are build co-changing, we also propose an imbalance-aware approach that learns a threshold boundary between those code changes that are build co-changing and those that are not in order to construct classifiers in each iteration. To examine the benefits of CroBuild, we perform experiments on 4 large datasets including Mozilla, Eclipse-core, Lucene, and Jazz, comprising a total of 50,884 changes. On average, across the 4 datasets, CroBuild achieves a F1-score of up to 0.408. We also compare CroBuild with other approaches such as a basic model, AdaBoost proposed by Freund et al., and TrAdaBoost proposed by Dai et al.. On average, across the 4 datasets, the CroBuild approach yields an improvement in F1-scores of 41.54%, 36.63%, and 36.97% over the basic model, AdaBoost, and TrAdaBoost, respectively.",
            "Award": ""
        },
        {
            "Title": "The Influence of App Churn on App Success and StackOverflow Discussions",
            "Type": "Research Track",
            "Key": "saner15main-mainid2-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLatifa+Guerrouj%2C+Shams+Azad%2C+and+Peter+C.+Rigby+%22The+Influence+of+App+Churn+on+App+Success+and+StackOverflow+Discussions%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Latifa Guerrouj, Shams Azad, and Peter C. Rigby",
            "AffiliationsString": "Concordia University, Canada",
            "Authors": [
                "Latifa Guerrouj @ Concordia University, Canada",
                "Shams Azad @ Concordia University, Canada",
                "Peter C. Rigby @ Concordia University, Canada"
            ],
            "Affiliations": [
                "Concordia University, Canada",
                "Concordia University, Canada",
                "Concordia University, Canada"
            ],
            "Abstract": "Gauging the success of software systems has been difficult in the past as there was no uniform measure. With mobile Application (App) Stores, users rate each App according to a common rating scheme. In this paper, we study the impact of App churn on the App success through the analysis of 154 free Android Apps that have a total of 1.2k releases. We provide a novel technique to extract Android API elements used by Apps that developers change between releases. We find that high App churn leads to lower user ratings. For example, we find that on average, per release, poorly rated Apps change 140 methods compared to the 82 methods changed by positively rated Apps. Our findings suggest that developers should not release new features at the expense of churn and user ratings. We also investigate the link between how frequently API classes and methods are changed by App developers relative to the amount of discussion of these code elements on StackOverflow. Our findings indicate that classes and methods that are changed frequently by App developers are in more posts on StackOverflow. We add to the growing consensus that StackOverflow keeps up with the documentation needs of practitioners.",
            "Award": ""
        },
        {
            "Title": "Beyond Support and Confidence: Exploring Interestingness Measures for Rule-Based Specification Mining",
            "Type": "Research Track",
            "Key": "saner15main-mainid37-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTien-Duy+B.+Le+and+David+Lo+%22Beyond+Support+and+Confidence%3A+Exploring+Interestingness+Measures+for+Rule-Based+Specification+Mining%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tien-Duy B. Le and David Lo",
            "AffiliationsString": "Singapore Management University, Singapore",
            "Authors": [
                "Tien-Duy B. Le @ Singapore Management University, Singapore",
                "David Lo @ Singapore Management University, Singapore"
            ],
            "Affiliations": [
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore"
            ],
            "Abstract": "Numerous rule-based specification mining approaches have been proposed in the literature. Many of these approaches analyze a set of execution traces to discover interesting usage rules, e.g., whenever lock() is invoked, eventually unlock() is invoked. These techniques often generate and enumerate a set of candidate rules and compute some interestingness scores. Rules whose interestingness scores are above a certain threshold would then be output. In past studies, two measures, namely support and confidence, which are well-known measures, are often used to compute these scores. However, aside from these two, many other interestingness measures have been proposed. It is thus unclear if support and confidence are the best interestingness measures for specification mining. In this work, we perform an empirical study that investigates the utility of 38 interestingness measures in recovering correct specifications of classes from Java libraries. We used a ground truth dataset consisting of 683 rules and recorded execution traces that are produced when we run the DaCapo test suite. We apply 38 different interestingness measures to identify correct rules from a pool of candidate rules. Our study highlights that many measures are on par to support and confidence. Some of the measures are even better than support or confidence and at least one of the measures is statistically significantly better than the two measures. We also find that compositions of several measures with support statistically significantly outperform the composition of support and confidence. Our findings highlight the need to look beyond standard support and confidence to find interesting rules.",
            "Award": ""
        },
        {
            "Title": "Untangling Fine-Grained Code Changes",
            "Type": "Research Track",
            "Key": "saner15main-mainid23-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMart%C3%ADn+Dias%2C+Alberto+Bacchelli%2C+Georgios+Gousios%2C+Damien+Cassou%2C+and+St%C3%A9phane+Ducasse+%22Untangling+Fine-Grained+Code+Changes%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Martín Dias, Alberto Bacchelli, Georgios Gousios, Damien Cassou, and Stéphane Ducasse",
            "AffiliationsString": "INRIA, France; University of Lille, France; Delft University of Technology, Netherlands; Radboud University Nijmegen, Netherlands",
            "Authors": [
                "Martín Dias @ INRIA, France / University of Lille, France",
                "Alberto Bacchelli @ Delft University of Technology, Netherlands",
                "Georgios Gousios @ Radboud University Nijmegen, Netherlands",
                "Damien Cassou @ INRIA, France / University of Lille, France",
                "Stéphane Ducasse @ INRIA, France / University of Lille, France"
            ],
            "Affiliations": [
                "INRIA, France / University of Lille, France",
                "Delft University of Technology, Netherlands",
                "Radboud University Nijmegen, Netherlands",
                "INRIA, France / University of Lille, France",
                "INRIA, France / University of Lille, France"
            ],
            "Abstract": "After working for some time, developers commit their code changes to a version control system. When doing so, research shows that they often bundle unrelated changes (e.g., bug fix and refactoring) in a single commit, thus creating a so-called tangled commit. Sharing tangled commits is problematic because it makes review, reversion, and integration of these commits harder and historical analyses of the project less reliable. Researchers have worked at untangling existing commits, i.e., finding which part of a commit relates to which task. In this paper, we contribute to this line of work in two ways: (1) A publicly available dataset of untangled code changes, created with the help of two developers who accurately split their code changes into self contained tasks over a period of four months; (2) based on this dataset we devise and assess EpiceaUntangler, an approach to help developers share untangled commits (aka. atomic commits) by using fine-grained code change information. We further evaluate EpiceaUntangler by deploying it to 7 developers, who used it for 2 weeks. We recorded a median success rate of 91% and average one of 75%, in automatically creating clusters of untangled fine- grained code changes.",
            "Award": ""
        },
        {
            "Title": "A Comprehensive and Scalable Method for Analyzing Fine-Grained Source Code Change Patterns",
            "Type": "Research Track",
            "Key": "saner15main-mainid63-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMasatomo+Hashimoto%2C+Akira+Mori%2C+and+Tomonori+Izumida+%22A+Comprehensive+and+Scalable+Method+for+Analyzing+Fine-Grained+Source+Code+Change+Patterns%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Masatomo Hashimoto, Akira Mori, and Tomonori Izumida",
            "AffiliationsString": "RIKEN Advanced Institute for Computational Science, Japan; National Institute of Advanced Industrial Science and Technology, Japan",
            "Authors": [
                "Masatomo Hashimoto @ RIKEN Advanced Institute for Computational Science, Japan",
                "Akira Mori @ National Institute of Advanced Industrial Science and Technology, Japan",
                "Tomonori Izumida @ National Institute of Advanced Industrial Science and Technology, Japan"
            ],
            "Affiliations": [
                "RIKEN Advanced Institute for Computational Science, Japan",
                "National Institute of Advanced Industrial Science and Technology, Japan",
                "National Institute of Advanced Industrial Science and Technology, Japan"
            ],
            "Abstract": "This paper presents a comprehensive method for identifying fine-grained change patterns in the source code of large-scale software projects. Source code changes are computed by differencing abstract syntax trees of adjacent versions and transferred to a set of logical statements called a factbase. A fact base contains information for tracking and relating source code entities across versions and can be used to integrate analysis results of other tools such as call graphs and control flows. Users can obtain a list of change pattern instances by querying the factbase. Experiments conducted on the Linux-2.6 kernel, which involve more than 4 billions of facts, are reported to demonstrate capability of the method.",
            "Award": ""
        },
        {
            "Title": "Summarizing Evolutionary Trajectory by Grouping and Aggregating Relevant Code Changes",
            "Type": "Research Track",
            "Key": "saner15main-mainid30-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DQingtao+Jiang%2C+Xin+Peng%2C+Hai+Wang%2C+Zhenchang+Xing%2C+and+Wenyun+Zhao+%22Summarizing+Evolutionary+Trajectory+by+Grouping+and+Aggregating+Relevant+Code+Changes%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Qingtao Jiang, Xin Peng, Hai Wang, Zhenchang Xing, and Wenyun Zhao",
            "AffiliationsString": "Fudan University, China; Nanyang Technological University, Singapore",
            "Authors": [
                "Qingtao Jiang @ Fudan University, China",
                "Xin Peng @ Fudan University, China",
                "Hai Wang @ Fudan University, China",
                "Zhenchang Xing @ Nanyang Technological University, Singapore",
                "Wenyun Zhao @ Fudan University, China"
            ],
            "Affiliations": [
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China",
                "Nanyang Technological University, Singapore",
                "Fudan University, China"
            ],
            "Abstract": "The lifecycle of a large-scale software system can undergo many releases. Each release often involves hundreds or thousands of revisions committed by many developers over time. Many code changes are made in a systematic and collaborative way. However, such systematic and collaborative code changes are often undocumented and hidden in the evolution history of a software system. It is desirable to recover commonalities and associations among dispersed code changes in the evolutionary trajectory of a software system. In this paper, we present SETGA (Summarizing Evolutionary Trajectory by Grouping and Aggregation), an approach to summarizing historical commit records as trajectory patterns by grouping and aggregating relevant code changes committed over time. SETGA extracts change operations from a series of commit records from version control systems. It then groups extracted change operations by their common properties from different dimensions such as change operation types, developers and change locations. After that, SETGA aggregates relevant change operation groups by mining various associations among them. The proposed approach has been implemented and applied to three open-source systems. The results show that SETGA can identify various types of trajectory patterns that are useful for software evolution management and quality assurance.",
            "Award": ""
        },
        {
            "Title": "Identifying the Exact Fixing Actions of Static Rule Violation",
            "Type": "Research Track",
            "Key": "saner15main-mainid98-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DHayatou+Oumarou%2C+Nicolas+Anquetil%2C+Anne+Etien%2C+St%C3%A9phane+Ducasse%2C+and+Kolyang+Dina+Taiwe+%22Identifying+the+Exact+Fixing+Actions+of+Static+Rule+Violation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Hayatou Oumarou, Nicolas Anquetil, Anne Etien, Stéphane Ducasse, and Kolyang Dina Taiwe",
            "AffiliationsString": "University of Maroua, Cameroon; INRIA, France",
            "Authors": [
                "Hayatou Oumarou @ University of Maroua, Cameroon",
                "Nicolas Anquetil @ INRIA, France",
                "Anne Etien @ INRIA, France",
                "Stéphane Ducasse @ INRIA, France",
                "Kolyang Dina Taiwe @ University of Maroua, Cameroon"
            ],
            "Affiliations": [
                "University of Maroua, Cameroon",
                "INRIA, France",
                "INRIA, France",
                "INRIA, France",
                "University of Maroua, Cameroon"
            ],
            "Abstract": "Abstract— We study good programming practices expressed in rules and detected by static analysis checkers such as PMD or FindBugs. To understand how violations to these rules are corrected and whether this can be automated, we need to identify in the source code where they appear and how they were fixed. This presents some similarities with research on understanding software bugs, their causes, their fixes, and how they could be avoided. The traditional method to identify how a bug or a rule violation were fixed consists in finding the commit that contains this fix and identifying what was changed in this commit. If the commit is small, all the lines changed are ascribed to the fixing of the rule violation or the bug. However, commits are not always atomic, and several fixes and even enhancements can be mixed in a single one (a large commit). In this case, it is impossible to detect which modifications contribute to which fix. In this paper, we are proposing a method that identifies precisely the modifications that are related to the correction of a rule violation. The same method could be applied to bug fixes, providing there is a test illustrating this bug. We validate our solution on a real world system and actual rules.",
            "Award": ""
        },
        {
            "Title": "CloCom: Mining Existing Source Code for Automatic Comment Generation",
            "Type": "Research Track",
            "Key": "saner15main-mainid121-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DEdmund+Wong%2C+Taiyue+Liu%2C+and+Lin+Tan+%22CloCom%3A+Mining+Existing+Source+Code+for+Automatic+Comment+Generation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Edmund Wong, Taiyue Liu, and Lin Tan",
            "AffiliationsString": "University of Waterloo, Canada",
            "Authors": [
                "Edmund Wong @ University of Waterloo, Canada",
                "Taiyue Liu @ University of Waterloo, Canada",
                "Lin Tan @ University of Waterloo, Canada"
            ],
            "Affiliations": [
                "University of Waterloo, Canada",
                "University of Waterloo, Canada",
                "University of Waterloo, Canada"
            ],
            "Abstract": "Code comments are an integral part of software development. They improve program comprehension and software maintainability. The lack of code comments is a common problem in the software industry. Therefore, it is beneficial to generate code comments automatically. In this paper, we propose a general approach to generate code comments automatically by analyzing existing software repositories. We apply code clone detection techniques to discover similar code segments and use the comments from some code segments to describe the other similar code segments. We leverage natural language processing techniques to select relevant comment sentences.  In our evaluation, we analyze 42 million lines of code from 1,005 open source projects from GitHub, and use them to generate 359 code comments for 21 Java projects. We manually evaluate the generated code comments and find that only 23.7% of the generated code comments are good. We report to the developers the good code comments, whose code segments do not have an existing code comment. Amongst the reported code comments, seven have been confirmed by the developers as good and committable to the software repository while the rest await for developers’ confirmation. Although our approach can generate good and committable comments, we still have to improve the yield and accuracy of the proposed approach before it can be used in practice with full automation.",
            "Award": ""
        },
        {
            "Title": "amAssist: In-IDE Ambient Search of Online Programming Resources",
            "Type": "Research Track",
            "Key": "saner15main-mainid92-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DHongwei+Li%2C+Xuejiao+Zhao%2C+Zhenchang+Xing%2C+Lingfeng+Bao%2C+Xin+Peng%2C+Dongjing+Gao%2C+and+Wenyun+Zhao+%22amAssist%3A+In-IDE+Ambient+Search+of+Online+Programming+Resources%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Hongwei Li, Xuejiao Zhao, Zhenchang Xing, Lingfeng Bao, Xin Peng, Dongjing Gao, and Wenyun Zhao",
            "AffiliationsString": "Fudan University, China; Jiangxi Normal University, China; Nanyang Technological University, Singapore; Zhejiang University, China",
            "Authors": [
                "Hongwei Li @ Fudan University, China / Jiangxi Normal University, China",
                "Xuejiao Zhao @ Nanyang Technological University, Singapore",
                "Zhenchang Xing @ Nanyang Technological University, Singapore",
                "Lingfeng Bao @ Zhejiang University, China",
                "Xin Peng @ Fudan University, China",
                "Dongjing Gao @ Fudan University, China",
                "Wenyun Zhao @ Fudan University, China"
            ],
            "Affiliations": [
                "Fudan University, China / Jiangxi Normal University, China",
                "Nanyang Technological University, Singapore",
                "Nanyang Technological University, Singapore",
                "Zhejiang University, China",
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China"
            ],
            "Abstract": "Developers work in the IDE, but search online resources in the web browser. The separation of the working and search context often cause the ignorance of the working context during online search. Several tools have been proposed to integrate the web browser into the IDE so that developers can search and use online resources directly in the IDE. These tools enable only the shallow integration of the web browser and the IDE. Some tools allow the developer to augment search queries with program entities in the current snapshot of the code. In this paper, we present an in-IDE ambient search agent to bridge the separation of the developer’s working context and search context. Our approach considers the developers’ working context in the IDE as a time-series stream of programming event observed from the developer’s interaction with the IDE over time. It supports the deeper integration of the working context in the entire search process from query formulation, custom search, to search results refinement and representation. We have implemented our ambient search agent and integrate it into the Eclipse IDE. We conducted a user study to evaluate our approach and the tool support. Our evaluation shows that our ambient search agent can better aid developers in searching and using online programming resources while working in the IDE.",
            "Award": ""
        },
        {
            "Title": "Reverse Engineering Time-Series Interaction Data from Screen-Captured Videos",
            "Type": "Research Track",
            "Key": "saner15main-mainid32-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLingfeng+Bao%2C+Jing+Li%2C+Zhenchang+Xing%2C+Xinyu+Wang%2C+and+Bo+Zhou+%22Reverse+Engineering+Time-Series+Interaction+Data+from+Screen-Captured+Videos%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Lingfeng Bao, Jing Li, Zhenchang Xing, Xinyu Wang, and Bo Zhou",
            "AffiliationsString": "Zhejiang University, China; Nanyang Technological University, Singapore",
            "Authors": [
                "Lingfeng Bao @ Zhejiang University, China",
                "Jing Li @ Nanyang Technological University, Singapore",
                "Zhenchang Xing @ Nanyang Technological University, Singapore",
                "Xinyu Wang @ Zhejiang University, China",
                "Bo Zhou @ Zhejiang University, China"
            ],
            "Affiliations": [
                "Zhejiang University, China",
                "Nanyang Technological University, Singapore",
                "Nanyang Technological University, Singapore",
                "Zhejiang University, China",
                "Zhejiang University, China"
            ],
            "Abstract": "In recent years the amount of research on human aspects of software engineering has increased. Many studies use screen-capture software (e.g., Snagit) to record developers&#039; behavior as they work on software development tasks. The recorded task videos capture direct information about which activities the developers carry out with which content and in which applications during the task. Such behavioral data can help researchers and practitioners understand and improve software engineering practices from human perspective. However, extracting time-series interaction data (software usage and application content) from screen-captured videos requires manual transcribing and coding of videos, which is tedious and error-prone. In this paper we present a computer-vision based video scraping technique to automatically reverse-engineer time-series interaction data from screen-captured videos. We report the usefulness, effectiveness and runtime performance of our video scraping technique using a case study of the 29 hours task videos of 20 developers in the two development tasks.",
            "Award": ""
        },
        {
            "Title": "Niche vs. Breadth: Calculating Expertise over Time through a Fine-Grained Analysis",
            "Type": "Research Track",
            "Key": "saner15main-mainid46-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJose+Ricardo+da+Silva+Junior%2C+Esteban+Clua%2C+Leonardo+Murta%2C+and+Anita+Sarma+%22Niche+vs.+Breadth%3A+Calculating+Expertise+over+Time+through+a+Fine-Grained+Analysis%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jose Ricardo da Silva Junior, Esteban Clua, Leonardo Murta, and Anita Sarma",
            "AffiliationsString": "Federal Fluminense University, Brazil; University of Nebraska-Lincoln, USA",
            "Authors": [
                "Jose Ricardo da Silva Junior @ Federal Fluminense University, Brazil",
                "Esteban Clua @ Federal Fluminense University, Brazil",
                "Leonardo Murta @ Federal Fluminense University, Brazil",
                "Anita Sarma @ University of Nebraska-Lincoln, USA"
            ],
            "Affiliations": [
                "Federal Fluminense University, Brazil",
                "Federal Fluminense University, Brazil",
                "Federal Fluminense University, Brazil",
                "University of Nebraska-Lincoln, USA"
            ],
            "Abstract": "Identifying expertise in a project is essential for task allocation, knowledge dissemination, and risk management, among other activities. However, keeping a detailed record of such expertise at class and method levels is cumbersome due to project size, evolution, and team turnover. Existing approaches that automate this task have limitations in terms of the number and granularity of elements that can be analyzed and the analysis timeframe. In this paper, we introduce a novel technique to identify expertise for a given project, package, file, class, or method by considering not only the total number of edits that a developer has made, but also the spread of their changes in an artifact over time, and thereby the breadth of their expertise. We use Dominoes – our GPU-based approach for exploratory repository analysis – for expertise identification over any given granularity and time period with a short processing time. We evaluated our approach through Apache Derby and observed that granularity and time can have significant influence on expertise identification.",
            "Award": ""
        },
        {
            "Title": "Protecting Web Applications via Unicode Extension",
            "Type": "Research Track",
            "Key": "saner15main-mainid108-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DBoze+Zekan%2C+Mark+Shtern%2C+and+Vassilios+Tzerpos+%22Protecting+Web+Applications+via+Unicode+Extension%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Boze Zekan, Mark Shtern, and Vassilios Tzerpos",
            "AffiliationsString": "York University, Canada",
            "Authors": [
                "Boze Zekan @ York University, Canada",
                "Mark Shtern @ York University, Canada",
                "Vassilios Tzerpos @ York University, Canada"
            ],
            "Affiliations": [
                "York University, Canada",
                "York University, Canada",
                "York University, Canada"
            ],
            "Abstract": "Protecting web applications against security attacks, such as command injection, is an issue that has been attracting increasing attention as such attacks are becoming more prevalent. Taint tracking is an approach that achieves protection while offering significant maintenance benefits when implemented at the language library level. This allows the transparent re-engineering of legacy web applications without the need to modify their source code. Such an approach can be implemented at either the string or the character level. We propose a new phase in the evolution of character-level taint tracking. Our approach provides all the benefits of existing methods, but it is not limited to a specific programming language. It also has a broader range within computing environments as it can easily propagate taint information between networks, servers, clients, applications, documents and operating systems. Finally, it allows a character&#039;s taint status to easily be stored in databases, files, and even in filenames. This paper presents our novel character-level taint mechanism. It also describes the web application re-engineering framework we constructed to demonstrate the benefits of our approach. Experiments with a prototype implementation of the framework showcase its usefulness.",
            "Award": ""
        },
        {
            "Title": "A Search-Based Approach to Multi-view Clustering of Software Systems",
            "Type": "Research Track",
            "Key": "saner15main-mainid114-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAmir+M.+Saeidi%2C+Jurriaan+Hage%2C+Ravi+Khadka%2C+and+Slinger+Jansen+%22A+Search-Based+Approach+to+Multi-view+Clustering+of+Software+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Amir M. Saeidi, Jurriaan Hage, Ravi Khadka, and Slinger Jansen",
            "AffiliationsString": "Utrecht University, Netherlands",
            "Authors": [
                "Amir M. Saeidi @ Utrecht University, Netherlands",
                "Jurriaan Hage @ Utrecht University, Netherlands",
                "Ravi Khadka @ Utrecht University, Netherlands",
                "Slinger Jansen @ Utrecht University, Netherlands"
            ],
            "Affiliations": [
                "Utrecht University, Netherlands",
                "Utrecht University, Netherlands",
                "Utrecht University, Netherlands",
                "Utrecht University, Netherlands"
            ],
            "Abstract": "Unsupervised software clustering is the problem of automatically decomposing the software system into meaningful units. Some approaches solely rely on the structure of the system, such as the module dependency graph, to decompose the software systems into cohesive groups of modules. Other techniques focus on the informal knowledge hidden within the source code itself to retrieve the modular architecture of the system. However both techniques in the case of large systems fail to produce decompositions that correspond to the actual architecture of the system. To overcome this problem, we propose a novel approach to clustering software systems by incorporating knowledge from different viewpoints of the system, such as the knowledge embedded within the source code as well as the structural dependencies within the system, to produce a clustering. In this setting, we adopt a search-based approach to the encoding of multi-view clustering and investigate two approaches to tackle this problem, one based on a linear combination of objectives into a single objective, the other a multi-objective approach to clustering. We evaluate our approach against a set of substantial software systems. The two approaches are evaluated on a dataset comprising of 10 Java open source projects. Finally, we propose two techniques based on interpolation and hierarchical clustering to combine different results obtained to yield a single result for single-objective and multi-objective encodings, respectively.",
            "Award": ""
        },
        {
            "Title": "CEL: Touching Software Modeling in Essence",
            "Type": "Research Track",
            "Key": "saner15main-mainid112-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRemo+Lemma%2C+Michele+Lanza%2C+and+Andrea+Mocci+%22CEL%3A+Touching+Software+Modeling+in+Essence%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Remo Lemma, Michele Lanza, and Andrea Mocci",
            "AffiliationsString": "University of Lugano, Switzerland",
            "Authors": [
                "Remo Lemma @ University of Lugano, Switzerland",
                "Michele Lanza @ University of Lugano, Switzerland",
                "Andrea Mocci @ University of Lugano, Switzerland"
            ],
            "Affiliations": [
                "University of Lugano, Switzerland",
                "University of Lugano, Switzerland",
                "University of Lugano, Switzerland"
            ],
            "Abstract": "Understanding a problem domain is a fundamental prerequisite for good software design. In object-oriented systems design, modeling is the fundamental first phase that focuses on identifying core concepts and their relations. How to properly support modeling is still an open problem, and existing approaches and tools can be very different in nature. On the one hand, lightweight ones, such as pen &amp; paper/whiteboard or CRC cards, are informal and support well the creative aspects of modeling, but produce artifacts that are difficult to store, process and reuse as documentation. On the other hand, more constrained and semi-formal ones, like UML, produce storable and processable structured artifacts with defined semantics, but this comes at the expense of creativity. We believe there exists a middle ground to investigate that maximizes the good of both worlds, that is, by supporting software modeling closer to its essence, with minimal constraints on the developer&#039;s creativity and still producing reusable structured artifacts. We also claim that modeling can be best treated by using the emerging technology of touch-based tablets. We present a novel gesture-based modeling approach based on a minimal set of constructs, and Cel, an iPad application, for rapidly creating, manipulating, and storing language agnostic object-oriented software models, which can be exported as skeleton source code in any language of choice. We assess our approach through a controlled qualitative study.",
            "Award": ""
        },
        {
            "Title": "NIRMAL: Automatic Identification of Software Relevant Tweets Leveraging Language Model",
            "Type": "Research Track",
            "Key": "saner15main-mainid77-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAbhishek+Sharma%2C+Yuan+Tian%2C+and+David+Lo+%22NIRMAL%3A+Automatic+Identification+of+Software+Relevant+Tweets+Leveraging+Language+Model%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Abhishek Sharma, Yuan Tian, and David Lo",
            "AffiliationsString": "Singapore Management University, Singapore",
            "Authors": [
                "Abhishek Sharma @ Singapore Management University, Singapore",
                "Yuan Tian @ Singapore Management University, Singapore",
                "David Lo @ Singapore Management University, Singapore"
            ],
            "Affiliations": [
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore"
            ],
            "Abstract": "Twitter is one of the most widely used social media platforms today. It enables users to share and view short 140- character messages called “tweets”. About 284 million active users generate close to 500 million tweets per day. Such rapid generation of user generated content in large magnitudes results in the problem of information overload. Users who are interested in information related to a particular domain have limited means to filter out irrelevant tweets and tend to get lost in the huge amount of data they encounter. A recent study by Singer et al. found that software developers use Twitter to stay aware of industry trends, to learn from others, and to network with other developers. However, Singer et al. also reported that developers often find Twitter streams to contain too much noise which is a barrier to the adoption of Twitter. In this paper, to help developers cope with noise, we propose a novel approach named NIRMAL, which automatically identifies software relevant tweets from a collection or stream of tweets. Our approach is based on language modeling which learns a statistical model based on a training corpus (i.e., set of documents). We make use of a subset of posts from StackOverflow, a programming question and answer site, as a training corpus to learn a language model. A corpus of tweets was then used to test the effectiveness of the trained language model. The tweets were sorted based on the rank the model assigned to each of the individual tweets. The top 200 tweets were then manually analyzed to verify whether they are software related or not, and then an accuracy score was calculated. The results show that decent accuracy scores can be achieved by various variants of NIRMAL, which indicates that NIRMAL can effectively identify software related tweets from a huge corpus of tweets.",
            "Award": ""
        },
        {
            "Title": "A Static Code Analysis Tool for Control System Software",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid21-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSreeja+Nair%2C+Raoul+Jetley%2C+Anil+Nair%2C+and+Stefan+Hauck-Stattelmann+%22A+Static+Code+Analysis+Tool+for+Control+System+Software%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Sreeja Nair, Raoul Jetley, Anil Nair, and Stefan Hauck-Stattelmann",
            "AffiliationsString": "ABB Research, India; ABB Research, Germany",
            "Authors": [
                "Sreeja Nair @ ABB Research, India",
                "Raoul Jetley @ ABB Research, India",
                "Anil Nair @ ABB Research, India",
                "Stefan Hauck-Stattelmann @ ABB Research, Germany"
            ],
            "Affiliations": [
                "ABB Research, India",
                "ABB Research, India",
                "ABB Research, India",
                "ABB Research, Germany"
            ],
            "Abstract": "Latent errors in control system software can be hard to detect through traditional testing techniques. Such errors, if left undetected, could manifest themselves as failures during run-time that could be potentially catastrophic and very expensive to fix. In this paper, we present a static code analysis approach to detect potential sources of such run-time errors during compile time itself, thus ensuring easy identification, safe execution and reducing the effort required during debugging. In order to detect run-time errors, the control system application is first parsed to generate a set of abstract syntax trees, which in turn are used to derive the control flow graph for the application. A hybrid algorithm, based on abstract interpretation and traditional data flow analysis techniques is used to check the control flow graph for type constraints, reachability and liveness properties. Additionally, the abstract syntax trees are used to check for datatype mismatches and compliance violations. A proof of concept prototype is implemented to demonstrate how the algorithm/approach can be used to analyze control applications developed using domain specific languages such as those complying with the IEC 61131-3 standard.",
            "Award": ""
        },
        {
            "Title": "RbG: A Documentation Generator for Scientific and Engineering Software",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid40-p",
            "URL": "https%3A%2F%2Fwww.researchgate.net%2Fprofile%2FJosef_Pichler%2Fpublication%2F271201440_RbG_A_Documentation_Generator_for_Scientific_and_Engineering_Software%2Flinks%2F54c0e4d00cf21674cea0726b.pdf%3Fev%3Dpub_int_doc_dl%26origin%3Dpublication_list%26inViewer%3Dtrue",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DagCzavCzc9s",
            "URLinfo": "http%3A%2F%2Fwww.scch.at%2Fen%2Frbg-tool",
            "DOI": "",
            "PersonsString": "Michael Moser, Josef Pichler, Günter Fleck, and Michael Witlatschil",
            "AffiliationsString": "Software Competence Center Hagenberg, Austria; Siemens Transformers Austria, Austria",
            "Authors": [
                "Michael Moser @ Software Competence Center Hagenberg, Austria",
                "Josef Pichler @ Software Competence Center Hagenberg, Austria",
                "Günter Fleck @ Siemens Transformers Austria, Austria",
                "Michael Witlatschil @ Siemens Transformers Austria, Austria"
            ],
            "Affiliations": [
                "Software Competence Center Hagenberg, Austria",
                "Software Competence Center Hagenberg, Austria",
                "Siemens Transformers Austria, Austria",
                "Siemens Transformers Austria, Austria"
            ],
            "Abstract": "This paper demonstrates RbG, a new tool intended for the generation of high-quality documentation from source code of scientific and engineering applications. RbG extracts mathematical formulae and decision tables from program statements by means of static code analysis and generates corresponding documentation in the Open Document Format or LaTeX. Annotations in source code comments are used to define the structure of the generated documents, include additional textual and graphical descriptions, and control extraction of formulae on a fine-grained level. Furthermore, RbG provides an interpreter to generate function plots for extracted formulae. In this tool demonstration we briefly introduce the tool and show its usage for different scenarios such as reverse engineering and re-documentation of legacy code and documentation generation during development and maintenance of software.",
            "Award": ""
        },
        {
            "Title": "Historef: A Tool for Edit History Refactoring",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid81-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DShinpei+Hayashi%2C+Daiki+Hoshino%2C+Jumpei+Matsuda%2C+Motoshi+Saeki%2C+Takayuki+Omori%2C+and+Katsuhisa+Maruyama+%22Historef%3A+A+Tool+for+Edit+History+Refactoring%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Shinpei Hayashi, Daiki Hoshino, Jumpei Matsuda, Motoshi Saeki, Takayuki Omori, and Katsuhisa Maruyama",
            "AffiliationsString": "Tokyo Institute of Technology, Japan; Ritsumeikan University, Japan",
            "Authors": [
                "Shinpei Hayashi @ Tokyo Institute of Technology, Japan",
                "Daiki Hoshino @ Tokyo Institute of Technology, Japan",
                "Jumpei Matsuda @ Tokyo Institute of Technology, Japan",
                "Motoshi Saeki @ Tokyo Institute of Technology, Japan",
                "Takayuki Omori @ Ritsumeikan University, Japan",
                "Katsuhisa Maruyama @ Ritsumeikan University, Japan"
            ],
            "Affiliations": [
                "Tokyo Institute of Technology, Japan",
                "Tokyo Institute of Technology, Japan",
                "Tokyo Institute of Technology, Japan",
                "Tokyo Institute of Technology, Japan",
                "Ritsumeikan University, Japan",
                "Ritsumeikan University, Japan"
            ],
            "Abstract": "This paper presents Historef, a tool for automating edit history refactoring on Eclipse IDE for Java programs. The aim of our history refactorings is to improve the understandability and/or usability of the history without changing its whole effect. Historef enables us to apply history refactorings to the recorded edit history in the middle of the source code editing process by a developer. By using our integrated tool, developers can commit the refactored edits into underlying SCM repository after applying edit history refactorings so that they are easy to manage their changes based on the performed edits.",
            "Award": ""
        },
        {
            "Title": "ClonePacker: A Tool for Clone Set Visualization",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid11-p",
            "URL": "http%3A%2F%2Fsdl.ist.osaka-u.ac.jp%2F%7Eh-murakm%2Fmurakami_SANER2015.pdf",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DdVRafm0XN6A",
            "URLinfo": "http%3A%2F%2Fsdl.ist.osaka-u.ac.jp%2F%7Eh-murakm%2Fclonepacker%2F",
            "DOI": "",
            "PersonsString": "Hiroaki Murakami, Yoshiki Higo, and Shinji Kusumoto",
            "AffiliationsString": "Osaka University, Japan",
            "Authors": [
                "Hiroaki Murakami @ Osaka University, Japan",
                "Yoshiki Higo @ Osaka University, Japan",
                "Shinji Kusumoto @ Osaka University, Japan"
            ],
            "Affiliations": [
                "Osaka University, Japan",
                "Osaka University, Japan",
                "Osaka University, Japan"
            ],
            "Abstract": "Programmers often copy and paste code fragments when they would like to reuse them. Although copy-and-paste operations enable programmers to realize rapid developments of software systems, it makes code clones. Some clones have negative impacts on software developments. For example, if we modify a code fragment, we have to check whether its clones need the same modification. In this case, programmers often use tools that take a code fragment as input and take its clones as output. However, when programmers use such existing tools, programmers have to open a number of source code and move up/down a scroll bar for browsing the detected clones. In order to reduce the cost of browsing the detected clones, we developed a tool that visualizes clones by using Circle Packing, named ClonePacker. As a result of an experiment with participants, we confirmed that participants using ClonePacker reported the locations of clones faster than an existing tool.",
            "Award": ""
        },
        {
            "Title": "GiLA: GitHub Label Analyzer",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid41-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJavier+Luis+C%C3%A1novas+Izquierdo%2C+Valerio+Cosentino%2C+Bel%C3%A9n+Rolandi%2C+Alexandre+Bergel%2C+and+Jordi+Cabot+%22GiLA%3A+GitHub+Label+Analyzer%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DqZ1PFBTcs2A",
            "URLinfo": "http%3A%2F%2Fatlanmod.github.io%2Fgila%2F",
            "DOI": "",
            "PersonsString": "Javier Luis Cánovas Izquierdo, Valerio Cosentino, Belén Rolandi, Alexandre Bergel, and Jordi Cabot",
            "AffiliationsString": "AtlanMod, France; University of Chile, Chile",
            "Authors": [
                "Javier Luis Cánovas Izquierdo @ AtlanMod, France",
                "Valerio Cosentino @ AtlanMod, France",
                "Belén Rolandi @ AtlanMod, France",
                "Alexandre Bergel @ University of Chile, Chile",
                "Jordi Cabot @ AtlanMod, France"
            ],
            "Affiliations": [
                "AtlanMod, France",
                "AtlanMod, France",
                "AtlanMod, France",
                "University of Chile, Chile",
                "AtlanMod, France"
            ],
            "Abstract": "Reporting bugs, asking for new features and in general giving any kind of feedback is a common way to contribute to an Open-Source Software (OSS) project. In GitHub, the largest code hosting service for OSS, this feedback is typically expressed as new issues for the project managed by an issue-tracking system available in each new project repository.  Among other features, the issue tracker allows creating and assigning labels to issues with the goal of helping the project community to better classify and manage those issues (e.g., facilitating the identification of issues for top priority components or candidate developers that could solve them). Nevertheless, as the project grows a manual browsing of the project issues is no longer feasible. In this paper we present GiLA, a tool which generates a set of visualizations to facilitate the analysis of issues in a project depending on their label-based categorization. We believe our visualizations are useful to see the most popular labels (and their relationships) in a project, identify the most active community members for those labels and compare the typical issue evolution for each label category.",
            "Award": ""
        },
        {
            "Title": "SPCP-Miner: A Tool for Mining Code Clones That Are Important for Refactoring or Tracking",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid55-p",
            "URL": "https%3A%2F%2Fhomepage.usask.ca%2F%7Emam815%2Fpapers%2Fsaner15tool-toolid55_preprint.pdf",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fembed%2FrZ57yeVd3VQ",
            "URLinfo": "https%3A%2F%2Fhomepage.usask.ca%2F%7Emam815%2Fspcpminer%2Findex.php",
            "DOI": "",
            "PersonsString": "Manishankar Mondal, Chanchal K. Roy, and Kevin A. Schneider",
            "AffiliationsString": "University of Saskatchewan, Canada",
            "Authors": [
                "Manishankar Mondal @ University of Saskatchewan, Canada",
                "Chanchal K. Roy @ University of Saskatchewan, Canada",
                "Kevin A. Schneider @ University of Saskatchewan, Canada"
            ],
            "Affiliations": [
                "University of Saskatchewan, Canada",
                "University of Saskatchewan, Canada",
                "University of Saskatchewan, Canada"
            ],
            "Abstract": "Code cloning has both positive and negative impacts on software maintenance and evolution. Focusing on the issues related to code cloning, researchers suggest to manage code clones through refactoring and tracking. However, it is impractical to refactor or track all clones in a software system. Thus, it is essential to identify which clones are important for refactoring and also, which clones are important for tracking. In this paper, we present a tool called SPCP-Miner which is the pioneer one to automatically identify and rank the important refactoring as well as important tracking candidates from the whole set of clones in a software system. SPCP-Miner implements the existing techniques that we used to conduct a large scale empirical study on SPCP clones (i.e., the clones that evolved following a Similarity Preserving Change Pattern called SPCP). We believe that SPCP-Miner can help us in better management of code clones by suggesting important clones for refactoring or tracking.",
            "Award": ""
        },
        {
            "Title": "TracerJD: Generic Trace-Based Dynamic Dependence Analysis with Fine-Grained Logging",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid65-p",
            "URL": "http%3A%2F%2Fwww3.nd.edu%2F%7Ehcai%2Fpubs%2Fsaner15-b.pdf",
            "URLvideo": "http%3A%2F%2Fyoutu.be%2FHR_rNX9K5IU",
            "URLinfo": "http%3A%2F%2Fwww3.nd.edu%2F%7Ehcai%2Ftracer%2F",
            "DOI": "",
            "PersonsString": "Haipeng Cai and Raul Santelices",
            "AffiliationsString": "University of Notre Dame, USA",
            "Authors": [
                "Haipeng Cai @ University of Notre Dame, USA",
                "Raul Santelices @ University of Notre Dame, USA"
            ],
            "Affiliations": [
                "University of Notre Dame, USA",
                "University of Notre Dame, USA"
            ],
            "Abstract": "We present the design and implementation of TraceJD, a toolkit devoted to dynamic dependence analysis via fine-grained whole-program dependence tracing. TraceJD features a generic framework for efficient offline analysis of dynamic dependencies, including those due to exception-driven control flows. Underlying the framework is a hierarchical trace indexing scheme by which TraceJD maintains the relationships among execution events at multiple levels of granularity while capturing those events at runtime. Built on this framework, several application tools are provided as well, including a dynamic slicer and a performance profiler. These example applications also demonstrate the flexibility and ease with which a variety of client analyses can be built based on the framework. We tested our toolkit on four Java subjects, for which the results suggest promising efficiency of TraceJD for its practical use in various dependence-based tasks.",
            "Award": ""
        },
        {
            "Title": "Umple: A Framework for Model Driven Development of Object-Oriented Systems",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid66-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMiguel+A.+Garz%C3%B3n%2C+Hamoud+Aljamaan%2C+and+Timothy+C.+Lethbridge+%22Umple%3A+A+Framework+for+Model+Driven+Development+of+Object-Oriented+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Miguel A. Garzón, Hamoud Aljamaan, and Timothy C. Lethbridge",
            "AffiliationsString": "University of Ottawa, Canada",
            "Authors": [
                "Miguel A. Garzón @ University of Ottawa, Canada",
                "Hamoud Aljamaan @ University of Ottawa, Canada",
                "Timothy C. Lethbridge @ University of Ottawa, Canada"
            ],
            "Affiliations": [
                "University of Ottawa, Canada",
                "University of Ottawa, Canada",
                "University of Ottawa, Canada"
            ],
            "Abstract": "Huge benefits are gained when Model Driven Engineering are adopted to develop software systems. However, it remains a challenge for software modelers to embrace the MDE approach. In this paper, we present Umple, a framework for Model Driven Development in Object-Oriented Systems that can be used to generate entire software systems (Model Driven Forward Engineering) or to recover the models from existing software systems (Model Driven Reverse Engineering). Umple models are written using a friendly human-readable modeling notation seamlessly integrated with algorithmic code. In other words, we present a model-is-the-code approach, where developers are more likely to maintain and evolve the code as the system matures simply by the fact that both model and code are integrated as aspects of the same system. Finally, we demonstrate how the framework can be used to elaborate on solutions supporting different scenarios such as software modernization and program comprehension.",
            "Award": ""
        },
        {
            "Title": "Assessing the Bus Factor of Git Repositories",
            "Type": "Tool Paper",
            "Key": "saner15tool-toolid37-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DValerio+Cosentino%2C+Javier+Luis+C%C3%A1novas+Izquierdo%2C+and+Jordi+Cabot+%22Assessing+the+Bus+Factor+of+Git+Repositories%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dfo9qy0ksX0Q",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Valerio Cosentino, Javier Luis Cánovas Izquierdo, and Jordi Cabot",
            "AffiliationsString": "AtlanMod, France",
            "Authors": [
                "Valerio Cosentino @ AtlanMod, France",
                "Javier Luis Cánovas Izquierdo @ AtlanMod, France",
                "Jordi Cabot @ AtlanMod, France"
            ],
            "Affiliations": [
                "AtlanMod, France",
                "AtlanMod, France",
                "AtlanMod, France"
            ],
            "Abstract": "Software development projects face a lot of risks (requirements inflation, poor scheduling, technical problems, etc.). Underestimating those risks may put in danger the project success. One of the most critical risks is the employee turnover, that is the risk of key personnel leaving the project. A good indicator to evaluate this risk is to measure the concentration of information in individual developers. This is also popularly known as the bus factor (“number of key developers who would need to be incapacitated, i.e. hit by a bus, to make a project unable to proceed”). Despite the simplicity of the concept, calculating the actual bus factor for specific projects can quickly turn into an errorprone and time-consuming activity as soon as the size of the project and development team increase. In order to help project managers to assess the bus factor of their projects, in this paper we present a tool that, given a Git-based repository, automatically measures the bus factor for any file, directory and branch in the repository and for the project itself. You can also simulate with the tool what would happen to the project (e.g., which files would become orphans) if one or more developers disappeared.",
            "Award": ""
        },
        {
            "Title": "Old Habits Die Hard: Why Refactoring for Understandability Does Not Give Immediate Benefits",
            "Type": "Industrial Paper",
            "Key": "saner15ind-indid46-p",
            "URL": "http%3A%2F%2Fwww.st.ewi.tudelft.nl%2F%7Ezaidman%2Fpublications%2FammerlaanSANER2015.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Erik Ammerlaan, Wim Veninga, and Andy Zaidman",
            "AffiliationsString": "Exact International Development, Netherlands; Delft University of Technology, Netherlands",
            "Authors": [
                "Erik Ammerlaan @ Exact International Development, Netherlands",
                "Wim Veninga @ Exact International Development, Netherlands",
                "Andy Zaidman @ Delft University of Technology, Netherlands"
            ],
            "Affiliations": [
                "Exact International Development, Netherlands",
                "Exact International Development, Netherlands",
                "Delft University of Technology, Netherlands"
            ],
            "Abstract": "Depending on the context, the benefits of clean code with respect to understandability might be less obvious in the short term than is often claimed. In this study we evaluate whether a software system with legacy code in an industrial environment benefits from a “clean code” refactoring in terms of developer productivity. We observed both increases as well as decreases in understandability, showing that immediate increases in understandability are not always obvious. Our study suggests that refactoring code could result in a productivity penalty in the short term if the coding style becomes different from the style developers have grown attached to.",
            "Award": ""
        },
        {
            "Title": "Bash2py: A Bash to Python Translator",
            "Type": "Industrial Paper",
            "Key": "saner15ind-indid56-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DIan+J.+Davis%2C+Mike+Wexler%2C+Cheng+Zhang%2C+Richard+C.+Holt%2C+and+Theresa+Weber+%22Bash2py%3A+A+Bash+to+Python+Translator%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Ian J. Davis, Mike Wexler, Cheng Zhang, Richard C. Holt, and Theresa Weber",
            "AffiliationsString": "University of Waterloo, Canada; Owl Computing Technologies, USA",
            "Authors": [
                "Ian J. Davis @ University of Waterloo, Canada",
                "Mike Wexler @ University of Waterloo, Canada",
                "Cheng Zhang @ University of Waterloo, Canada",
                "Richard C. Holt @ University of Waterloo, Canada",
                "Theresa Weber @ Owl Computing Technologies, USA"
            ],
            "Affiliations": [
                "University of Waterloo, Canada",
                "University of Waterloo, Canada",
                "University of Waterloo, Canada",
                "University of Waterloo, Canada",
                "Owl Computing Technologies, USA"
            ],
            "Abstract": "Shell scripting is the primary way for programmers to interact at a high level with operating systems. For decades bash shell scripts have thus been used to accomplish various tasks. But Bash has a counter-intuitive syntax that is not well understood by modern programmers and is no longer adequately supported, making it now difficult to maintain. Bash also suffers from poor performance, memory leakage problems, and limited functionality which make continued dependence on it problematic. At the request of our industrial partner, we therefore developed a source-to-source translator, bash2py, which converts bash scripts into Python. Bash2py leverages the open source bash code, and the internal parser employed by Bash to parse any bash script. However, bash2py re-implements the variable expansion that occurs in Bash to better generate correct Python code. Bash2py correctly converts most Bash into Python, but does require human intervention to handle constructs that cannot easily be automatically translated. In our experiments on real-world open source bash scripts bash2py successfully translates 90% of the code. Feedback from our industrial partner confirms the usefulness of bash2py in practice.",
            "Award": ""
        },
        {
            "Title": "On Implementational Variations in Static Analysis Tools",
            "Type": "Industrial Paper",
            "Key": "saner15ind-indid35-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTukaram+Muske+and+Prasad+Bokil+%22On+Implementational+Variations+in+Static+Analysis+Tools%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tukaram Muske and Prasad Bokil",
            "AffiliationsString": "Tata Consultancy Services, India",
            "Authors": [
                "Tukaram Muske @ Tata Consultancy Services, India",
                "Prasad Bokil @ Tata Consultancy Services, India"
            ],
            "Affiliations": [
                "Tata Consultancy Services, India",
                "Tata Consultancy Services, India"
            ],
            "Abstract": "Static analysis tools are widely used in practice due to their ability to detect defects early in the software development life-cycle and that too while proving absence of defects of certain patterns. There exists a large number of such tools, and they are found to be varying depending on several tool characteristics like analysis techniques, programming languages supported, verification checks performed, scalability, and performance. Many studies about these tools and their variations, have been performed to improve the analysis results or figure out a better tool amongst a set of available static analysis tools. It is our observation that, in these studies only the aforementioned tool characteristics are considered and compared, and other implementational variations are usually ignored. In this paper, we study the implementational variations occurring among the static analysis tools, and experimentally demonstrate their impact on the tool characteristics and other analysis related attributes. The aim of this paper is twofold - a) to provide the studied implementational variations as choices, along with their pros and cons, to the designers or developers of static analysis tools, and b) to provide an educating material to the tool users so that the analysis results are better understood.",
            "Award": ""
        },
        {
            "Title": "Tracking Known Security Vulnerabilities in Proprietary Software Systems",
            "Type": "Industrial Paper",
            "Key": "saner15ind-indid90-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMircea+Cadariu%2C+Eric+Bouwers%2C+Joost+Visser%2C+and+Arie+van+Deursen+%22Tracking+Known+Security+Vulnerabilities+in+Proprietary+Software+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mircea Cadariu, Eric Bouwers, Joost Visser, and Arie van Deursen",
            "AffiliationsString": "Software Improvement Group, Netherlands; Delft University of Technology, Netherlands; Radboud University Nijmegen, Netherlands",
            "Authors": [
                "Mircea Cadariu @ Software Improvement Group, Netherlands / Delft University of Technology, Netherlands",
                "Eric Bouwers @ Software Improvement Group, Netherlands",
                "Joost Visser @ Software Improvement Group, Netherlands / Radboud University Nijmegen, Netherlands",
                "Arie van Deursen @ Delft University of Technology, Netherlands"
            ],
            "Affiliations": [
                "Software Improvement Group, Netherlands / Delft University of Technology, Netherlands",
                "Software Improvement Group, Netherlands",
                "Software Improvement Group, Netherlands / Radboud University Nijmegen, Netherlands",
                "Delft University of Technology, Netherlands"
            ],
            "Abstract": "Known security vulnerabilities can be introduced in software systems as a result of being dependent upon third-party components. These documented software weaknesses are “hiding in plain sight” and represent low hanging fruit for attackers. In this paper we present the Vulnerability Alert Service (VAS), a tool-based process to track known vulnerabilities in software systems throughout their life cycle. We studied its usefulness in the context of external software product quality monitoring provided by the Software Improvement Group, a software ad- visory company based in Amsterdam, the Netherlands. Besides empirically assessing the usefulness of the VAS, we have also leveraged it to gain insight and report on the prevalence of third-party components with known security vulnerabilities in proprietary applications.",
            "Award": ""
        },
        {
            "Title": "TextRank Based Search Term Identification for Software Change Tasks",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid74-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMohammad+Masudur+Rahman+and+Chanchal+K.+Roy+%22TextRank+Based+Search+Term+Identification+for+Software+Change+Tasks%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mohammad Masudur Rahman and Chanchal K. Roy",
            "AffiliationsString": "University of Saskatchewan, Canada",
            "Authors": [
                "Mohammad Masudur Rahman @ University of Saskatchewan, Canada",
                "Chanchal K. Roy @ University of Saskatchewan, Canada"
            ],
            "Affiliations": [
                "University of Saskatchewan, Canada",
                "University of Saskatchewan, Canada"
            ],
            "Abstract": "During maintenance, software developers deal with a number of software change requests. Each of those requests is generally written using natural language texts, and it involves one or more domain related concepts. A developer needs to map those concepts to exact source code locations within the project in order to implement the requested change. This mapping generally starts with a search within the project that requires one or more suitable search terms. Studies suggest that the developers often perform poorly in coming up with good search terms for a change task. In this paper, we propose and evaluate a novel TextRank-based technique that automatically identifies and suggests search terms for a software change task by analyzing its task description. Experiments with 349 change tasks from two subject systems and comparison with one of the latest and closely related state-of-the-art approaches show that our technique is highly promising in terms of suggestion accuracy, mean average precision and recall.",
            "Award": ""
        },
        {
            "Title": "Query Expansion via Wordnet for Effective Code Search",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid44-p",
            "URL": "http%3A%2F%2Fwww.risame.net%2Fsun%2Fquery.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Meili Lu, Xiaobing Sun, Shaowei Wang, David Lo, and Yucong Duan",
            "AffiliationsString": "Yangzhou University, China; Nanjing University, China; Singapore Management University, Singapore; Hainan University, China",
            "Authors": [
                "Meili Lu @ Yangzhou University, China",
                "Xiaobing Sun @ Yangzhou University, China / Nanjing University, China",
                "Shaowei Wang @ Singapore Management University, Singapore",
                "David Lo @ Singapore Management University, Singapore",
                "Yucong Duan @ Hainan University, China"
            ],
            "Affiliations": [
                "Yangzhou University, China",
                "Yangzhou University, China / Nanjing University, China",
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore",
                "Hainan University, China"
            ],
            "Abstract": "Source code search plays an important role in software maintenance. The effectiveness of source code search not only relies on the search technique, but also on the quality of the query. In practice, software systems are large, thus it is difficult for a developer to format an accurate query to express what really in her/his mind, especially when the maintainer and the original developer are not the same person. When a query performs poorly, it has to be reformulated. But the words used in a query may be different from those that have similar semantics in the source code, i.e., the synonyms, which will affect the accuracy of code search results. To address this issue, we propose an approach that extends a query with synonyms generated from WordNet. Our approach extracts natural language phrases from source code identifiers, matches expanded queries with these phrases, and sorts the search results. It allows developers to explore word usage in a piece of software, helps them quickly identify relevant program elements for investigation or quickly recognize alternative words for query reformulation. Our initial empirical study on search tasks performed on the JavaScript/ECMAScript interpreter and compiler, Rhino, shows that the synonyms used to expand the queries help recommend good alternative queries. Our approach also improves the precision and recall of Conquer, a state-of-the-art query expansion/reformulation technique, by 5% and 8% respectively.",
            "Award": ""
        },
        {
            "Title": "Evolution of Dynamic Feature Usage in PHP",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid78-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMark+Hills+%22Evolution+of+Dynamic+Feature+Usage+in+PHP%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mark Hills",
            "AffiliationsString": "East Carolina University, USA",
            "Authors": [
                "Mark Hills @ East Carolina University, USA"
            ],
            "Affiliations": [
                "East Carolina University, USA"
            ],
            "Abstract": "PHP includes a number of dynamic features that, if used, make it challenging for both programmers and tools to reason about programs. In this paper we examine how usage of these features has changed over time, looking at usage trends for three categories of dynamic features across the release histories of two popular open-source PHP systems, WordPress and MediaWiki. Our initial results suggest that, while features such as eval are being removed over time, more constrained dynamic features such as variable properties are becoming more common. We believe the results of this analysis provide useful insights for researchers and tool developers into the evolving use of dynamic features in real PHP programs.",
            "Award": ""
        },
        {
            "Title": "Understanding Software Performance Regressions using Differential Flame Graphs",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid10-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DCor-Paul+Bezemer%2C+Johan+Pouwelse%2C+and+Brendan+Gregg+%22Understanding+Software+Performance+Regressions+using+Differential+Flame+Graphs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Cor-Paul Bezemer, Johan Pouwelse, and Brendan Gregg",
            "AffiliationsString": "Delft University of Technology, Netherlands; Netflix, USA",
            "Authors": [
                "Cor-Paul Bezemer @ Delft University of Technology, Netherlands",
                "Johan Pouwelse @ Delft University of Technology, Netherlands",
                "Brendan Gregg @ Netflix, USA"
            ],
            "Affiliations": [
                "Delft University of Technology, Netherlands",
                "Delft University of Technology, Netherlands",
                "Netflix, USA"
            ],
            "Abstract": "Flame graphs are gaining rapidly in popularity in industry to visualize performance profiles collected by stack-trace based profilers. In some cases, for example, during performance regression detection, profiles of different software versions have to be compared. Doing this manually using two or more flame graphs or textual profiles is tedious and error-prone. In this `Early Research Achievements&#039;-track paper, we present our preliminary results on using differential flame graphs instead. Differential flame graphs visualize the differences between two performance profiles. In addition, we discuss which research fields we expect to benefit from using differential flame graphs. We have implemented our approach in an open source prototype called FlameGraphDiff, which is available on GitHub. FlameGraphDiff makes it easy to generate interactive differential flame graphs from two existing performance profiles. These graphs facilitate easy tracing of elements in the different graphs to ease the understanding of the (d)evolution of the performance of an application.",
            "Award": ""
        },
        {
            "Title": "Code Coverage and Test Suite Effectiveness: Empirical Study with Real Bugs in Large Systems",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid25-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPavneet+Singh+Kochhar%2C+Ferdian+Thung%2C+and+David+Lo+%22Code+Coverage+and+Test+Suite+Effectiveness%3A+Empirical+Study+with+Real+Bugs+in+Large+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Pavneet Singh Kochhar, Ferdian Thung, and David Lo",
            "AffiliationsString": "Singapore Management University, Singapore",
            "Authors": [
                "Pavneet Singh Kochhar @ Singapore Management University, Singapore",
                "Ferdian Thung @ Singapore Management University, Singapore",
                "David Lo @ Singapore Management University, Singapore"
            ],
            "Affiliations": [
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore"
            ],
            "Abstract": "During software maintenance, testing is a crucial activity to ensure the quality of program code as it evolves over time. With the increasing size and complexity of software, adequate software testing has become increasingly important. Code coverage is often used as a yardstick to gauge the comprehensiveness of test cases and the adequacy of testing. A test suite quality is often measured by the number of bugs it can find (aka. kill). Previous studies have analysed the quality of a test suite by its ability to kill mutants, i.e., artificially seeded faults. However, mutants do not necessarily represent real bugs. Moreover, many studies use small programs which increases the threat of the applicability of the results on large real-world systems.  In this paper, we analyse two large software systems to measure the relationship of code coverage and its effectiveness in killing real bugs from the software systems. We use Randoop, a random test generation tool to generate test suites with varying levels of coverage and run them to analyse if the test suites can kill each of the real bugs or not. In this preliminary study, we have performed an experiment on 67 and 92 real bugs from Apache HTTPClient and Mozilla Rhino, respectively. Our experiment finds that there is indeed statistically significant correlation between code coverage and bug kill effectiveness. The strengths of the correlation, however, differ for the two software systems. For HTTPClient, the correlation is moderate for both statement and branch coverage. For Rhino, the correlation is strong for both statement and branch coverage.",
            "Award": ""
        },
        {
            "Title": "Towards Incremental Model Slicing for Delta-Oriented Software Product Lines",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid30-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSascha+Lity%2C+Hauke+Baller%2C+and+Ina+Schaefer+%22Towards+Incremental+Model+Slicing+for+Delta-Oriented+Software+Product+Lines%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Sascha Lity, Hauke Baller, and Ina Schaefer",
            "AffiliationsString": "TU Braunschweig, Germany",
            "Authors": [
                "Sascha Lity @ TU Braunschweig, Germany",
                "Hauke Baller @ TU Braunschweig, Germany",
                "Ina Schaefer @ TU Braunschweig, Germany"
            ],
            "Affiliations": [
                "TU Braunschweig, Germany",
                "TU Braunschweig, Germany",
                "TU Braunschweig, Germany"
            ],
            "Abstract": "The analysis of nowadays software systems for supporting, e.g., testing, verification or debugging is becoming more challenging due to their increasing complexity. Model slicing is a promising analysis technique to tackle this issue by abstracting from those parts not influencing the current point of interest. In the context of software product lines, applying model slicing separately for each variant is in general infeasible. Delta modeling allows exploiting the explicit specification of commonality and variability within deltas and enables the reuse of artifacts and already obtained results to reduce the modeling and analysis efforts. In this paper, we propose a novel approach for incremental model slicing for delta-oriented software product lines. Based on the specification of model changes between variants by means of model regression deltas, an incremental adaptation of variant-specific dependency graphs as well as an incremental slice computation is achieved. The slice computation further allows for the derivation of differences between slices for the same point of interest enhancing, e.g., change impact analysis. We provide details of our incremental approach, discuss benefits and present future work.",
            "Award": ""
        },
        {
            "Title": "Detection of Violation Causes in Reflexion Models",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid32-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSebastian+Herold%2C+Michael+English%2C+Jim+Buckley%2C+Steve+Counsell%2C+and+Mel+%C3%93+Cinn%C3%A9ide+%22Detection+of+Violation+Causes+in+Reflexion+Models%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Sebastian Herold, Michael English, Jim Buckley, Steve Counsell, and Mel Ó Cinnéide",
            "AffiliationsString": "Lero, Ireland; University of Limerick, Ireland; Brunel University, UK; University College Dublin, Ireland",
            "Authors": [
                "Sebastian Herold @ Lero, Ireland / University of Limerick, Ireland",
                "Michael English @ Lero, Ireland / University of Limerick, Ireland",
                "Jim Buckley @ Lero, Ireland / University of Limerick, Ireland",
                "Steve Counsell @ Brunel University, UK",
                "Mel Ó Cinnéide @ University College Dublin, Ireland"
            ],
            "Affiliations": [
                "Lero, Ireland / University of Limerick, Ireland",
                "Lero, Ireland / University of Limerick, Ireland",
                "Lero, Ireland / University of Limerick, Ireland",
                "Brunel University, UK",
                "University College Dublin, Ireland"
            ],
            "Abstract": "Reflexion Modelling is a well-understood technique to detect architectural violations that occur during software architecture erosion. Resolving these violations can be difficult when erosion has reached a critical level and the causes of the violations are interwoven and difficult to understand. This article outlines a novel technique to automatically detect typical causes of violations in reflexion models, based on the definition and detection of typical symptoms for these causes. Preliminary results show that the proposed technique can support software architects’ navigation through reflexion models of eroded systems to understand causes of violations and to systematically take actions against them.",
            "Award": ""
        },
        {
            "Title": "Exploring the Use of Labels to Categorize Issues in Open-Source Software Projects",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid39-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJordi+Cabot%2C+Javier+Luis+C%C3%A1novas+Izquierdo%2C+Valerio+Cosentino%2C+and+Bel%C3%A9n+Rolandi+%22Exploring+the+Use+of+Labels+to+Categorize+Issues+in+Open-Source+Software+Projects%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jordi Cabot, Javier Luis Cánovas Izquierdo, Valerio Cosentino, and Belén Rolandi",
            "AffiliationsString": "AtlanMod, France",
            "Authors": [
                "Jordi Cabot @ AtlanMod, France",
                "Javier Luis Cánovas Izquierdo @ AtlanMod, France",
                "Valerio Cosentino @ AtlanMod, France",
                "Belén Rolandi @ AtlanMod, France"
            ],
            "Affiliations": [
                "AtlanMod, France",
                "AtlanMod, France",
                "AtlanMod, France",
                "AtlanMod, France"
            ],
            "Abstract": "Reporting bugs, asking for new features and in general giving any kind of feedback is a common way to contribute to an Open-Source Software (OSS) project. This feedback is generally reported in the form of new issues for the project, managed by the so-called issue-trackers. One of the features provided by most issue-trackers is the possibility to define a set of labels/tags to classify the issues and, at least in theory, facilitate their management. Nevertheless, there is little empirical evidence to confirm that taking the time to categorize new issues has indeed a beneficial impact on the project evolution. In this paper we analyze a population of more than three million of GitHub projects and give some insights on how labels are used in them. Our preliminary results reveal that, even if the label mechanism is scarcely used, using labels favors the resolution of issues. Our analysis also suggests that not all projects use labels in the same way (e.g., for some labels are only a way to prioritize the project while others use them to signal their temporal evolution as they move along in the development workflow). Further research is needed to precisely characterize these label &quot;families&quot; and learn more the ideal application scenarios for each of them.",
            "Award": ""
        },
        {
            "Title": "Trusting a Library: A Study of the Latency to Adopt the Latest Maven Release",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid15-p",
            "URL": "http%3A%2F%2Fsel.ist.osaka-u.ac.jp%2F%7Eraula-k%2Fpublications%2FlatencyAdoptions2015ERA.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Raula Gaikovina Kula, Daniel M. German, Takashi Ishio, and Katsuro Inoue",
            "AffiliationsString": "Osaka University, Japan; University of Victoria, Canada",
            "Authors": [
                "Raula Gaikovina Kula @ Osaka University, Japan",
                "Daniel M. German @ Osaka University, Japan / University of Victoria, Canada",
                "Takashi Ishio @ Osaka University, Japan",
                "Katsuro Inoue @ Osaka University, Japan"
            ],
            "Affiliations": [
                "Osaka University, Japan",
                "Osaka University, Japan / University of Victoria, Canada",
                "Osaka University, Japan",
                "Osaka University, Japan"
            ],
            "Abstract": "With the popularity of open source library (re)use in both industrial and open source settings, `trust&#039; plays vital role in third-party library adoption. Trust involves the assumption of both functional and non-functional correctness. Even with the aid of dependency management build tools such as Maven and Gradle, research have still found a latency to trust the latest release of a library. In this paper, we investigate the trust of OSS libraries. Our study of 6,374 systems in Maven Super Repository suggests that 82% of systems are more trusting of adopting the latest library release to existing systems. We uncover the impact of maven on latent and trusted library adoptions.",
            "Award": ""
        },
        {
            "Title": "Efficiently Identifying Object Production Sites",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid14-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAlejandro+Infante+and+Alexandre+Bergel+%22Efficiently+Identifying+Object+Production+Sites%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Alejandro Infante and Alexandre Bergel",
            "AffiliationsString": "University of Chile, Chile",
            "Authors": [
                "Alejandro Infante @ University of Chile, Chile",
                "Alexandre Bergel @ University of Chile, Chile"
            ],
            "Affiliations": [
                "University of Chile, Chile",
                "University of Chile, Chile"
            ],
            "Abstract": "Most programming environments are shipped with accurate memory profilers. Although efficient in their analyses, memory profilers traditionally output textual listing reports, thus reducing the memory profile exploration as a set of textual pattern-matching operations. Memory blueprint visually reports the memory consumption of a program execution. A number of simple visual cues are provided to identify direct and indirect object production sites, key ingredients to efficiently address memory issues. Scalability is addressed by restricting the scope of interest both in the call graph and the considered classes. Memory blueprint has been implemented in the Pharo programming language, and is available under the MIT license.",
            "Award": ""
        },
        {
            "Title": "Explore the Evolution of Development Topics via On-Line LDA",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid27-p",
            "URL": "http%3A%2F%2Fwww.risame.net%2Fsun%2Fsaner.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jiajun Hu, Xiaobing Sun, and Bin Li",
            "AffiliationsString": "Yangzhou University, China; Nanjing University, China",
            "Authors": [
                "Jiajun Hu @ Yangzhou University, China",
                "Xiaobing Sun @ Yangzhou University, China / Nanjing University, China",
                "Bin Li @ Yangzhou University, China / Nanjing University, China"
            ],
            "Affiliations": [
                "Yangzhou University, China",
                "Yangzhou University, China / Nanjing University, China",
                "Yangzhou University, China / Nanjing University, China"
            ],
            "Abstract": "Software repositories such as revision control systems and bug tracking systems are usually used to manage the changes of software projects. During software maintenance and evolution, software developers and stakeholders need to investigate these repositories to identify what tasks were worked on in a particular time interval and how much effort was devoted to them. A typical way of mining software repositories is to use topic analysis models, e.g., Latent Dirichlet Allocation (LDA), to identify and organize the underlying structure in software documents to understand the evolution of development topics. These previously LDA-based topic analysis models can capture either changes on the strength (popularity) of various development topics over time (i.e., strength evolution) or changes in the content (the words that form the topic) of existing topics over time (i.e., content evolution). Unfortunately, few techniques can capture both strength and content evolution simultaneously. However, both pieces of information are necessary for developers to fully understand how software evolves. In this paper, we propose a novel approach to analyze commit messages within a project’s lifetime to capture both strength and content evolution simultaneously via Online Latent Dirichlet Allocation (On-Line LDA). Moreover, the proposed approach also provides an efficient way to detect emerging topics in real development iteration when a new feature request arrives at a particular time, thus helping project stakeholds progress their projects smoothly.",
            "Award": ""
        },
        {
            "Title": "Where Was This SQL Query Executed? A Static Concept Location Approach",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid50-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DCsaba+Nagy%2C+Loup+Meurice%2C+and+Anthony+Cleve+%22Where+Was+This+SQL+Query+Executed%3F+A+Static+Concept+Location+Approach%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Csaba Nagy, Loup Meurice, and Anthony Cleve",
            "AffiliationsString": "University of Namur, Belgium",
            "Authors": [
                "Csaba Nagy @ University of Namur, Belgium",
                "Loup Meurice @ University of Namur, Belgium",
                "Anthony Cleve @ University of Namur, Belgium"
            ],
            "Affiliations": [
                "University of Namur, Belgium",
                "University of Namur, Belgium",
                "University of Namur, Belgium"
            ],
            "Abstract": "Concept location in software engineering is the process of identifying where a specific concept is implemented in the source code of a software system. It is a very common task performed by developers during development or maintenance, and many techniques have been studied by researchers to make it more efficient. However, most of the current techniques ignore the role of a database in the architecture of a system, which is also an important source of concepts or dependencies among them. In this paper, we present a concept location technique for data-intensive systems, as systems with at least one database server in their architecture which is intensively used by its clients. Specifically, we present a static technique for identifying the exact source code location from where a given SQL query was sent to the database. We evaluate our technique by collecting and locating SQL queries from testing scenarios of two open source Java systems under active development. With our technique, we are able to successfully identify the source of most of these queries.",
            "Award": ""
        },
        {
            "Title": "Taint Analysis of Manual Service Compositions using Cross-Application Call Graphs",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid77-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMarc-Andr%C3%A9+Laverdi%C3%A8re%2C+Bernhard+J.+Berger%2C+and+Ettore+Merlo+%22Taint+Analysis+of+Manual+Service+Compositions+using+Cross-Application+Call+Graphs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Marc-André Laverdière, Bernhard J. Berger, and Ettore Merlo",
            "AffiliationsString": "Tata Consultancy Services, Canada; Polytechnique Montréal, Canada; University of Bremen, Germany",
            "Authors": [
                "Marc-André Laverdière @ Tata Consultancy Services, Canada / Polytechnique Montréal, Canada",
                "Bernhard J. Berger @ University of Bremen, Germany",
                "Ettore Merlo @ Polytechnique Montréal, Canada"
            ],
            "Affiliations": [
                "Tata Consultancy Services, Canada / Polytechnique Montréal, Canada",
                "University of Bremen, Germany",
                "Polytechnique Montréal, Canada"
            ],
            "Abstract": "We propose an extension over the traditional call graph to incorporate edges representing control flow between web services, named the Cross-Application Call Graph (CACG). We introduce a construction algorithm for applications built on the Jax-WS standard and validate its effectiveness on sample applications from Apache CXF and JBossWS. Then, we demonstrate its applicability for taint analysis over a sample application of our making. Our CACG construction algorithm accurately identifies service call targets 81.07% of the time on average. Our taint analysis obtains a F-Measure of 95.60% over a benchmark. The use of a CACG, compared to a naive approach, improves the F-Measure of a taint analysis from 66.67% to 100.00% for our sample application.",
            "Award": ""
        },
        {
            "Title": "A Comparative Study on the Effectiveness of Part-of-Speech Tagging Techniques on Bug Reports",
            "Type": "Short Paper 5 pages",
            "Key": "saner15era-eraid31-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYuan+Tian+and+David+Lo+%22A+Comparative+Study+on+the+Effectiveness+of+Part-of-Speech+Tagging+Techniques+on+Bug+Reports%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Yuan Tian and David Lo",
            "AffiliationsString": "Singapore Management University, Singapore",
            "Authors": [
                "Yuan Tian @ Singapore Management University, Singapore",
                "David Lo @ Singapore Management University, Singapore"
            ],
            "Affiliations": [
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore"
            ],
            "Abstract": "Many software artifacts are written in natural language or contain substantial amount of natural language contents. Thus these artifacts could be analyzed using text analysis techniques from the natural language processing (NLP) community, e.g., the part-of-speech (POS) tagging technique that assigns POS tags (e.g., verb, noun, etc.) to words in a sentence. In the literature, several studies have already applied POS tagging technique on software artifacts to recover important words in them, which are then used for automating various tasks, e.g., locating buggy files for a given bug report, etc. There are many POS tagging techniques proposed and they are trained and evaluated on non software engineering corpus (documents). Thus it is unknown whether they can correctly identify the POS of a word in a software artifact and which of them performs the best. To fill this gap, in this work, we investigate the effectiveness of seven POS taggers on bug reports. We randomly sample 100 bug reports from Eclipse and Mozilla project and create a text corpus that contains 21,713 words. We manually assign POS tags to these words and use them to evaluate the studied POS taggers. Our comparative study shows that the state-of-the-art POS taggers achieve an accuracy of 83.6%-90.5% on bug reports and the Stanford POS tagger and the TreeTagger achieve the highest accuracy on the sampled bug reports. Our findings show that researchers could use these POS taggers to analyze software artifacts, if an accuracy of 80-90% is acceptable for their specific needs, and we recommend using the Stanford POS tagger or the TreeTagger.",
            "Award": ""
        },
        {
            "Title": "TXL Source Transformation in Practice",
            "Type": "Tutorial",
            "Key": "saner15tut-tutt1-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJames+R.+Cordy+%22TXL+Source+Transformation+in+Practice%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "James R. Cordy",
            "AffiliationsString": "Queen's University, Canada",
            "Authors": [
                "James R. Cordy @ Queen's University, Canada"
            ],
            "Affiliations": [
                "Queen's University, Canada"
            ],
            "Abstract": "The TXL source transformation system is widely used in industry and academia for both research and production tasks involving source transformation and software analysis. While it is designed to be accessible to software practitioners, understanding how to use TXL effectively takes time and has a steep learning curve. This tutorial is designed to get you over the initial hump and rapidly move you from a TXL novice to the skills necessary to use it effectively in real applications. Consisting of a combination of one hour lecture presentations followed by one hour practice sessions, this is a hands-on tutorial in which participants quickly learn the basics of how to use TXL effectively in their research or industrial practice.",
            "Award": ""
        },
        {
            "Title": "Software Risk Management in Practice: Shed Light on Your Software Product",
            "Type": "Tutorial",
            "Key": "saner15tut-tutt2-p",
            "URL": "http%3A%2F%2Fwww.sig.eu%2Fblobs%2FResearch%2FKey%2520Publications%2FSANER2015_Tutorial_Software_Risk_Management_Proposal.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.sig.eu%2FResearch%2FSoftwareRiskManagementInPractice",
            "DOI": "",
            "PersonsString": "Jens Knodel, Matthias Naab, Eric Bouwers, and Joost Visser",
            "AffiliationsString": "Fraunhofer IESE, Germany; Software Improvement Group, Netherlands",
            "Authors": [
                "Jens Knodel @ Fraunhofer IESE, Germany",
                "Matthias Naab @ Fraunhofer IESE, Germany",
                "Eric Bouwers @ Software Improvement Group, Netherlands",
                "Joost Visser @ Software Improvement Group, Netherlands"
            ],
            "Affiliations": [
                "Fraunhofer IESE, Germany",
                "Fraunhofer IESE, Germany",
                "Software Improvement Group, Netherlands",
                "Software Improvement Group, Netherlands"
            ],
            "Abstract": "You can’t control what you can’t measure. And you can’t decide if you are wandering around in the dark. Risk management in practice requires shedding light on the internals of the software product in order to make informed decisions. Thus, in practice, risk management has to be based on information about artifacts (documentation, code, and executables) in order to detect (potentially) critical issues. This tutorial presents experiences from industrial cases world-wide on qualitative and quantitative measurement of software products. We present our lessons learned as well as consolidated experiences from practice and provide a classification scheme of applicable measurement techniques. Participants of the tutorial receive an introduction to the techniques in theory and then apply them in practice in interactive exercises. This enables participants to learn how to shed light on the internals of their software and how to make risk management decisions efficiently and effectively.",
            "Award": ""
        },
        {
            "Title": "Software Architecture Reconstruction: Why? What? How?",
            "Type": "Technical Briefing",
            "Key": "saner15tut-tutt3-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMehdi+Mirakhorli+%22Software+Architecture+Reconstruction%3A+Why%3F+What%3F+How%3F%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mehdi Mirakhorli",
            "AffiliationsString": "Rochester Institute of Technology, USA",
            "Authors": [
                "Mehdi Mirakhorli @ Rochester Institute of Technology, USA"
            ],
            "Affiliations": [
                "Rochester Institute of Technology, USA"
            ],
            "Abstract": "Software architecture reconstruction plays an increasingly essential role in software engineering tasks such as architecture renovation, program comprehension, and change impact analysis. Various methods have been developed which use a software system&#039;s implementation-level artifacts to recover the architecture of the software. This tutorial will answer three fundamental questions about software architecture recovery: Why? What? and How? Through several examples it articulates and synthesizes technical forces and financial motivations that make software companies to invest in software architecture recovery. It discusses “what” are the pieces of design knowledge that can be recovered and lastly demonstrates a methodology as well as required tools for answering “how” to reconstruct architecture from implementation artifacts",
            "Award": ""
        },
        {
            "Title": "Metamorphic Testing",
            "Type": "Technical Briefing",
            "Key": "saner15tut-tutt4-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTsong+Yueh+Chen+%22Metamorphic+Testing%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tsong Yueh Chen",
            "AffiliationsString": "Swinburne University of Technology, Australia",
            "Authors": [
                "Tsong Yueh Chen @ Swinburne University of Technology, Australia"
            ],
            "Affiliations": [
                "Swinburne University of Technology, Australia"
            ],
            "Abstract": "A program is said to be non-testable if it is impossible or practically infeasible to verify the correctness of the output for any input. Since non-testable programs are quite common, it has been a challenging problem on testing the not-testable programs. Metamorphic testing has been developed to alleviate this challenging problem using the relations that involve related inputs and their outputs, for the algorithm to be implemented.",
            "Award": ""
        },
        {
            "Title": "SKilLed Communication for Toolchains",
            "Type": "Doctoral Paper",
            "Key": "saner15doc-docid6-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTimm+Felden+%22SKilLed+Communication+for+Toolchains%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Timm Felden",
            "AffiliationsString": "University of Stuttgart, Germany",
            "Authors": [
                "Timm Felden @ University of Stuttgart, Germany"
            ],
            "Affiliations": [
                "University of Stuttgart, Germany"
            ],
            "Abstract": "The creation of a program analysis toolchain involves design choices regarding intermediate representations (IRs). Good choices for an IR depend on the analyses performed by a toolchain. In academia, new analyses are developed frequently. Therefore, the best single IR of a research-oriented toolchain does not exist. Thus, we will describe our design of an intermediate representation that can be easily adapted to new requirements.",
            "Award": ""
        },
        {
            "Title": "The Impact of Column-Orientation on the Quality of Class Inheritance Mapping Specifications",
            "Type": "Doctoral Paper",
            "Key": "saner15doc-docid29-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMartin+Lorenz+%22The+Impact+of+Column-Orientation+on+the+Quality+of+Class+Inheritance+Mapping+Specifications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Martin Lorenz",
            "AffiliationsString": "HPI, Germany",
            "Authors": [
                "Martin Lorenz @ HPI, Germany"
            ],
            "Affiliations": [
                "HPI, Germany"
            ],
            "Abstract": "oriented modeling. Persisting objects from an inheritance hi- erarchy into a relational database is not straight forward, because the concept of inheritance is not supported by relational data stores. An accepted solution are object-relational mapping strategies. The problem is that each strategy varies in terms of its non-functional characteristics e.g., usability, maintainability, efficiency. Software developers base the decision, what mapping strategy to chose, on experience and best practices. Most of these best practices can be found in programming guides for object- relational mapping frameworks or books and publications of experienced software architects. However, these best practices are based on experiences with row-oriented database systems. With the advent of new database technologies, such as column-stores, these best practices become obsolete. In my Ph.D. thesis I am investigating the influence of a database’s data layout (row- vs. column) on the non-functional characteristics of object-relational mapping strategies.",
            "Award": ""
        },
        {
            "Title": "Improving the Integration Process of Large Software Systems",
            "Type": "Doctoral Paper",
            "Key": "saner15doc-docid76-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYujuan+Jiang+%22Improving+the+Integration+Process+of+Large+Software+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Yujuan Jiang",
            "AffiliationsString": "Polytechnique Montréal, Canada",
            "Authors": [
                "Yujuan Jiang @ Polytechnique Montréal, Canada"
            ],
            "Affiliations": [
                "Polytechnique Montréal, Canada"
            ],
            "Abstract": "Software integration is the software engineering activity where code changes of different developers are combined into a consistent whole. While the advent of distributed version control systems has allowed distributed development to scale up substantially, at the same time the risk of integration conflicts (changes that do not go well together) and the time required to fix them has increased as well. In order to help practitioners deal with this paradox, this thesis aims to understand and improve the integration process of modern software organizations. We took the Linux kernel as our pilot case study, which is supported by a distributed version control system (Git) and low-tech reviewing system (mailing list). So far, we have (1) analyzed how to reconstruct the data of the integration process in a low- tech environment where reviews are stored in emails without explicit link to version control commits, and (2) studied the characteristics of the Linux integration process. We found that the commits developed by more mature developers and impacting less subsystems are more likely to be accepted. As a next step, we plan to build a model quantifying the integration effort.",
            "Award": ""
        },
        {
            "Title": "Handling the Differential Evolution of Software Artefacts: A Framework for Consistency Management",
            "Type": "Doctoral Paper",
            "Key": "saner15doc-docid91-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DIldiko+Pete+and+Dharini+Balasubramaniam+%22Handling+the+Differential+Evolution+of+Software+Artefacts%3A+A+Framework+for+Consistency+Management%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Ildiko Pete and Dharini Balasubramaniam",
            "AffiliationsString": "University of St. Andrews, UK",
            "Authors": [
                "Ildiko Pete @ University of St. Andrews, UK",
                "Dharini Balasubramaniam @ University of St. Andrews, UK"
            ],
            "Affiliations": [
                "University of St. Andrews, UK",
                "University of St. Andrews, UK"
            ],
            "Abstract": "Modern software systems are subject to frequent changes. Different artefacts of a system, such as requirements specifications, design documents and source code, often evolve at different times and become inconsistent with one another. This differential evolution poses problems to effective software maintenance and erodes trust in artefacts as accurate representation of the system. In this paper, we propose a holistic framework for managing the consistent co-evolution of software artefacts, incorporating: traceability creation and maintenance, change detection, impact analysis, consistency checking and change propagation.",
            "Award": ""
        },
        {
            "Title": "Towards a Framework for Analysis, Transformation, and Manipulation of Makefiles",
            "Type": "Doctoral Paper",
            "Key": "saner15doc-docid94-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDoug+Martin+%22Towards+a+Framework+for+Analysis%2C+Transformation%2C+and+Manipulation+of+Makefiles%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Doug Martin",
            "AffiliationsString": "Queen's University, Canada",
            "Authors": [
                "Doug Martin @ Queen's University, Canada"
            ],
            "Affiliations": [
                "Queen's University, Canada"
            ],
            "Abstract": "Build systems are an integral part of the software development process, being responsible for turning source code into a deliverable product. They are, however, difficult to comprehend and maintain at times. Make, the most popular build language, is often cited as being difficult to debug. In this work, we propose a framework to analyze and manipulate Makefiles, and discover how the language is used in open source systems using existing software analysis techniques like source transformation and clone detection.",
            "Award": ""
        },
        {
            "Title": "Towards a Framework for Automatic Correction of Anti-patterns",
            "Type": "Doctoral Paper",
            "Key": "saner15doc-docid96-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRodrigo+Morales+%22Towards+a+Framework+for+Automatic+Correction+of+Anti-patterns%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Rodrigo Morales",
            "AffiliationsString": "Polytechnique Montréal, Canada",
            "Authors": [
                "Rodrigo Morales @ Polytechnique Montréal, Canada"
            ],
            "Affiliations": [
                "Polytechnique Montréal, Canada"
            ],
            "Abstract": "One of the biggest concerns in software maintenance is design quality; poor design hinders software maintenance and evolution. One way to improve design quality is to detect and correct anti-patterns (i.e., poor solutions to design and implementation problems), for example through refactorings. There are several approaches to detect anti-patterns, that rely on metrics and structural properties. However, finding a specific solution to remove anti-patterns is a challenging task as candidate refactorings can be conflicting and their number very large, making it costly. Hence, development teams often have to prioritize the refactorings to be applied on a system. In addition to this, refactoring is risky, since non-experienced developers can change the behaviour of a system, without a comprehensive test suite. Therefore, there is a need for tools that can automatically remove anti-patterns. We will apply meta-heuristics to propose a technique for automated refactoring that improves design quality.",
            "Award": ""
        },
        {
            "Title": "Towards an Ontology-Based Context-Aware Meta-Model for the Software Domain",
            "Type": "Doctoral Paper",
            "Key": "saner15doc-docid97-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMostafa+Erfani+%22Towards+an+Ontology-Based+Context-Aware+Meta-Model+for+the+Software+Domain%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mostafa Erfani",
            "AffiliationsString": "Concordia University, Canada",
            "Authors": [
                "Mostafa Erfani @ Concordia University, Canada"
            ],
            "Affiliations": [
                "Concordia University, Canada"
            ],
            "Abstract": "Over the last decade, contextual modeling has gained on importance due to the wide spread introduction of ubiquitous computing. Common to these systems is that they integrate contextual information to improve situated cognition and awareness as well as stakeholders’ usage experience with these systems. While domains such as Web 3.0, which shares many commonalities with the software domain, have made context-awareness as part of their solution space, the software domain still lacks the same rate of adoption. In our research, we introduce an ontology based context-aware meta-model to capture and formalize different context abstraction levels.",
            "Award": ""
        },
        {
            "Title": "Investigating Modern Release Engineering Practices",
            "Type": "Doctoral Paper",
            "Key": "saner15doc-docid99-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMd+Tajmilur+Rahman+%22Investigating+Modern+Release+Engineering+Practices%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Md Tajmilur Rahman",
            "AffiliationsString": "Concordia University, Canada",
            "Authors": [
                "Md Tajmilur Rahman @ Concordia University, Canada"
            ],
            "Affiliations": [
                "Concordia University, Canada"
            ],
            "Abstract": "In my PhD research I will focus on modern release engineering practices. First, I have quantified the time and effort that is involved in stabilizing a release. I found that despite using rapid elease, the Chrome and Linux projects still have a period where they rush changes into a release. Second, developers typically isolate unrelated changes on branches. However, developers at major companies, such as Google and Facebook, commit all changes to a single branch. They isolate unrelated changes using feature-flags, which allows them to disable works in progress. My goal is to empirically determine the best practices when using flags and identify dead code. Finally, I will develop tool support to manage feature flags.",
            "Award": ""
        }
    ],
    "Sessions": [
        {
            "Id": "Aegeu7JooZ",
            "Title": "Early Research Achievements",
            "ShortTitle": "Early Research Achievements",
            "Type": "Early Research Achievements",
            "ShortType": "Early Research Achievements",
            "Key": "1970-01-01  Early Research Achievements",
            "Day": "1970-01-01",
            "Time": "00:00 - 01:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15ERA",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15era-eraid74-p",
                "saner15era-eraid44-p",
                "saner15era-eraid78-p",
                "saner15era-eraid10-p",
                "saner15era-eraid25-p",
                "saner15era-eraid30-p",
                "saner15era-eraid32-p",
                "saner15era-eraid39-p",
                "saner15era-eraid15-p",
                "saner15era-eraid14-p",
                "saner15era-eraid27-p",
                "saner15era-eraid50-p",
                "saner15era-eraid77-p",
                "saner15era-eraid31-p"
            ]
        },
        {
            "Id": "ahVeiK9ies",
            "Title": "Tutorials and Briefings",
            "ShortTitle": "Tutorials and Briefings",
            "Type": "Tutorials and Briefings",
            "ShortType": "Tutorials and Briefings",
            "Key": "1970-01-01  Tutorials and Briefings",
            "Day": "1970-01-01",
            "Time": "00:00 - 01:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15TUT",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15tut-tutt1-p",
                "saner15tut-tutt2-p",
                "saner15tut-tutt3-p",
                "saner15tut-tutt4-p"
            ]
        },
        {
            "Id": "iz7iFaeshi",
            "Title": "Message from the Chairs",
            "ShortTitle": "Message from the Chairs",
            "Type": "Frontmatter",
            "ShortType": "Frontmatter",
            "Key": "2015-03-03 08:30 Message from the Chairs",
            "Day": "2015-03-03",
            "Time": "08:30 - 09:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15FOREWORD",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15foreword-fm001-p"
            ]
        },
        {
            "Id": "ju2Ki3ooyi",
            "Title": "Information Retrieval",
            "ShortTitle": "Information Retrieval",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-03 11:00 Information Retrieval",
            "Day": "2015-03-03",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid41-p",
                "saner15main-mainid71-p"
            ]
        },
        {
            "Id": "thushaew3H",
            "Title": "Tool Demonstrations",
            "ShortTitle": "Tool Demonstrations",
            "Type": "Tool Demonstrations",
            "ShortType": "Tool Demonstrations",
            "Key": "2015-03-03 11:00 Tool Demonstrations",
            "Day": "2015-03-03",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "2",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15TOOL",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15tool-toolid21-p",
                "saner15tool-toolid40-p",
                "saner15tool-toolid81-p",
                "saner15tool-toolid11-p",
                "saner15tool-toolid41-p",
                "saner15tool-toolid55-p",
                "saner15tool-toolid65-p",
                "saner15tool-toolid66-p",
                "saner15tool-toolid37-p"
            ]
        },
        {
            "Id": "IPie7Cae9m",
            "Title": "APIs and Patterns",
            "ShortTitle": "APIs and Patterns",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-03 14:00 APIs and Patterns",
            "Day": "2015-03-03",
            "Time": "14:00 - 15:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid126-p",
                "saner15main-mainid127-p",
                "saner15main-mainid49-p",
                "saner15main-mainid104-p"
            ]
        },
        {
            "Id": "ushaB2gieZ",
            "Title": "Analysis of Programming Languages",
            "ShortTitle": "Analysis of Programming Languages",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-03 16:00 Analysis of Programming Languages",
            "Day": "2015-03-03",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid101-p",
                "saner15main-mainid117-p",
                "saner15main-mainid13-p",
                "saner15main-mainid96-p"
            ]
        },
        {
            "Id": "thaez3Chux",
            "Title": "Doctoral Symposium",
            "ShortTitle": "Doctoral Symposium",
            "Type": "Doctoral Symposium",
            "ShortType": "Doctoral Symposium",
            "Key": "2015-03-03 16:00 Doctoral Symposium",
            "Day": "2015-03-03",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15DOC",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15doc-docid6-p",
                "saner15doc-docid29-p",
                "saner15doc-docid76-p",
                "saner15doc-docid91-p",
                "saner15doc-docid94-p",
                "saner15doc-docid96-p",
                "saner15doc-docid97-p",
                "saner15doc-docid99-p"
            ]
        },
        {
            "Id": "deQuah6ohs",
            "Title": "On Crashes and Traces",
            "ShortTitle": "On Crashes and Traces",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-04 09:00 On Crashes and Traces",
            "Day": "2015-03-04",
            "Time": "09:00 - 10:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid178-p",
                "saner15main-mainid125-p",
                "saner15main-mainid25-p",
                "saner15main-mainid142-p"
            ]
        },
        {
            "Id": "loh4ieQu7z",
            "Title": "Code Reviews",
            "ShortTitle": "Code Reviews",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-04 11:00 Code Reviews",
            "Day": "2015-03-04",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid31-p",
                "saner15main-mainid113-p",
                "saner15main-mainid89-p",
                "saner15main-mainid147-p"
            ]
        },
        {
            "Id": "seiY0en2yu",
            "Title": "Searching and Cloning",
            "ShortTitle": "Searching and Cloning",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-04 16:00 Searching and Cloning",
            "Day": "2015-03-04",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid11-p",
                "saner15main-mainid8-p",
                "saner15main-mainid162-p",
                "saner15main-mainid55-p"
            ]
        },
        {
            "Id": "thah0uShei",
            "Title": "Industrial Research",
            "ShortTitle": "Industrial Research",
            "Type": "Industrial Research",
            "ShortType": "Industrial Research",
            "Key": "2015-03-04 16:00 Industrial Research",
            "Day": "2015-03-04",
            "Time": "16:00 - 17:15",
            "Location": "",
            "LocationIndex": "3",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15IND",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15ind-indid46-p",
                "saner15ind-indid56-p",
                "saner15ind-indid35-p",
                "saner15ind-indid90-p"
            ]
        },
        {
            "Id": "Shei5ohLah",
            "Title": "Change Impact Analysis",
            "ShortTitle": "Change Impact Analysis",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-05 11:00 Change Impact Analysis",
            "Day": "2015-03-05",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid60-p",
                "saner15main-mainid93-p",
                "saner15main-mainid118-p",
                "saner15main-mainid143-p"
            ]
        },
        {
            "Id": "Of2daegoah",
            "Title": "SCAM at SANER",
            "ShortTitle": "SCAM at SANER",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-05 16:00 SCAM at SANER",
            "Day": "2015-03-05",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid153-p",
                "saner15main-mainid87-p",
                "saner15main-mainid164-p",
                "saner15main-mainid56-p"
            ]
        },
        {
            "Id": "ahd0HieTho",
            "Title": "Mining Software Repositories",
            "ShortTitle": "Mining Software Repositories",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-06 09:00 Mining Software Repositories",
            "Day": "2015-03-06",
            "Time": "09:00 - 10:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid15-p",
                "saner15main-mainid83-p",
                "saner15main-mainid2-p",
                "saner15main-mainid37-p"
            ]
        },
        {
            "Id": "iuD3Ahngij",
            "Title": "On Code Changes",
            "ShortTitle": "On Code Changes",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-06 11:00 On Code Changes",
            "Day": "2015-03-06",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid23-p",
                "saner15main-mainid63-p",
                "saner15main-mainid30-p",
                "saner15main-mainid98-p"
            ]
        },
        {
            "Id": "thee7eeSoe",
            "Title": "The Human Within",
            "ShortTitle": "The Human Within",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-06 14:00 The Human Within",
            "Day": "2015-03-06",
            "Time": "14:00 - 15:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid121-p",
                "saner15main-mainid92-p",
                "saner15main-mainid32-p",
                "saner15main-mainid46-p"
            ]
        },
        {
            "Id": "geig8Theiv",
            "Title": "Search, Touch, Tweet",
            "ShortTitle": "Search, Touch, Tweet",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2015-03-06 16:00 Search, Touch, Tweet",
            "Day": "2015-03-06",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner15main-mainid108-p",
                "saner15main-mainid114-p",
                "saner15main-mainid112-p",
                "saner15main-mainid77-p"
            ]
        }
    ],
    "People": [
        {
            "Name": "Hani Abdeen",
            "Affiliation": "Université de Montréal, Canada",
            "Key": "Hani Abdeen @ Université de Montréal, Canada",
            "Id": "3212083294",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marwan Abi-Antoun",
            "Affiliation": "Wayne State University, USA",
            "Key": "Marwan Abi-Antoun @ Wayne State University, USA",
            "Id": "e9fd7cf4dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bram Adams",
            "Affiliation": "",
            "Key": "Bram Adams @",
            "Id": "abfbda10b4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Karan Aggarwal",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Karan Aggarwal @ University of Alberta, Canada",
            "Id": "84317bb20f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Luay Alawneh",
            "Affiliation": "Jordan University of Science and Technology, Jordan",
            "Key": "Luay Alawneh @ Jordan University of Science and Technology, Jordan",
            "Id": "e5f2a4f57d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hamoud Aljamaan",
            "Affiliation": "University of Ottawa, Canada",
            "Key": "Hamoud Aljamaan @ University of Ottawa, Canada",
            "Id": "b7db22f88c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Erik Ammerlaan",
            "Affiliation": "Exact International Development, Netherlands",
            "Key": "Erik Ammerlaan @ Exact International Development, Netherlands",
            "Id": "d95c750a5f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nicolas Anquetil",
            "Affiliation": "INRIA, France",
            "Key": "Nicolas Anquetil @ INRIA, France",
            "Id": "8e78697851",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Giuliano Antoniol",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Giuliano Antoniol @ Polytechnique Montréal, Canada",
            "Id": "9d7fd855e2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Venera Arnaoudova",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Venera Arnaoudova @ Polytechnique Montréal, Canada",
            "Id": "5e1e4abc45",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shams Azad",
            "Affiliation": "Concordia University, Canada",
            "Key": "Shams Azad @ Concordia University, Canada",
            "Id": "b5d09c816d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alberto Bacchelli",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Alberto Bacchelli @ Delft University of Technology, Netherlands",
            "Id": "8c538a1eb3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dharini Balasubramaniam",
            "Affiliation": "University of St. Andrews, UK",
            "Key": "Dharini Balasubramaniam @ University of St. Andrews, UK",
            "Id": "eb6fc7e9b1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hauke Baller",
            "Affiliation": "TU Braunschweig, Germany",
            "Key": "Hauke Baller @ TU Braunschweig, Germany",
            "Id": "dc98a14989",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lingfeng Bao",
            "Affiliation": "Zhejiang University, China",
            "Key": "Lingfeng Bao @ Zhejiang University, China",
            "Id": "53d9f313ee",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Omar Benomar",
            "Affiliation": "Université de Montréal, Canada",
            "Key": "Omar Benomar @ Université de Montréal, Canada",
            "Id": "6d33c46262",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alexandre Bergel",
            "Affiliation": "University of Chile, Chile",
            "Key": "Alexandre Bergel @ University of Chile, Chile",
            "Id": "5c016ae02e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bernhard J. Berger",
            "Affiliation": "University of Bremen, Germany",
            "Key": "Bernhard J. Berger @ University of Bremen, Germany",
            "Id": "0e1f6ef62b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cor-Paul Bezemer",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Cor-Paul Bezemer @ Delft University of Technology, Netherlands",
            "Id": "024898e408",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Prasad Bokil",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Prasad Bokil @ Tata Consultancy Services, India",
            "Id": "18d6374865",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eric Bouwers",
            "Affiliation": "Software Improvement Group, Netherlands",
            "Key": "Eric Bouwers @ Software Improvement Group, Netherlands",
            "Id": "5a0c988cbc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Brandtner",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Martin Brandtner @ University of Zurich, Switzerland",
            "Id": "0b512d1849",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bernd Bruegge",
            "Affiliation": "TU München, Germany",
            "Key": "Bernd Bruegge @ TU München, Germany",
            "Id": "eaa9c59854",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jim Buckley",
            "Affiliation": "Lero, Ireland / University of Limerick, Ireland",
            "Key": "Jim Buckley @ Lero, Ireland / University of Limerick, Ireland",
            "Id": "7dcebbebfa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jordi Cabot",
            "Affiliation": "AtlanMod, France",
            "Key": "Jordi Cabot @ AtlanMod, France",
            "Id": "650d28e617",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mircea Cadariu",
            "Affiliation": "Software Improvement Group, Netherlands / Delft University of Technology, Netherlands",
            "Key": "Mircea Cadariu @ Software Improvement Group, Netherlands / Delft University of Technology, Netherlands",
            "Id": "3d5fe65100",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Haipeng Cai",
            "Affiliation": "University of Notre Dame, USA",
            "Key": "Haipeng Cai @ University of Notre Dame, USA",
            "Id": "881d67bcd6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Damien Cassou",
            "Affiliation": "INRIA, France / University of Lille, France",
            "Key": "Damien Cassou @ INRIA, France / University of Lille, France",
            "Id": "8f7c82f2ec",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tsong Yueh Chen",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Tsong Yueh Chen @ Swinburne University of Technology, Australia",
            "Id": "37dac2afe4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mel Ó Cinnéide",
            "Affiliation": "University College Dublin, Ireland",
            "Key": "Mel Ó Cinnéide @ University College Dublin, Ireland",
            "Id": "aad66a7d59",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anthony Cleve",
            "Affiliation": "University of Namur, Belgium",
            "Key": "Anthony Cleve @ University of Namur, Belgium",
            "Id": "321ba87259",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Esteban Clua",
            "Affiliation": "Federal Fluminense University, Brazil",
            "Key": "Esteban Clua @ Federal Fluminense University, Brazil",
            "Id": "c9d2c07402",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "James R. Cordy",
            "Affiliation": "Queen's University, Canada",
            "Key": "James R. Cordy @ Queen's University, Canada",
            "Id": "de61e12772",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Valerio Cosentino",
            "Affiliation": "AtlanMod, France",
            "Key": "Valerio Cosentino @ AtlanMod, France",
            "Id": "1ec85eae3f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Steve Counsell",
            "Affiliation": "Brunel University, UK",
            "Key": "Steve Counsell @ Brunel University, UK",
            "Id": "fc016eff3f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tommaso Dal Sasso",
            "Affiliation": "University of Lugano, Switzerland",
            "Key": "Tommaso Dal Sasso @ University of Lugano, Switzerland",
            "Id": "6c9c1a72b9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kostadin Damevski",
            "Affiliation": "Virginia State University, USA",
            "Key": "Kostadin Damevski @ Virginia State University, USA",
            "Id": "94b960ff66",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ian J. Davis",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Ian J. Davis @ University of Waterloo, Canada",
            "Id": "de7c727301",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Arie van Deursen",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Arie van Deursen @ Delft University of Technology, Netherlands",
            "Id": "20d1e15cd9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martín Dias",
            "Affiliation": "INRIA, France / University of Lille, France",
            "Key": "Martín Dias @ INRIA, France / University of Lille, France",
            "Id": "473567da90",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jens Dietrich",
            "Affiliation": "Massey University, New Zealand",
            "Key": "Jens Dietrich @ Massey University, New Zealand",
            "Id": "01b6c722da",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Massimiliano Di Penta",
            "Affiliation": "University of Sannio, Italy",
            "Key": "Massimiliano Di Penta @ University of Sannio, Italy",
            "Id": "d3bc4f92a1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yucong Duan",
            "Affiliation": "Hainan University, China",
            "Key": "Yucong Duan @ Hainan University, China",
            "Id": "7a154918d6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stéphane Ducasse",
            "Affiliation": "INRIA, France",
            "Key": "Stéphane Ducasse @ INRIA, France",
            "Id": "317f529c33",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stéphane Ducasse",
            "Affiliation": "INRIA, France / University of Lille, France",
            "Key": "Stéphane Ducasse @ INRIA, France / University of Lille, France",
            "Id": "68ed869958",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bruno Dufour",
            "Affiliation": "Université de Montréal, Canada",
            "Key": "Bruno Dufour @ Université de Montréal, Canada",
            "Id": "ca961fb6e6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael English",
            "Affiliation": "Lero, Ireland / University of Limerick, Ireland",
            "Key": "Michael English @ Lero, Ireland / University of Limerick, Ireland",
            "Id": "a1949c3d43",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mostafa Erfani",
            "Affiliation": "Concordia University, Canada",
            "Key": "Mostafa Erfani @ Concordia University, Canada",
            "Id": "0bb3db2412",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Laleh Eshkevari",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Laleh Eshkevari @ Polytechnique Montréal, Canada",
            "Id": "65b99d48e7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anne Etien",
            "Affiliation": "INRIA, France",
            "Key": "Anne Etien @ INRIA, France",
            "Id": "145949e51a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jean-Rémy Falleri",
            "Affiliation": "LaBRI, France / University of Bordeaux, France",
            "Key": "Jean-Rémy Falleri @ LaBRI, France / University of Bordeaux, France",
            "Id": "789b4f6603",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Timm Felden",
            "Affiliation": "University of Stuttgart, Germany",
            "Key": "Timm Felden @ University of Stuttgart, Germany",
            "Id": "9e758d7a54",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rudolf Ferenc",
            "Affiliation": "University of Szeged, Hungary",
            "Key": "Rudolf Ferenc @ University of Szeged, Hungary",
            "Id": "0843899eac",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Günter Fleck",
            "Affiliation": "Siemens Transformers Austria, Austria",
            "Key": "Günter Fleck @ Siemens Transformers Austria, Austria",
            "Id": "0393e87633",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Harald C. Gall",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Harald C. Gall @ University of Zurich, Switzerland",
            "Id": "18cc7eed78",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dongjing Gao",
            "Affiliation": "Fudan University, China",
            "Key": "Dongjing Gao @ Fudan University, China",
            "Id": "c431a12353",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Miguel A. Garzón",
            "Affiliation": "University of Ottawa, Canada",
            "Key": "Miguel A. Garzón @ University of Ottawa, Canada",
            "Id": "4fb7f88930",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel M. German",
            "Affiliation": "Osaka University, Japan / University of Victoria, Canada",
            "Key": "Daniel M. German @ Osaka University, Japan / University of Victoria, Canada",
            "Id": "6facba5e0f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andrew Giang",
            "Affiliation": "Wayne State University, USA",
            "Key": "Andrew Giang @ Wayne State University, USA",
            "Id": "c5ccb90f51",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Victor M. Gonzalez",
            "Affiliation": "ITAM, Mexico",
            "Key": "Victor M. Gonzalez @ ITAM, Mexico",
            "Id": "c5b53909ea",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Georgios Gousios",
            "Affiliation": "Radboud University Nijmegen, Netherlands",
            "Key": "Georgios Gousios @ Radboud University Nijmegen, Netherlands",
            "Id": "17ec50c677",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Brendan Gregg",
            "Affiliation": "Netflix, USA",
            "Key": "Brendan Gregg @ Netflix, USA",
            "Id": "0092164040",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Russ Greiner",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Russ Greiner @ University of Alberta, Canada",
            "Id": "b705ee9631",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yann-Gaël Guéhéneuc",
            "Affiliation": "",
            "Key": "Yann-Gaël Guéhéneuc @",
            "Id": "d4be99c6dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Latifa Guerrouj",
            "Affiliation": "Concordia University, Canada",
            "Key": "Latifa Guerrouj @ Concordia University, Canada",
            "Id": "9faab27c4b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rajiv Gupta",
            "Affiliation": "University of California at Riverside, USA",
            "Key": "Rajiv Gupta @ University of California at Riverside, USA",
            "Id": "7e04f8f7c4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jurriaan Hage",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Jurriaan Hage @ Utrecht University, Netherlands",
            "Id": "185b93a199",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Abdelwahab Hamou-Lhadj",
            "Affiliation": "Concordia University, Canada",
            "Key": "Abdelwahab Hamou-Lhadj @ Concordia University, Canada",
            "Id": "e063b6ac8b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Masatomo Hashimoto",
            "Affiliation": "RIKEN Advanced Institute for Computational Science, Japan",
            "Key": "Masatomo Hashimoto @ RIKEN Advanced Institute for Computational Science, Japan",
            "Id": "58d1b4881b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ahmed E. Hassan",
            "Affiliation": "Queen's University, Canada",
            "Key": "Ahmed E. Hassan @ Queen's University, Canada",
            "Id": "b8aa3f3ff7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jameleddine Hassine",
            "Affiliation": "KFUPM, Saudi Arabia",
            "Key": "Jameleddine Hassine @ KFUPM, Saudi Arabia",
            "Id": "0a1a2e652e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stefan Hauck-Stattelmann",
            "Affiliation": "ABB Research, Germany",
            "Key": "Stefan Hauck-Stattelmann @ ABB Research, Germany",
            "Id": "e9eda27530",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shinpei Hayashi",
            "Affiliation": "Tokyo Institute of Technology, Japan",
            "Key": "Shinpei Hayashi @ Tokyo Institute of Technology, Japan",
            "Id": "d9c5b85b60",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sebastian Herold",
            "Affiliation": "Lero, Ireland / University of Limerick, Ireland",
            "Key": "Sebastian Herold @ Lero, Ireland / University of Limerick, Ireland",
            "Id": "a86aa46d73",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yoshiki Higo",
            "Affiliation": "Osaka University, Japan",
            "Key": "Yoshiki Higo @ Osaka University, Japan",
            "Id": "023b4bd588",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mark Hills",
            "Affiliation": "East Carolina University, USA",
            "Key": "Mark Hills @ East Carolina University, USA",
            "Id": "44407fced8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Abram Hindle",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Abram Hindle @ University of Alberta, Canada",
            "Id": "08500afd42",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Richard C. Holt",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Richard C. Holt @ University of Waterloo, Canada",
            "Id": "9ba249007a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daiki Hoshino",
            "Affiliation": "Tokyo Institute of Technology, Japan",
            "Key": "Daiki Hoshino @ Tokyo Institute of Technology, Japan",
            "Id": "7451ff0c90",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jiajun Hu",
            "Affiliation": "Yangzhou University, China",
            "Key": "Jiajun Hu @ Yangzhou University, China",
            "Id": "81adad4213",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hajimu Iida",
            "Affiliation": "NAIST, Japan",
            "Key": "Hajimu Iida @ NAIST, Japan",
            "Id": "210d979ec1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alejandro Infante",
            "Affiliation": "University of Chile, Chile",
            "Key": "Alejandro Infante @ University of Chile, Chile",
            "Id": "7863b9a929",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Katsuro Inoue",
            "Affiliation": "Osaka University, Japan",
            "Key": "Katsuro Inoue @ Osaka University, Japan",
            "Id": "4803ae398b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Takashi Ishio",
            "Affiliation": "Osaka University, Japan",
            "Key": "Takashi Ishio @ Osaka University, Japan",
            "Id": "f41301e3d4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Javier Luis Cánovas Izquierdo",
            "Affiliation": "AtlanMod, France",
            "Key": "Javier Luis Cánovas Izquierdo @ AtlanMod, France",
            "Id": "2d17e41116",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tomonori Izumida",
            "Affiliation": "National Institute of Advanced Industrial Science and Technology, Japan",
            "Key": "Tomonori Izumida @ National Institute of Advanced Industrial Science and Technology, Japan",
            "Id": "f28dd517a8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Slinger Jansen",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Slinger Jansen @ Utrecht University, Netherlands",
            "Id": "38f2838d10",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Raoul Jetley",
            "Affiliation": "ABB Research, India",
            "Key": "Raoul Jetley @ ABB Research, India",
            "Id": "272054aba4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kamil Jezek",
            "Affiliation": "University of West Bohemia, Czech Republic",
            "Key": "Kamil Jezek @ University of West Bohemia, Czech Republic",
            "Id": "eb48ddd64f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Qingtao Jiang",
            "Affiliation": "Fudan University, China",
            "Key": "Qingtao Jiang @ Fudan University, China",
            "Id": "d5c48e3a63",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shihai Jiang",
            "Affiliation": "Fudan University, China",
            "Key": "Shihai Jiang @ Fudan University, China",
            "Id": "dcbb163dd2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yujuan Jiang",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Yujuan Jiang @ Polytechnique Montréal, Canada",
            "Id": "d7ce2568e6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Iman Keivanloo",
            "Affiliation": "Queen's University, Canada",
            "Key": "Iman Keivanloo @ Queen's University, Canada",
            "Id": "b19342e000",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tibor Keresztesi",
            "Affiliation": "R&R Software, Hungary",
            "Key": "Tibor Keresztesi @ R&R Software, Hungary",
            "Id": "51d04ce9eb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ravi Khadka",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Ravi Khadka @ Utrecht University, Netherlands",
            "Id": "7ccfcaf496",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ebrahim Khalaj",
            "Affiliation": "Wayne State University, USA",
            "Key": "Ebrahim Khalaj @ Wayne State University, USA",
            "Id": "ae13bcb5b2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Foutse Khomh",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Foutse Khomh @ Polytechnique Montréal, Canada",
            "Id": "7f20478c6a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jens Knodel",
            "Affiliation": "Fraunhofer IESE, Germany",
            "Key": "Jens Knodel @ Fraunhofer IESE, Germany",
            "Id": "80a147f364",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kazuo Kobori",
            "Affiliation": "NTT DATA, Japan",
            "Key": "Kazuo Kobori @ NTT DATA, Japan",
            "Id": "5e17b06778",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pavneet Singh Kochhar",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Pavneet Singh Kochhar @ Singapore Management University, Singapore",
            "Id": "439a2cd866",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Raghavan Komondoor",
            "Affiliation": "Indian Institute of Science, India",
            "Key": "Raghavan Komondoor @ Indian Institute of Science, India",
            "Id": "a048d24863",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Raula Gaikovina Kula",
            "Affiliation": "Osaka University, Japan",
            "Key": "Raula Gaikovina Kula @ Osaka University, Japan",
            "Id": "802f325dd8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shinji Kusumoto",
            "Affiliation": "Osaka University, Japan",
            "Key": "Shinji Kusumoto @ Osaka University, Japan",
            "Id": "90d2e6e4a7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gergely Ladányi",
            "Affiliation": "University of Szeged, Hungary",
            "Key": "Gergely Ladányi @ University of Szeged, Hungary",
            "Id": "ae2f03d59b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michele Lanza",
            "Affiliation": "University of Lugano, Switzerland",
            "Key": "Michele Lanza @ University of Lugano, Switzerland",
            "Id": "8d1bc71134",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alf Larsson",
            "Affiliation": "Ericsson, Sweden",
            "Key": "Alf Larsson @ Ericsson, Sweden",
            "Id": "b574926a49",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marc-André Laverdière",
            "Affiliation": "Tata Consultancy Services, Canada / Polytechnique Montréal, Canada",
            "Key": "Marc-André Laverdière @ Tata Consultancy Services, Canada / Polytechnique Montréal, Canada",
            "Id": "696dd6cab4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Julia Lawall",
            "Affiliation": "INRIA, France",
            "Key": "Julia Lawall @ INRIA, France",
            "Id": "b9694eceab",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tien-Duy B. Le",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Tien-Duy B. Le @ Singapore Management University, Singapore",
            "Id": "a2aca22750",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Philipp Leitner",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Philipp Leitner @ University of Zurich, Switzerland",
            "Id": "e795b2d79d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Remo Lemma",
            "Affiliation": "University of Lugano, Switzerland",
            "Key": "Remo Lemma @ University of Lugano, Switzerland",
            "Id": "6cd644ab6a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Timothy C. Lethbridge",
            "Affiliation": "University of Ottawa, Canada",
            "Key": "Timothy C. Lethbridge @ University of Ottawa, Canada",
            "Id": "b5b66838a6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bin Li",
            "Affiliation": "Yangzhou University, China / Nanjing University, China",
            "Key": "Bin Li @ Yangzhou University, China / Nanjing University, China",
            "Id": "6e1a1e5317",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hongwei Li",
            "Affiliation": "Fudan University, China / Jiangxi Normal University, China",
            "Key": "Hongwei Li @ Fudan University, China / Jiangxi Normal University, China",
            "Id": "e9aabf2b8c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jing Li",
            "Affiliation": "Nanyang Technological University, Singapore",
            "Key": "Jing Li @ Nanyang Technological University, Singapore",
            "Id": "4b73b9ebfc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xiaoli Lian",
            "Affiliation": "Beihang University, China",
            "Key": "Xiaoli Lian @ Beihang University, China",
            "Id": "fedb01381d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sascha Lity",
            "Affiliation": "TU Braunschweig, Germany",
            "Key": "Sascha Lity @ TU Braunschweig, Germany",
            "Id": "34b1ef9b0e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Taiyue Liu",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Taiyue Liu @ University of Waterloo, Canada",
            "Id": "d4931b27b5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Lo",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "David Lo @ Singapore Management University, Singapore",
            "Id": "c76da467d6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Lorenz",
            "Affiliation": "HPI, Germany",
            "Key": "Martin Lorenz @ HPI, Germany",
            "Id": "6f95825d07",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Meili Lu",
            "Affiliation": "Yangzhou University, China",
            "Key": "Meili Lu @ Yangzhou University, China",
            "Id": "67ad22035c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhaojin Lv",
            "Affiliation": "Fudan University, China",
            "Key": "Zhaojin Lv @ Fudan University, China",
            "Id": "c01417952c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Peijun Ma",
            "Affiliation": "Harbin Institute of Technology, China",
            "Key": "Peijun Ma @ Harbin Institute of Technology, China",
            "Id": "42e82cba42",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ayesha Manzer",
            "Affiliation": "York University, Canada",
            "Key": "Ayesha Manzer @ York University, Canada",
            "Id": "18e12ec861",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Doug Martin",
            "Affiliation": "Queen's University, Canada",
            "Key": "Doug Martin @ Queen's University, Canada",
            "Id": "fa17c51e9e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Katsuhisa Maruyama",
            "Affiliation": "Ritsumeikan University, Japan",
            "Key": "Katsuhisa Maruyama @ Ritsumeikan University, Japan",
            "Id": "7e1883d5ac",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jumpei Matsuda",
            "Affiliation": "Tokyo Institute of Technology, Japan",
            "Key": "Jumpei Matsuda @ Tokyo Institute of Technology, Japan",
            "Id": "9cbf468faa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kenichi Matsumoto",
            "Affiliation": "NAIST, Japan",
            "Key": "Kenichi Matsumoto @ NAIST, Japan",
            "Id": "dfa60d454f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Makoto Matsushita",
            "Affiliation": "Osaka University, Japan",
            "Key": "Makoto Matsushita @ Osaka University, Japan",
            "Id": "a46f38931a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sven Mattsen",
            "Affiliation": "TU Hamburg, Germany",
            "Key": "Sven Mattsen @ TU Hamburg, Germany",
            "Id": "c44ef3731d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shane McIntosh",
            "Affiliation": "Queen's University, Canada",
            "Key": "Shane McIntosh @ Queen's University, Canada",
            "Id": "721a0dbdf5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Raveendra Kumar Medicherla",
            "Affiliation": "Tata Consultancy Services, India / Indian Institute of Science, India",
            "Key": "Raveendra Kumar Medicherla @ Tata Consultancy Services, India / Indian Institute of Science, India",
            "Id": "7e8ba011eb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ettore Merlo",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Ettore Merlo @ Polytechnique Montréal, Canada",
            "Id": "30f123f809",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Loup Meurice",
            "Affiliation": "University of Namur, Belgium",
            "Key": "Loup Meurice @ University of Namur, Belgium",
            "Id": "6c32c90fe3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mehdi Mirakhorli",
            "Affiliation": "Rochester Institute of Technology, USA",
            "Key": "Mehdi Mirakhorli @ Rochester Institute of Technology, USA",
            "Id": "03e6b3ae78",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andrea Mocci",
            "Affiliation": "University of Lugano, Switzerland",
            "Key": "Andrea Mocci @ University of Lugano, Switzerland",
            "Id": "436d5c86c4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Manishankar Mondal",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "Manishankar Mondal @ University of Saskatchewan, Canada",
            "Id": "3339bc41cd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rodrigo Morales",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Rodrigo Morales @ Polytechnique Montréal, Canada",
            "Id": "03fa715fa8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Akira Mori",
            "Affiliation": "National Institute of Advanced Industrial Science and Technology, Japan",
            "Key": "Akira Mori @ National Institute of Advanced Industrial Science and Technology, Japan",
            "Id": "ed9e578e1a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Moser",
            "Affiliation": "Software Competence Center Hagenberg, Austria",
            "Key": "Michael Moser @ Software Competence Center Hagenberg, Austria",
            "Id": "71ddd22947",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sebastian C. Müller",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Sebastian C. Müller @ University of Zurich, Switzerland",
            "Id": "b3f2bb736c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hiroaki Murakami",
            "Affiliation": "Osaka University, Japan",
            "Key": "Hiroaki Murakami @ Osaka University, Japan",
            "Id": "e4c26fc5d5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Leonardo Murta",
            "Affiliation": "Federal Fluminense University, Brazil",
            "Key": "Leonardo Murta @ Federal Fluminense University, Brazil",
            "Id": "d909a87bee",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tukaram Muske",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Tukaram Muske @ Tata Consultancy Services, India",
            "Id": "6694be3696",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Matthias Naab",
            "Affiliation": "Fraunhofer IESE, Germany",
            "Key": "Matthias Naab @ Fraunhofer IESE, Germany",
            "Id": "01a721d83d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Csaba Nagy",
            "Affiliation": "University of Namur, Belgium",
            "Key": "Csaba Nagy @ University of Namur, Belgium",
            "Id": "cddf84977f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anil Nair",
            "Affiliation": "ABB Research, India",
            "Key": "Anil Nair @ ABB Research, India",
            "Id": "14d7125746",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sreeja Nair",
            "Affiliation": "ABB Research, India",
            "Key": "Sreeja Nair @ ABB Research, India",
            "Id": "1cb88f83b0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mathieu Nayrolles",
            "Affiliation": "Concordia University, Canada",
            "Key": "Mathieu Nayrolles @ Concordia University, Canada",
            "Id": "b833abd5fa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Iulian Neamtiu",
            "Affiliation": "University of California at Riverside, USA",
            "Key": "Iulian Neamtiu @ University of California at Riverside, USA",
            "Id": "30c13a2cb9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stefan Nosovic",
            "Affiliation": "TU München, Germany",
            "Key": "Stefan Nosovic @ TU München, Germany",
            "Id": "e8daf6ab41",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Takayuki Omori",
            "Affiliation": "Ritsumeikan University, Japan",
            "Key": "Takayuki Omori @ Ritsumeikan University, Japan",
            "Id": "bd6a831015",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hayatou Oumarou",
            "Affiliation": "University of Maroua, Cameroon",
            "Key": "Hayatou Oumarou @ University of Maroua, Cameroon",
            "Id": "807da7d1ea",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tosin Daniel Oyetoyan",
            "Affiliation": "NTNU, Norway",
            "Key": "Tosin Daniel Oyetoyan @ NTNU, Norway",
            "Id": "96253331a4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nicolas Palix",
            "Affiliation": "University of Grenoble, France",
            "Key": "Nicolas Palix @ University of Grenoble, France",
            "Id": "83364a717d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sebastiano Panichella",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Sebastiano Panichella @ University of Zurich, Switzerland",
            "Id": "95c35e0a45",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xin Peng",
            "Affiliation": "Fudan University, China",
            "Key": "Xin Peng @ Fudan University, China",
            "Id": "822e10ae4a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ildiko Pete",
            "Affiliation": "University of St. Andrews, UK",
            "Key": "Ildiko Pete @ University of St. Andrews, UK",
            "Id": "d2de094ab8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Josef Pichler",
            "Affiliation": "Software Competence Center Hagenberg, Austria",
            "Key": "Josef Pichler @ Software Competence Center Hagenberg, Austria",
            "Id": "1fee28fe22",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lori Pollock",
            "Affiliation": "University of Delaware, USA",
            "Key": "Lori Pollock @ University of Delaware, USA",
            "Id": "294f09cc64",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Johan Pouwelse",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Johan Pouwelse @ Delft University of Technology, Netherlands",
            "Id": "a0ab9b507f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jing Qiu",
            "Affiliation": "Harbin Institute of Technology, China",
            "Key": "Jing Qiu @ Harbin Institute of Technology, China",
            "Id": "1a7fdd3ec2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Md Tajmilur Rahman",
            "Affiliation": "Concordia University, Canada",
            "Key": "Md Tajmilur Rahman @ Concordia University, Canada",
            "Id": "6df0c5ae97",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohammad Masudur Rahman",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "Mohammad Masudur Rahman @ University of Saskatchewan, Canada",
            "Id": "262f4aaf81",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Václav Rajlich",
            "Affiliation": "Wayne State University, USA",
            "Key": "Václav Rajlich @ Wayne State University, USA",
            "Id": "145f34ba8f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Miguel Ramos",
            "Affiliation": "Federal University of Minas Gerais, Brazil",
            "Key": "Miguel Ramos @ Federal University of Minas Gerais, Brazil",
            "Id": "532aab504f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Peter C. Rigby",
            "Affiliation": "Concordia University, Canada",
            "Key": "Peter C. Rigby @ Concordia University, Canada",
            "Id": "718db0a990",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Romain Robbes",
            "Affiliation": "University of Chile, Chile",
            "Key": "Romain Robbes @ University of Chile, Chile",
            "Id": "5e68ba6262",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tobias Roehm",
            "Affiliation": "TU München, Germany",
            "Key": "Tobias Roehm @ TU München, Germany",
            "Id": "66767c2767",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Belén Rolandi",
            "Affiliation": "AtlanMod, France",
            "Key": "Belén Rolandi @ AtlanMod, France",
            "Id": "93dcd4ba6d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chanchal K. Roy",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "Chanchal K. Roy @ University of Saskatchewan, Canada",
            "Id": "aa6b351217",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tanner Rutgers",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Tanner Rutgers @ University of Alberta, Canada",
            "Id": "ab2dcb6815",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Amir M. Saeidi",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Amir M. Saeidi @ Utrecht University, Netherlands",
            "Id": "22cdda7694",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Motoshi Saeki",
            "Affiliation": "Tokyo Institute of Technology, Japan",
            "Key": "Motoshi Saeki @ Tokyo Institute of Technology, Japan",
            "Id": "e36ce29ab0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Houari Sahraoui",
            "Affiliation": "Université de Montréal, Canada",
            "Key": "Houari Sahraoui @ Université de Montréal, Canada",
            "Id": "8a3986dc5f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohamed Aymen Saied",
            "Affiliation": "Université de Montréal, Canada",
            "Key": "Mohamed Aymen Saied @ Université de Montréal, Canada",
            "Id": "9f4e8082dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Heider Sanchez",
            "Affiliation": "University of Chile, Chile",
            "Key": "Heider Sanchez @ University of Chile, Chile",
            "Id": "cc6f018f1a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Raul Santelices",
            "Affiliation": "University of Notre Dame, USA",
            "Key": "Raul Santelices @ University of Notre Dame, USA",
            "Id": "807e2e94c0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fabien Dos Santos",
            "Affiliation": "Polytech Montpellier, France",
            "Key": "Fabien Dos Santos @ Polytech Montpellier, France",
            "Id": "1d444c2688",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anita Sarma",
            "Affiliation": "University of Nebraska-Lincoln, USA",
            "Key": "Anita Sarma @ University of Nebraska-Lincoln, USA",
            "Id": "ef87d244e3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ina Schaefer",
            "Affiliation": "TU Braunschweig, Germany",
            "Key": "Ina Schaefer @ TU Braunschweig, Germany",
            "Id": "59b3f50f48",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kevin A. Schneider",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "Kevin A. Schneider @ University of Saskatchewan, Canada",
            "Id": "2885f7c5db",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sibylle Schupp",
            "Affiliation": "TU Hamburg, Germany",
            "Key": "Sibylle Schupp @ TU Hamburg, Germany",
            "Id": "92bad51c63",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alexander Serebrenik",
            "Affiliation": "",
            "Key": "Alexander Serebrenik @",
            "Id": "bdaeed0867",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Abhishek Sharma",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Abhishek Sharma @ Singapore Management University, Singapore",
            "Id": "d7a50b183f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Liwei Shen",
            "Affiliation": "Fudan University, China",
            "Key": "Liwei Shen @ Fudan University, China",
            "Id": "bb19b56485",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David C. Shepherd",
            "Affiliation": "ABB, USA",
            "Key": "David C. Shepherd @ ABB, USA",
            "Id": "523879c079",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Emad Shihab",
            "Affiliation": "Concordia University, Canada",
            "Key": "Emad Shihab @ Concordia University, Canada",
            "Id": "e4e544539a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mark Shtern",
            "Affiliation": "York University, Canada",
            "Key": "Mark Shtern @ York University, Canada",
            "Id": "98eeb6e906",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Leonardo Humberto Silva",
            "Affiliation": "Federal Institute of Northern Minas Gerais, Brazil",
            "Key": "Leonardo Humberto Silva @ Federal Institute of Northern Minas Gerais, Brazil",
            "Id": "d3aeed20c0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jose Ricardo da Silva Junior",
            "Affiliation": "Federal Fluminense University, Brazil",
            "Key": "Jose Ricardo da Silva Junior @ Federal Fluminense University, Brazil",
            "Id": "430bb593f4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Vineet Singh",
            "Affiliation": "University of California at Riverside, USA",
            "Key": "Vineet Singh @ University of California at Riverside, USA",
            "Id": "0551d2b47a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eleni Stroulia",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Eleni Stroulia @ University of Alberta, Canada",
            "Id": "a3cbe4dfc7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xiaohong Su",
            "Affiliation": "Harbin Institute of Technology, China",
            "Key": "Xiaohong Su @ Harbin Institute of Technology, China",
            "Id": "74db2df650",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xiaobing Sun",
            "Affiliation": "Yangzhou University, China / Nanjing University, China",
            "Key": "Xiaobing Sun @ Yangzhou University, China / Nanjing University, China",
            "Id": "957efbec92",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sofiène Tahar",
            "Affiliation": "Concordia University, Canada",
            "Key": "Sofiène Tahar @ Concordia University, Canada",
            "Id": "13334727ce",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kolyang Dina Taiwe",
            "Affiliation": "University of Maroua, Cameroon",
            "Key": "Kolyang Dina Taiwe @ University of Maroua, Cameroon",
            "Id": "307f81d619",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lin Tan",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Lin Tan @ University of Waterloo, Canada",
            "Id": "9398ef43f0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chakkrit Tantithamthavorn",
            "Affiliation": "NAIST, Japan",
            "Key": "Chakkrit Tantithamthavorn @ NAIST, Japan",
            "Id": "57a9c12eb4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Patanamon Thongtanunam",
            "Affiliation": "NAIST, Japan",
            "Key": "Patanamon Thongtanunam @ NAIST, Japan",
            "Id": "5cd7f6e729",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ferdian Thung",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Ferdian Thung @ Singapore Management University, Singapore",
            "Id": "9a5f452710",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yuan Tian",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Yuan Tian @ Singapore Management University, Singapore",
            "Id": "db8dafeb08",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Finbarr Timbers",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Finbarr Timbers @ University of Alberta, Canada",
            "Id": "994f434df9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zoltán Tóth",
            "Affiliation": "University of Szeged, Hungary",
            "Key": "Zoltán Tóth @ University of Szeged, Hungary",
            "Id": "a7ce4d5686",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yuriy Tymchuk",
            "Affiliation": "University of Lugano, Switzerland",
            "Key": "Yuriy Tymchuk @ University of Lugano, Switzerland",
            "Id": "ef40e4d83f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Vassilios Tzerpos",
            "Affiliation": "York University, Canada",
            "Key": "Vassilios Tzerpos @ York University, Canada",
            "Id": "cb1054fceb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marco Tulio Valente",
            "Affiliation": "Federal University of Minas Gerais, Brazil",
            "Key": "Marco Tulio Valente @ Federal University of Minas Gerais, Brazil",
            "Id": "5e542fbcf8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Wim Veninga",
            "Affiliation": "Exact International Development, Netherlands",
            "Key": "Wim Veninga @ Exact International Development, Netherlands",
            "Id": "58793603d7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Joost Visser",
            "Affiliation": "Software Improvement Group, Netherlands",
            "Key": "Joost Visser @ Software Improvement Group, Netherlands",
            "Id": "88e332d7b6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Joost Visser",
            "Affiliation": "Software Improvement Group, Netherlands / Radboud University Nijmegen, Netherlands",
            "Key": "Joost Visser @ Software Improvement Group, Netherlands / Radboud University Nijmegen, Netherlands",
            "Id": "8279262110",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hai Wang",
            "Affiliation": "Fudan University, China",
            "Key": "Hai Wang @ Fudan University, China",
            "Id": "c86a9d9722",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shaowei Wang",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Shaowei Wang @ Singapore Management University, Singapore",
            "Id": "afae59a6b6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xinyu Wang",
            "Affiliation": "Zhejiang University, China",
            "Key": "Xinyu Wang @ Zhejiang University, China",
            "Id": "08afccdac1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yibin Wang",
            "Affiliation": "Wayne State University, USA",
            "Key": "Yibin Wang @ Wayne State University, USA",
            "Id": "f1db6a8cf2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Theresa Weber",
            "Affiliation": "Owl Computing Technologies, USA",
            "Key": "Theresa Weber @ Owl Computing Technologies, USA",
            "Id": "e5f281e7a8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mike Wexler",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Mike Wexler @ University of Waterloo, Canada",
            "Id": "c3e07c053c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Arne Wichmann",
            "Affiliation": "TU Hamburg, Germany",
            "Key": "Arne Wichmann @ TU Hamburg, Germany",
            "Id": "54a9bf5bde",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Witlatschil",
            "Affiliation": "Siemens Transformers Austria, Austria",
            "Key": "Michael Witlatschil @ Siemens Transformers Austria, Austria",
            "Id": "7a3f5c8af2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Edmund Wong",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Edmund Wong @ University of Waterloo, Canada",
            "Id": "17f61da424",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xin Xia",
            "Affiliation": "Zhejiang University, China",
            "Key": "Xin Xia @ Zhejiang University, China",
            "Id": "e7e80f36a7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhenchang Xing",
            "Affiliation": "Nanyang Technological University, Singapore",
            "Key": "Zhenchang Xing @ Nanyang Technological University, Singapore",
            "Id": "d01327844c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shouzheng Yang",
            "Affiliation": "York University, Canada",
            "Key": "Shouzheng Yang @ York University, Canada",
            "Id": "c1edf7c777",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Norihiro Yoshida",
            "Affiliation": "Nagoya University, Japan",
            "Key": "Norihiro Yoshida @ Nagoya University, Japan",
            "Id": "47b513805f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andy Zaidman",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Andy Zaidman @ Delft University of Technology, Netherlands",
            "Id": "252d01ab59",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Boze Zekan",
            "Affiliation": "York University, Canada",
            "Key": "Boze Zekan @ York University, Canada",
            "Id": "5aaaf8fe6a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cheng Zhang",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Cheng Zhang @ University of Waterloo, Canada",
            "Id": "1bf16ab68d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Feng Zhang",
            "Affiliation": "Queen's University, Canada",
            "Key": "Feng Zhang @ Queen's University, Canada",
            "Id": "ebe96d1671",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Li Zhang",
            "Affiliation": "Beihang University, China",
            "Key": "Li Zhang @ Beihang University, China",
            "Id": "946caf7b80",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Wenyun Zhao",
            "Affiliation": "Fudan University, China",
            "Key": "Wenyun Zhao @ Fudan University, China",
            "Id": "648b81dcad",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xuejiao Zhao",
            "Affiliation": "Nanyang Technological University, Singapore",
            "Key": "Xuejiao Zhao @ Nanyang Technological University, Singapore",
            "Id": "fed7ed4c88",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bo Zhou",
            "Affiliation": "Zhejiang University, China",
            "Key": "Bo Zhou @ Zhejiang University, China",
            "Id": "848fd52aca",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ying Zou",
            "Affiliation": "Queen's University, Canada",
            "Key": "Ying Zou @ Queen's University, Canada",
            "Id": "ce888ecab4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        }
    ]
}
 

