{
    "DataRevision": 1437687387,
    "Preliminary": "false",
    "Event": "RE 2015",
    "Name": "RE 2015",
    "Description": "",
    "Date": "August 24-28, 2015",
    "DateStart": "2015-08-24",
    "DateEnd": "2015-08-28",
    "Location": "Ottawa, ON, Canada",
    "Sponsors": "",
    "URL": "http://re15.org/",
    "MultiTrack": "true",
    "UseMiniPage": "true",
    "NewPagePerDay": "false",
    "NumOfParallelTracks": 3,
    "Organization": {
        "General Chairs": [
                "Daniel Amyot"
        ],
        "PC Chairs": [
                "Vincenzo Gervasi",
                "Didar Zowghi"
        ]
    },
    "SocialFeeds": [
    ],
    "VenueInfo": {
        "Name": "",
        "GPS": {
            "Latitude": 0,
            "Longitude": 0
        }
    },
    "InfoPage": {
        "xaml": "foo",
        "Elements": [
            {
                "XamlName": "ConferenceCenterMap",
                "Type": "Map",
                "GPS": {
                    "Latitude": 0,
                    "Longitude": 0
                },
                "MapLabel": ""
            },
            {
                "XamlName": "LicenseButton",
                "Type": "WebLink",
                "URL": "http://research.microsoft.com/en-US/projects/confapp/terms.aspx"
            },
            {
                "XamlName": "PrivacyButton",
                "Type": "WebLink",
                "URL": "http://privacy.microsoft.com/en-us/default.msp"
            }
        ]
    },
    "SessionPriorities": [
        "Award",
        "Invited Talk",
        "Other"
    ],
    "Items": [
        {
            "Title": "Message from the Chairs",
            "Type": "Frontmatter",
            "Key": "re15foreword-fm001-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDaniel+Amyot%2C+Didar+Zowghi%2C+and+Vincenzo+Gervasi+%22Message+from+the+Chairs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Daniel Amyot, Didar Zowghi, and Vincenzo Gervasi",
            "AffiliationsString": "",
            "Authors": [
                "Daniel Amyot @",
                "Didar Zowghi @",
                "Vincenzo Gervasi @"
            ],
            "Affiliations": [
                "",
                "",
                ""
            ],
            "Abstract": "",
            "Award": ""
        },
        {
            "Title": "Exposing the Susceptibility of Off-Nominal Behaviors in Reactive System Requirements",
            "Type": "Full Paper",
            "Key": "re15main-mainp063-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDaniel+Aceituna+and+Hyunsook+Do+%22Exposing+the+Susceptibility+of+Off-Nominal+Behaviors+in+Reactive+System+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Daniel Aceituna and Hyunsook Do",
            "AffiliationsString": "North Dakota State University, USA",
            "Authors": [
                "Daniel Aceituna @ North Dakota State University, USA",
                "Hyunsook Do @ North Dakota State University, USA"
            ],
            "Affiliations": [
                "North Dakota State University, USA",
                "North Dakota State University, USA"
            ],
            "Abstract": "Requirements are typically specified on the assumption that the system&#039;s operating environment will behave in what is considered to be an expected and nominal manner. When gathering requirements, one concern is whether the requirements are too incomplete to account for every possible, unintended, off-nominal behavior (ONB) that the operating environment can create in the system. In this paper, we present a semi-automated approach, based on the causal component model (CCM), which can expose, within a set of requirements, whether ONBs can result in undesired system states. We demonstrate how the CCM approach exposes and helps address potential off-nominal behavior problems in a set of requirements that represents a real-world product. Our case study shows that the approach can expose susceptibility to ONBs and can supply information in correcting requirements.",
            "Award": ""
        },
        {
            "Title": "Handling Knowledge Uncertainty in Risk-Based Requirements Engineering",
            "Type": "Full Paper",
            "Key": "re15main-mainp045-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAntoine+Cailliau+and+Axel+Van+Lamsweerde+%22Handling+Knowledge+Uncertainty+in+Risk-Based+Requirements+Engineering%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Antoine Cailliau and Axel Van Lamsweerde",
            "AffiliationsString": "Université Catholique de Louvain, Belgium",
            "Authors": [
                "Antoine Cailliau @ Université Catholique de Louvain, Belgium",
                "Axel Van Lamsweerde @ Université Catholique de Louvain, Belgium"
            ],
            "Affiliations": [
                "Université Catholique de Louvain, Belgium",
                "Université Catholique de Louvain, Belgium"
            ],
            "Abstract": "Requirements engineers are faced with multiple sources of uncertainty. In particular, the extent to which the identified software requirements and environment assumptions are adequate and sufficiently complete is uncertain; the extent to which they will be satisfied in the system-to-be is uncertain; and the extent to which obstacles to their satisfaction will occur is uncertain. The resolution of such domain-level uncertainty requires estimations of the likelihood that those different types of situations may or may not occur. However, the extent to which the resulting estimates are accurate is uncertain as well. This meta-level uncertainty limits current risk-based methods for requirements engineering. The paper introduces a quantitative approach for managing it. An earlier formal framework for probabilistic goals and obstacles is extended to explicitly cope with uncertainties about estimates of likelihoods of fine-grained obstacles to goal satisfaction. Such estimates are elicited from multiple sources and combined in order to reduce their uncertainty margins. The combined estimates and their uncertainties are up-propagated through obstacle refinement trees and then through the system’s goal model. Two metrics are introduced for measuring problematic uncertainties. When applied to the probability distributions obtained by up-propagation to the top-level goals, the metrics allow critical leaf obstacles with most problematic uncertainty margins to be highlighted. The proposed approach is evaluated on excerpts from a real ambulance dispatching system.",
            "Award": ""
        },
        {
            "Title": "Assessment of Risk Perception in Security Requirements Composition",
            "Type": "Full Paper",
            "Key": "re15main-mainp090-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DHanan+Hibshi%2C+Travis+D.+Breaux%2C+and+Stephen+B.+Broomell+%22Assessment+of+Risk+Perception+in+Security+Requirements+Composition%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Hanan Hibshi, Travis D. Breaux, and Stephen B. Broomell",
            "AffiliationsString": "Carnegie Mellon University, USA",
            "Authors": [
                "Hanan Hibshi @ Carnegie Mellon University, USA",
                "Travis D. Breaux @ Carnegie Mellon University, USA",
                "Stephen B. Broomell @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Security requirements analysis depends on how well-trained analysts perceive security risk, understand the impact of various vulnerabilities, and mitigate threats. When systems are composed of multiple machines, configurations, and software components that interact with each other, risk perception must account for the composition of security requirements. In this paper, we report on how changes to security requirements affect analysts risk perceptions and their decisions about how to modify the requirements to reach adequate security levels. We conducted two user surveys of 174 participants wherein participants assess security levels across 64 factorial vignettes. We analyzed the survey results using multi-level modeling to test for the effect of security requirements composition on participants’ overall security adequacy ratings and on their ratings of individual requirements. We accompanied this analysis with grounded analysis of elicited requirements aimed at lowering the security risk. Our results suggest that requirements composition affects experts’ adequacy ratings on security requirements. In addition, we identified three categories of requirements modifications, called refinements, replacements and reinforcements, and we measured how these categories compare with overall perceived security risk. Finally, we discuss the future impact of our work in security requirements assessment practice.",
            "Award": ""
        },
        {
            "Title": "A Quality Model for the Systematic Assessment of Requirements Traceability",
            "Type": "Full Paper",
            "Key": "re15main-mainp121-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPatrick+Rempel+and+Patrick+M%C3%A4der+%22A+Quality+Model+for+the+Systematic+Assessment+of+Requirements+Traceability%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Patrick Rempel and Patrick Mäder",
            "AffiliationsString": "TU Ilmenau, Germany",
            "Authors": [
                "Patrick Rempel @ TU Ilmenau, Germany",
                "Patrick Mäder @ TU Ilmenau, Germany"
            ],
            "Affiliations": [
                "TU Ilmenau, Germany",
                "TU Ilmenau, Germany"
            ],
            "Abstract": "Traceability is an important quality of software requirements and allows to describe and follow their life throughout a development project. The importance of traceable requirements is reflected by the fact that requirements standards, safety regulations, and maturity models explicitly demand for it. In practice, traceability is created and maintained by humans, which make mistakes. In result, existing traces are potentially of dubious quality but serve as the foundation for high impact development decisions. We found in previous studies that practitioners miss clear guidance on how to systematically assess the quality of existing traces. In this paper, we review the elements involved in establishing traceability in a development project and derive a quality model that specifies per element the acceptable state (Traceability Gate) and unacceptable deviations (Traceability Problem) from this state. We describe and formally define how both, the acceptable states and the unacceptable deviations can be detected in order to enable practitioners to systematically assess their project&#039;s traceability. We evaluated the proposed model through an expert survey. The participating experts considered the quality model to be complete and attested that its quality criteria are of high relevance. We further found that the experts weight the occurrence of different traceability problems with different criticality. This information can be used to quantify the impact of traceability problems and to prioritize the assessment of traceability elements.",
            "Award": ""
        },
        {
            "Title": "Understanding Changes in Use Cases: A Case Study",
            "Type": "Industry Paper",
            "Key": "re15ind-indp016-p",
            "URL": "http%3A%2F%2Fwww4.in.tum.de%2F%7Efemmer%2Fworks%2F2015-uc_changes.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mohammad R. Basirati, Henning Femmer, Sebastian Eder, Martin Fritzsche, and Alexander Widera",
            "AffiliationsString": "TU München, Germany; Munich Re, Germany",
            "Authors": [
                "Mohammad R. Basirati @ TU München, Germany",
                "Henning Femmer @ TU München, Germany",
                "Sebastian Eder @ TU München, Germany",
                "Martin Fritzsche @ Munich Re, Germany",
                "Alexander Widera @ Munich Re, Germany"
            ],
            "Affiliations": [
                "TU München, Germany",
                "TU München, Germany",
                "TU München, Germany",
                "Munich Re, Germany",
                "Munich Re, Germany"
            ],
            "Abstract": "Requirements change and so (should) do requirements artifacts, such as use cases. However, we have little knowledge about which changes requirements engineers actually perform on use cases. We do not know what is changing, at which locations use cases change and need a deeper understanding of which changes are problematic in terms of difficult or risky. To explore these challenges from an industrial point of view, we conducted a mixed methods case study in which we analyze 15 month of changes in use cases in an industrial software project. The study provided interesting observations for both practitioners and researchers involved: First, the most frequently changing use cases had an issue in their structuring. Second, alternative flows (i.e., variations or extensions of the main flow) were especially prone to changes. Third, changes in content (semantic changes) and in presentation of the content (syntactic changes) happen similarly frequently. Last, a qualitative and quantitative analysis aiming at a deeper understanding of problematic changes identified taxonomy changes, as well as locally or temporally dispersed changes as particularly difficult and risky. In this paper, we contribute a first empirical inquiry for understanding the maintainability of use cases: The presented study provides empirical evidence that there are particular maintenance risks and suggests to continuously analyze local and temporal dispersion.",
            "Award": ""
        },
        {
            "Title": "An Information Theoretic Approach for Extracting and Tracing Non-functional Requirements",
            "Type": "Full Paper",
            "Key": "re15main-mainp023-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAnas+Mahmoud+%22An+Information+Theoretic+Approach+for+Extracting+and+Tracing+Non-functional+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Anas Mahmoud",
            "AffiliationsString": "Louisiana State University, USA",
            "Authors": [
                "Anas Mahmoud @ Louisiana State University, USA"
            ],
            "Affiliations": [
                "Louisiana State University, USA"
            ],
            "Abstract": "Non-functional requirements (NFRs) are high-level quality constraints that a software system should exhibit. Detecting such constraints early in the process is critical for the stability of software architectural design. However, due to their pervasive nature, and the lack of robust modeling and documentation techniques, NFRs are often overlooked during the requirements elicitation phase. Realizing such constraints at later stages of the development process often leads to architecture erosion and poor traceability. Motivated by these observations, we propose an unsupervised, computationally efficient, and scalable approach for extracting and tracing NFRs in software systems. Based on main assumptions of the cluster hypothesis and information theory, the proposed approach exploits the semantic knowledge embedded in the textual content of requirements specifications to discover, classify, and trace high-level software quality constraints imposed by the system’s functional features. Three experimental systems are used to conduct the experimental analysis in this paper. Results show that the proposed approach can discover software NFRs with an average accuracy of 73%, enabling these NFRs to be traced to their implementations with accuracy levels adequate for practical applications.",
            "Award": ""
        },
        {
            "Title": "A Requirements Monitoring Model for Systems of Systems",
            "Type": "Full Paper",
            "Key": "re15main-mainp043-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMichael+Vierhauser%2C+Rick+Rabiser%2C+Paul+Gr%C3%BCnbacher%2C+and+Benedikt+Aumayr+%22A+Requirements+Monitoring+Model+for+Systems+of+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Michael Vierhauser, Rick Rabiser, Paul Grünbacher, and Benedikt Aumayr",
            "AffiliationsString": "JKU Linz, Austria",
            "Authors": [
                "Michael Vierhauser @ JKU Linz, Austria",
                "Rick Rabiser @ JKU Linz, Austria",
                "Paul Grünbacher @ JKU Linz, Austria",
                "Benedikt Aumayr @ JKU Linz, Austria"
            ],
            "Affiliations": [
                "JKU Linz, Austria",
                "JKU Linz, Austria",
                "JKU Linz, Austria",
                "JKU Linz, Austria"
            ],
            "Abstract": "Many software systems today can be characterized as systems of systems (SoS) comprising interrelated and heterogeneous systems developed by diverse teams over many years. Due to their scale, complexity, and heterogeneity engineers face significant challenges when determining the compliance of SoS with their requirements. Requirements monitoring approaches are a viable solution for checking system properties at runtime. However, existing approaches do not adequately consider the characteristics of SoS: different types of requirements exist at different levels and across different systems; requirements are maintained by different stakeholders; and systems are implemented using diverse technologies. This paper describes a three-dimensional requirements monitoring model (RMM) for SoS providing the following contributions: (i) our approach allows modeling the monitoring scopes of requirements with respect to the SoS architecture; (ii) it employs event models to abstract from different technologies and systems to be monitored; and (iii) it supports instantiating the RMM at runtime depending on the actual SoS configuration. To evaluate the feasibility of our approach we created a RMM for a real-world SoS from the automation software domain. We evaluated the model by instantiating it using an existing monitoring framework and a simulator running parts of this SoS. The results indicate that the model is sufficiently expressive to support monitoring SoS requirements of a directed SoS. It further facilitates diagnosis by discovering violations of requirements across different levels and systems in realistic monitoring scenarios.",
            "Award": ""
        },
        {
            "Title": "Experience Requirements in Video Games: Definition and Testability",
            "Type": "Industry Paper",
            "Key": "re15ind-indp010-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDavid+Callele%2C+Philip+Dueck%2C+Krzysztof+Wnuk%2C+and+Peitsa+Hynninen+%22Experience+Requirements+in+Video+Games%3A+Definition+and+Testability%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "David Callele, Philip Dueck, Krzysztof Wnuk, and Peitsa Hynninen",
            "AffiliationsString": "Experience First Design, Canada; Blekinge Institute of Technology, Sweden; Aalto University, Finland",
            "Authors": [
                "David Callele @ Experience First Design, Canada",
                "Philip Dueck @ Experience First Design, Canada",
                "Krzysztof Wnuk @ Blekinge Institute of Technology, Sweden",
                "Peitsa Hynninen @ Aalto University, Finland"
            ],
            "Affiliations": [
                "Experience First Design, Canada",
                "Experience First Design, Canada",
                "Blekinge Institute of Technology, Sweden",
                "Aalto University, Finland"
            ],
            "Abstract": "A properly formed requirement is testable, a necessity for ensuring that design goals are met. While challenging in productivity applications, entertainment applications such as games compound the problem due to their subjective nature. We report here on our efforts to create testable experience requirements, the associated scope challenges and challenges with test design and result interpretation. We further report on issues experienced when performing focus group testing and provide practitioner guidance.",
            "Award": ""
        },
        {
            "Title": "Using the Requirements Specification to Infer the Implicit Test Status of Requirements",
            "Type": "Industry Paper",
            "Key": "re15ind-indp019-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTobias+Morciniec+and+Andreas+Podelski+%22Using+the+Requirements+Specification+to+Infer+the+Implicit+Test+Status+of+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tobias Morciniec and Andreas Podelski",
            "AffiliationsString": "Daimler, Germany; University of Freiburg, Germany",
            "Authors": [
                "Tobias Morciniec @ Daimler, Germany",
                "Andreas Podelski @ University of Freiburg, Germany"
            ],
            "Affiliations": [
                "Daimler, Germany",
                "University of Freiburg, Germany"
            ],
            "Abstract": "We investigate a method to infer the implicit test status of requirements and thus increase the number of requirements for which the test status is known. The general idea is to improve the data set for measuring the maturity of the system in the current release. The inference is based on the structuring mechanisms (hierarchy, types) which are typically used to document the (natural language) requirements specification. We present a case study in the context of the development process for Mercedes-Benz passenger cars at Daimler AG. The results of the case study indicate the usefulness of the structuring mechanisms in the requirements specification as the basis for the inference. In particular, the number of requirements for which the status is known could be increased by almost a third.",
            "Award": ""
        },
        {
            "Title": "Selecting Creativity Techniques for Creative Requirements: An Evaluation of Four Techniques using Creativity Workshops",
            "Type": "Full Paper",
            "Key": "re15main-mainp033-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRichard+Berntsson+Svensson+and+Maryam+Taghavianfar+%22Selecting+Creativity+Techniques+for+Creative+Requirements%3A+An+Evaluation+of+Four+Techniques+using+Creativity+Workshops%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Richard Berntsson Svensson and Maryam Taghavianfar",
            "AffiliationsString": "Blekinge Institute of Technology, Sweden; Chalmers University of Technology, Sweden",
            "Authors": [
                "Richard Berntsson Svensson @ Blekinge Institute of Technology, Sweden",
                "Maryam Taghavianfar @ Chalmers University of Technology, Sweden"
            ],
            "Affiliations": [
                "Blekinge Institute of Technology, Sweden",
                "Chalmers University of Technology, Sweden"
            ],
            "Abstract": "Requirements engineering is recognized as a creative process where stakeholders jointly discover new creative ideas for innovative and novel products that eventually are expressed as requirements. This paper evaluates four different creativity techniques, namely Hall of Fame, Constraint Removal, Brainstorming, and Idea Box, using creativity workshops with students and industry practitioners. In total, 34 creativity workshops were conducted with 90 students from two universities, and 86 industrial practitioners from six companies. The results from this study indicate that Brainstorming can generate by far the most ideas, while Hall of Fame generates most creative ideas. Idea Box generates the least number of ideas, and the least number of creative ideas. Finally, Hall of Fame was the technique that led to the most number of requirements that was included in future releases of the products.",
            "Award": ""
        },
        {
            "Title": "Sketching and Notation Creation with FlexiSketch Team: Evaluating a New Means for Collaborative Requirements Elicitation",
            "Type": "Full Paper",
            "Key": "re15main-mainp125-p",
            "URL": "https%3A%2F%2Ffiles.ifi.uzh.ch%2Frerg%2Fpublications%2FRE15-FlexiSketch-150619.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Dustin Wüest, Norbert Seyff, and Martin Glinz",
            "AffiliationsString": "University of Zurich, Switzerland; University of Applied Sciences and Arts Northwestern Switzerland, Switzerland",
            "Authors": [
                "Dustin Wüest @ University of Zurich, Switzerland",
                "Norbert Seyff @ University of Applied Sciences and Arts Northwestern Switzerland, Switzerland / University of Zurich, Switzerland",
                "Martin Glinz @ University of Zurich, Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "University of Applied Sciences and Arts Northwestern Switzerland, Switzerland / University of Zurich, Switzerland",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "Whiteboards and paper allow for any kind of notations and are easy to use. Requirements engineers love to use them in creative requirements elicitation and design sessions. However, the resulting diagram sketches cannot be interpreted by software modeling tools. We have developed FlexiSketch as an alternative to whiteboards in previous work. It is a mobile tool for model-based sketching of free-form diagrams that allows the definition and re-use of diagramming notations on the fly. The latest version of the tool, called FlexiSketch Team, supports collaboration with multiple tablets and an electronic whiteboard, such that several users can work simultaneously on the same model sketch. In this paper we present an exploratory study about how novice and experienced engineers sketch and define ad-hoc notations collaboratively in early requirements elicitation sessions when supported by our tool. Results show that participants incrementally build notations by defining language constructs the first time they use them. Participants considered the option to re-use defined constructs to be a big motivational factor for providing type definitions. They found our approach useful for longer sketching sessions and situations where sketches are re-used later on.",
            "Award": ""
        },
        {
            "Title": "Requirements Engineering: The Quest for the Dependent Variable",
            "Type": "Full Paper",
            "Key": "re15main-mainp008-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DHannes+Holm%2C+Teodor+Sommestad%2C+and+Johan+Bengtsson+%22Requirements+Engineering%3A+The+Quest+for+the+Dependent+Variable%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Hannes Holm, Teodor Sommestad, and Johan Bengtsson",
            "AffiliationsString": "Swedish Defence Research Agency, Sweden",
            "Authors": [
                "Hannes Holm @ Swedish Defence Research Agency, Sweden",
                "Teodor Sommestad @ Swedish Defence Research Agency, Sweden",
                "Johan Bengtsson @ Swedish Defence Research Agency, Sweden"
            ],
            "Affiliations": [
                "Swedish Defence Research Agency, Sweden",
                "Swedish Defence Research Agency, Sweden",
                "Swedish Defence Research Agency, Sweden"
            ],
            "Abstract": "Requirements engineering is a vibrant and broad research area. It covers a range of activities with different objectives. By reviewing experiments previously included in systematic literature reviews, this paper provides an overview of the dependent variables used in experimental requirements engineering research. This paper also identifies the theoretical motivation for the use of these variables in the experiments. The results show that a wide range of different variables has been applied in experiments and operationalized through both subjective assessments (e.g., subjects’ perceived utility of a technique) and objective measurements (e.g., the number of defects found in a requirements specification). The theoretical basis for these variables and operationalizations are unclear in most cases. Directions for theoretical work to identify suitable dependent variables are provided.",
            "Award": ""
        },
        {
            "Title": "Systematic Elicitation of Mode Models for Multifunctional Systems",
            "Type": "Industry Paper",
            "Key": "re15ind-indp003-p",
            "URL": "http%3A%2F%2Fwww4.in.tum.de%2F%7Efemmer%2Fworks%2F2015-modemodels.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Andreas Vogelsang, Henning Femmer, and Christian Winkler",
            "AffiliationsString": "TU München, Germany; MAN Truck & Bus, Germany",
            "Authors": [
                "Andreas Vogelsang @ TU München, Germany",
                "Henning Femmer @ TU München, Germany",
                "Christian Winkler @ MAN Truck & Bus, Germany"
            ],
            "Affiliations": [
                "TU München, Germany",
                "TU München, Germany",
                "MAN Truck & Bus, Germany"
            ],
            "Abstract": "Many requirements engineering approaches structure and specify requirements based on the notion of modes or system states. The set of all modes is usually considered as the mode model of a system or problem domain. However, it is neither clear how such a mode model can be elicited systematically, nor whether it is realistic to elicit a mode model for a productive system with regard to size and comprehensibility. In this paper, we introduce three elicitation approaches for mode models. We applied the three approaches in an industrial automotive context and assessed the resulting mode models with respect to size, complexity, and differences to each other. Our results show that all elicitation approaches were capable of eliciting modes, which were structured in mode models with 20 to 42 modes. From these results, we conclude that it is possible to elicit manageable mode models for an entire system in a productive context. In our case, the practitioners decided to integrate our model in their feature specification and analysis process.",
            "Award": ""
        },
        {
            "Title": "Requirements Problems in the Development of a New User Interface for Healthcare Equipment",
            "Type": "Industry Paper",
            "Key": "re15ind-indp004-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJens+B%C3%A6k+J%C3%B8rgensen%2C+Maria+Holmegaard%2C+Michael+S%C3%B8rensen+Loft%2C+and+Martin+Stig+Stissing+%22Requirements+Problems+in+the+Development+of+a+New+User+Interface+for+Healthcare+Equipment%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jens Bæk Jørgensen, Maria Holmegaard, Michael Sørensen Loft, and Martin Stig Stissing",
            "AffiliationsString": "Mjølner Informatics, Denmark",
            "Authors": [
                "Jens Bæk Jørgensen @ Mjølner Informatics, Denmark",
                "Maria Holmegaard @ Mjølner Informatics, Denmark",
                "Michael Sørensen Loft @ Mjølner Informatics, Denmark",
                "Martin Stig Stissing @ Mjølner Informatics, Denmark"
            ],
            "Affiliations": [
                "Mjølner Informatics, Denmark",
                "Mjølner Informatics, Denmark",
                "Mjølner Informatics, Denmark",
                "Mjølner Informatics, Denmark"
            ],
            "Abstract": "In August 2013, our company started work for an industrial customer. First, we developed a prototype and conducted field studies in small-scale projects. This was successful and the basis for a larger project about development of a new user interface for healthcare equipment. A main aim for us was to use this project as starting point for establishing a strategic, long-term relationship with this customer. However, we were not successful. In November 2014, our customer chose to take over the development themselves. We were too expensive, used too many hours and were not able to provide useful estimates, they said. In this paper, we describe the project and analyze causes to our customer’s decision. We also look at possible alternatives to the actions we took in the project and discuss whether we could have done better. A root cause to our customer’s dissatisfaction is related to requirements and handling of requirements.",
            "Award": ""
        },
        {
            "Title": "Forging High-Quality User Stories: Towards a Discipline for Agile Requirements",
            "Type": "Full Paper",
            "Key": "re15main-mainp053-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DGarm+Lucassen%2C+Fabiano+Dalpiaz%2C+Sjaak+Brinkkemper%2C+and+J.M.E.M.+van+der+Werf+%22Forging+High-Quality+User+Stories%3A+Towards+a+Discipline+for+Agile+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Garm Lucassen, Fabiano Dalpiaz, Sjaak Brinkkemper, and J.M.E.M. van der Werf",
            "AffiliationsString": "Utrecht University, Netherlands",
            "Authors": [
                "Garm Lucassen @ Utrecht University, Netherlands",
                "Fabiano Dalpiaz @ Utrecht University, Netherlands",
                "Sjaak Brinkkemper @ Utrecht University, Netherlands",
                "J.M.E.M. van der Werf @ Utrecht University, Netherlands"
            ],
            "Affiliations": [
                "Utrecht University, Netherlands",
                "Utrecht University, Netherlands",
                "Utrecht University, Netherlands",
                "Utrecht University, Netherlands"
            ],
            "Abstract": "User stories are a widely used notation for formulating requirements in agile development projects. Despite their popularity in industry, little to no academic work is available on assessing their quality. The few existing approaches are too generic or employ highly qualitative metrics. We propose the Quality User Story Framework, consisting of 14 quality criteria that user story writers should strive to conform to. Additionally, we introduce the conceptual model of a user story, which we rely on to design the AQUSA software tool. AQUSA aids requirements engineers in turning raw user stories into higher-quality ones by exposing defects and deviations from good practice in user stories. We evaluate our work by applying the framework and a prototype implementation to three user story sets from industry.",
            "Award": ""
        },
        {
            "Title": "Agile Requirements Engineering with Prototyping: A Case Study",
            "Type": "Industry Paper",
            "Key": "re15ind-indp011-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMarja+K%C3%A4pyaho+and+Marjo+Kauppinen+%22Agile+Requirements+Engineering+with+Prototyping%3A+A+Case+Study%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Marja Käpyaho and Marjo Kauppinen",
            "AffiliationsString": "Futurice, Finland; Aalto University, Finland",
            "Authors": [
                "Marja Käpyaho @ Futurice, Finland / Aalto University, Finland",
                "Marjo Kauppinen @ Aalto University, Finland"
            ],
            "Affiliations": [
                "Futurice, Finland / Aalto University, Finland",
                "Aalto University, Finland"
            ],
            "Abstract": "The rise of agile software development methods has led to the abandonment of many traditional practices especially in requirements engineering (RE). Agile RE is still a relatively new research area and the growing use of agile methods in large projects is forcing companies to look for more formal practices for RE. This paper describes experiences gained from a case study of a large agile project. The goal of this case study was to explore how prototyping can solve the challenges of agile RE. Our findings indicate that while prototyping can help with some challenges of agile RE such as lack of documentation, motivation for RE work and poor quality communication, it also needs complementary practices to reach its full potential. These practices include reviewing the big picture regularly, keeping track of quality requirements, and using ATDD (Acceptance Test Driven Development). Key words: prototyping, agile requirements engineering",
            "Award": ""
        },
        {
            "Title": "The Need of Complementing Plan-Driven Requirements Engineering with Emerging Communication: Experiences from Volvo Car Group",
            "Type": "Industry Paper",
            "Key": "re15ind-indp026-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DUlf+Eliasson%2C+Rogardt+Heldal%2C+Eric+Knauss%2C+and+Patrizio+Pelliccione+%22The+Need+of+Complementing+Plan-Driven+Requirements+Engineering+with+Emerging+Communication%3A+Experiences+from+Volvo+Car+Group%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Ulf Eliasson, Rogardt Heldal, Eric Knauss, and Patrizio Pelliccione",
            "AffiliationsString": "Volvo, Sweden; Chalmers University of Technology, Sweden; University of Gothenburg, Sweden",
            "Authors": [
                "Ulf Eliasson @ Volvo, Sweden",
                "Rogardt Heldal @ Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
                "Eric Knauss @ Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
                "Patrizio Pelliccione @ Chalmers University of Technology, Sweden / University of Gothenburg, Sweden"
            ],
            "Affiliations": [
                "Volvo, Sweden",
                "Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
                "Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
                "Chalmers University of Technology, Sweden / University of Gothenburg, Sweden"
            ],
            "Abstract": "The automotive industry is currently going through an enormous change, transitioning from being pure hardware and mechanical companies to becoming more software focused. Currently, software development is embedded into a V-Model process that defines how software requirements are extracted from system requirements. In recent years, OEMs have come to recognize the importance and opportunities offered by software, which include better management and shorter time-to-market of distinguishing features. Strategies to better utilize software include in-house software development and new ways to collaborate with suppliers. However, in their effort to take advantage of these opportunities, engineers struggle with the formal process imposed on software development. In this paper, we investigate the impact of this struggle on the flow of requirements, including challenges and practices. We found that new ways of working with requirements had emerged that are partly not supported, partly hindered by the old tooling and processes for requirements engineering. Requirements flow both vertical and horizontal in the organization and across the supply-chain. Support for the new way of working should allow us to refine requirements iteratively throughout their life-cycle, handle the discussion of rationales, and to manage assumptions. We found strategies of achieving this to differ not only between OEMs, but also between different divisions inside the OEMs.",
            "Award": ""
        },
        {
            "Title": "Ambiguity as a Resource to Disclose Tacit Knowledge",
            "Type": "Full Paper",
            "Key": "re15main-mainp012-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAlessio+Ferrari%2C+Paola+Spoletini%2C+and+Stefania+Gnesi+%22Ambiguity+as+a+Resource+to+Disclose+Tacit+Knowledge%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Alessio Ferrari, Paola Spoletini, and Stefania Gnesi",
            "AffiliationsString": "ISTI-CNR, Italy; Kennesaw State University, USA",
            "Authors": [
                "Alessio Ferrari @ ISTI-CNR, Italy",
                "Paola Spoletini @ Kennesaw State University, USA",
                "Stefania Gnesi @ ISTI-CNR, Italy"
            ],
            "Affiliations": [
                "ISTI-CNR, Italy",
                "Kennesaw State University, USA",
                "ISTI-CNR, Italy"
            ],
            "Abstract": "Interviews are the most common and effective means to perform requirements elicitation and support knowledge transfer between a customer and a requirements analyst. Ambiguity in communication is often perceived as a major obstacle for knowledge transfer, which could lead to unclear and incomplete requirements documents. In this paper, we analyse the role of ambiguity in requirements elicitation interviews. To this end, we have performed a set of customer-analyst interviews to observe how ambiguity occurs during requirements elicitation. From this direct experience, we have observed that ambiguity is a multi-dimensional cognitive phenomenon with a dominant pragmatic facet, and we have defined a phenomenological framework to describe the different types of ambiguity in interviews. We have also discovered that, rather than an obstacle, the occurrence of an ambiguity is often a resource for discovering tacit knowledge. Starting from this observation, we have envisioned the further steps needed in the research to exploit these findings.",
            "Award": ""
        },
        {
            "Title": "From Requirements Elicitation to Variability Analysis using Repertory Grid: A Cognitive Approach",
            "Type": "Full Paper",
            "Key": "re15main-mainp026-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSangeeta+Dey+and+Seok-Won+Lee+%22From+Requirements+Elicitation+to+Variability+Analysis+using+Repertory+Grid%3A+A+Cognitive+Approach%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Sangeeta Dey and Seok-Won Lee",
            "AffiliationsString": "Ajou University, South Korea",
            "Authors": [
                "Sangeeta Dey @ Ajou University, South Korea",
                "Seok-Won Lee @ Ajou University, South Korea"
            ],
            "Affiliations": [
                "Ajou University, South Korea",
                "Ajou University, South Korea"
            ],
            "Abstract": "The growing complexity and dynamics of the execution environment have been major motivation for designing self-adaptive systems. Although significant work can be found in the field of formalizing or modeling the requirements of adaptive system, not enough attention has been paid towards the requirements elicitation techniques for the same. It is still an open challenge to elicit the users&#039; requirements in the light of various contexts and introduce the required flexibility in the system&#039;s behavior at an early phase of requirements engineering. We explore the idea of using a cognitive technique, repertory grid, to acquire the knowledge of various stakeholders along multiple dimensions of problem space and design space. We aim at discovering the scope of variations in the features of the system by capturing the intentional and technical variability in the problem space and design space respectively. A stepwise methodology for finding the right set of features in the changing context has also been provided in this work. We evaluate the proposed idea by a preliminary case study using smart home system domain.",
            "Award": ""
        },
        {
            "Title": "Resolving Goal Conflicts via Argumentation-Based Analysis of Competing Hypotheses",
            "Type": "Full Paper",
            "Key": "re15main-mainp093-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPradeep+K.+Murukannaiah%2C+Anup+K.+Kalia%2C+Pankaj+R.+Telang%2C+and+Munindar+P.+Singh+%22Resolving+Goal+Conflicts+via+Argumentation-Based+Analysis+of+Competing+Hypotheses%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Pradeep K. Murukannaiah, Anup K. Kalia, Pankaj R. Telang, and Munindar P. Singh",
            "AffiliationsString": "North Carolina State University, USA; Cisco Systems, USA",
            "Authors": [
                "Pradeep K. Murukannaiah @ North Carolina State University, USA",
                "Anup K. Kalia @ North Carolina State University, USA",
                "Pankaj R. Telang @ Cisco Systems, USA",
                "Munindar P. Singh @ North Carolina State University, USA"
            ],
            "Affiliations": [
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "Cisco Systems, USA",
                "North Carolina State University, USA"
            ],
            "Abstract": "A stakeholder’s beliefs influence his or her goals. However, a stakeholder&#039;s beliefs may not be consistent with the goals of all stakeholders of a system being constructed. Such belief-goal inconsistencies could manifest themselves as conflicting goals of the system to be. We propose Arg-ACH, a novel approach for capturing inconsistencies between stakeholders&#039; goals and beliefs, and resolving goal conflicts. Arg-ACH employs a hybrid of (1) the analysis of competing hypotheses (ACH), a structured analytic technique, for systematically eliciting stakeholders&#039; goals and beliefs, and (2) rational argumentation for determining belief-goal inconsistencies to resolve conflicts. Arg-ACH treats conflicting goals as hypotheses that compete with each other and the winning hypothesis as a goal of the system to be. Arg-ACH systematically captures the trail of a requirements engineer&#039;s thought process in resolving conflicts. We evaluated Arg-ACH via a study in which 20 subjects applied Arg-ACH or ACH to resolve goal conflicts in a sociotechnical system concerning national security. We found that Arg-ACH is superior to ACH with respect to completeness and coverage of belief search; length of belief chaining; ease of use; explicitness of the assumptions made; and repeatability of conclusions across subjects. Not surprisingly, Arg-ACH required more time than ACH: although this is justified by improvements in quality, the gap could be reduced through better tooling.",
            "Award": ""
        },
        {
            "Title": "Feature Lifecycles as They Spread, Migrate, Remain, and Die in App Stores",
            "Type": "Full Paper",
            "Key": "re15main-mainp036-p",
            "URL": "http%3A%2F%2Fwww0.cs.ucl.ac.uk%2Fstaff%2FF.Sarro%2Fresource%2Fpapers%2FsarroRE15.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww0.cs.ucl.ac.uk%2Fstaff%2FF.Sarro%2Fprojects%2FUCLappA%2Fpublications.html",
            "DOI": "",
            "PersonsString": "Federica Sarro, Afnan Al-Subaihin, Mark Harman, Yue Jia, William Martin, and Yuanyuan Zhang",
            "AffiliationsString": "University College London, UK",
            "Authors": [
                "Federica Sarro @ University College London, UK",
                "Afnan Al-Subaihin @ University College London, UK",
                "Mark Harman @ University College London, UK",
                "Yue Jia @ University College London, UK",
                "William Martin @ University College London, UK",
                "Yuanyuan Zhang @ University College London, UK"
            ],
            "Affiliations": [
                "University College London, UK",
                "University College London, UK",
                "University College London, UK",
                "University College London, UK",
                "University College London, UK",
                "University College London, UK"
            ],
            "Abstract": "We introduce a theoretical characterisation of feature lifecycles in app stores, to help app developers to identify trends and to find undiscovered requirements. To illustrate and motivate app feature lifecycle analysis, we use our theory to empirically analyse the migratory and non-migratory behaviours of 4,053 non-free features from two App Stores (Samsung and BlackBerry). The results reveal that, in both stores, intransitive features (those that neither migrate nor die out) exhibit significantly different behaviours with regard to important properties, such as their price. Further correlation analysis also highlights differences between trends relating price, rating, and popularity. Our results indicate that feature lifecycle analysis can yield insights that may also help developers to understand feature behaviours and attribute relationships.",
            "Award": ""
        },
        {
            "Title": "Bug Report, Feature Request, or Simply Praise? On Automatically Classifying App Reviews",
            "Type": "Full Paper",
            "Key": "re15main-mainp048-p",
            "URL": "https%3A%2F%2Fmobis.informatik.uni-hamburg.de%2Fwp-content%2Fuploads%2F2015%2F06%2Freview_classification_preprint.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Walid Maalej and Hadeer Nabil",
            "AffiliationsString": "University of Hamburg, Germany",
            "Authors": [
                "Walid Maalej @ University of Hamburg, Germany",
                "Hadeer Nabil @ University of Hamburg, Germany"
            ],
            "Affiliations": [
                "University of Hamburg, Germany",
                "University of Hamburg, Germany"
            ],
            "Abstract": "App stores like Google Play and Apple App Store have over 3 Million apps covering nearly every kind of software and service. Billions of users regularly download, use, and review these apps. Recent studies have shown that reviews written by the users represent a rich source of information for the app vendors and the developers, as they include information about bugs, ideas for new features, or documentation of released features. This paper introduces several probabilistic techniques to classify app reviews into four types: bug reports, feature requests, user experiences, and ratings. For this we use review metadata such as the star rating and the tense, as well as, text classification, natural language processing, and sentiment analysis techniques. We conducted a series of experiments to compare the accuracy of the techniques and compared them with simple string matching. We found that metadata alone results in a poor classification accuracy. When combined with natural language processing, the classification precision got between 70-95% while the recall between 80-90%. Multiple binary classifiers outperformed single multiclass classifiers. Our results impact the design of review analytics tools which help app vendors, developers, and users to deal with the large amount of reviews, filter critical reviews, and assign them to the appropriate stakeholders.",
            "Award": ""
        },
        {
            "Title": "Detecting Repurposing and Over-Collection in Multi-party Privacy Requirements Specifications",
            "Type": "Full Paper",
            "Key": "re15main-mainp095-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTravis+D.+Breaux%2C+Daniel+Smullen%2C+and+Hanan+Hibshi+%22Detecting+Repurposing+and+Over-Collection+in+Multi-party+Privacy+Requirements+Specifications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Travis D. Breaux, Daniel Smullen, and Hanan Hibshi",
            "AffiliationsString": "Carnegie Mellon University, USA",
            "Authors": [
                "Travis D. Breaux @ Carnegie Mellon University, USA",
                "Daniel Smullen @ Carnegie Mellon University, USA",
                "Hanan Hibshi @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Mobile and web applications increasingly leverage service-oriented architectures in which developers integrate third-party services into end user applications. This includes identity management, mapping and navigation, cloud storage, and advertising services, among others. While service reuse reduces development time, it introduces new privacy and security risks due to data repurposing and over-collection as data is shared among multiple parties who lack transparency into third-party data practices. To address this challenge, we propose new techniques based on Description Logic (DL) for modeling multi-party data flow requirements and verifying the purpose specification and collection and use limitation principles, which are prominent privacy properties found in international standards and guidelines. We evaluate our techniques in an empirical case study that examines the data practices of the Waze mobile application and three of their service providers: Facebook Login, Amazon Web Services (a cloud storage provider), and Flurry.com (a popular mobile analytics and advertising platform). The study results include detected conflicts and violations of the principles as well as two patterns for balancing privacy and data use flexibility in requirements specifications. Analysis of automation reasoning over the DL models show that reasoning over complex compositions of multi-party systems is feasible within exponential asymptotic timeframes proportional to the policy size, the number of expressed data, and orthogonal to the number of conflicts found.",
            "Award": ""
        },
        {
            "Title": "Change Impact Analysis for Natural Language Requirements: An NLP Approach",
            "Type": "Full Paper",
            "Key": "re15main-mainp003-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DChetan+Arora%2C+Mehrdad+Sabetzadeh%2C+Arda+Goknil%2C+Lionel+C.+Briand%2C+and+Frank+Zimmer+%22Change+Impact+Analysis+for+Natural+Language+Requirements%3A+An+NLP+Approach%22",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fsites.google.com%2Fsite%2Fsvvnarcia%2F",
            "DOI": "",
            "PersonsString": "Chetan Arora, Mehrdad Sabetzadeh, Arda Goknil, Lionel C. Briand, and Frank Zimmer",
            "AffiliationsString": "University of Luxembourg, Luxembourg; SES TechCom, Luxembourg",
            "Authors": [
                "Chetan Arora @ University of Luxembourg, Luxembourg",
                "Mehrdad Sabetzadeh @ University of Luxembourg, Luxembourg",
                "Arda Goknil @ University of Luxembourg, Luxembourg",
                "Lionel C. Briand @ University of Luxembourg, Luxembourg",
                "Frank Zimmer @ SES TechCom, Luxembourg"
            ],
            "Affiliations": [
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg",
                "SES TechCom, Luxembourg"
            ],
            "Abstract": "Requirements are subject to frequent changes as a way to ensure that they reflect the current best understanding of a system, and to respond to factors such as new and evolving needs. Changing one requirement in a requirements specification may warrant further changes to the specification, so that the overall correctness and consistency of the specification can be maintained. A manual analysis of how a change to one requirement impacts other requirements is time-consuming and presents a challenge for large requirements specifications. We propose an approach based on Natural Language Processing (NLP) for analyzing the impact of change in Natural Language (NL) requirements. Our focus on NL requirements is motivated by the prevalent use of these requirements, particularly in industry. Our approach automatically detects and takes into account the phrasal structure of requirements statements. We argue about the importance of capturing the conditions under which change should propagate to enable more accurate change impact analysis. We propose a quantitative measure for calculating how likely a requirements statement is to be impacted by a change under given conditions. We conduct an evaluation of our approach by applying it to 14 change scenarios from two industrial case studies.",
            "Award": ""
        },
        {
            "Title": "Goal and Preference Identification through Natural Language",
            "Type": "Full Paper",
            "Key": "re15main-mainp027-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DFatima+Alabdulkareem%2C+Nick+Cercone%2C+and+Sotirios+Liaskos+%22Goal+and+Preference+Identification+through+Natural+Language%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Fatima Alabdulkareem, Nick Cercone, and Sotirios Liaskos",
            "AffiliationsString": "York University, Canada",
            "Authors": [
                "Fatima Alabdulkareem @ York University, Canada",
                "Nick Cercone @ York University, Canada",
                "Sotirios Liaskos @ York University, Canada"
            ],
            "Affiliations": [
                "York University, Canada",
                "York University, Canada",
                "York University, Canada"
            ],
            "Abstract": "Goal models allow efficient representation of stakeholder goals and alternative ways by which these can be satisfied. Preferences over goals in the goal model are then used to specify criteria for selecting alternatives that fit specific contexts, situations and strategies. Given such preferences, automated reasoning tools allow for efficient exploration of such alternatives. Nevertheless, to be amenable to such automated processing, goals and preferences need to be specified in a formal language, making automated processing inaccessible to the very bearers of goals and preferences, i.e., the stakeholders. We combine natural language processing techniques to allow specification of preferences through natural language statements. The natural language statement is first matched through regular expressions to distinguish between the preference component and the goal component. The former is then mapped to a preferential strength measure, while the latter is used to identify the relevant goal in the goal model through statistical semantic similarity techniques. The result constitutes a formal representation that can be used for alternatives analysis. In this way, stakeholders can access advanced goal reasoning techniques through simple natural language preference expressions, facilitating their decision making in various requirements analysis contexts. An experimental evaluation with human participants shows that the proposed system is of substantial precision and that a mapping from natural preferential verbalizations to predefined preferential strength labels is possible through sampling from crowds.",
            "Award": ""
        },
        {
            "Title": "The Myth of Bad Passive Voice and Weak Words: An Empirical Investigation in the Automotive Industry",
            "Type": "Industry Paper",
            "Key": "re15ind-indp014-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJennifer+Krisch+and+Frank+Houdek+%22The+Myth+of+Bad+Passive+Voice+and+Weak+Words%3A+An+Empirical+Investigation+in+the+Automotive+Industry%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jennifer Krisch and Frank Houdek",
            "AffiliationsString": "Daimler, Germany",
            "Authors": [
                "Jennifer Krisch @ Daimler, Germany",
                "Frank Houdek @ Daimler, Germany"
            ],
            "Affiliations": [
                "Daimler, Germany",
                "Daimler, Germany"
            ],
            "Abstract": "In requirements engineering literature dealing with natural language specifications, we usually find writing rules like avoid passive voice or do not use weak words. Adhering to such rules should result in understandable and unambiguous requirements. Passive voice, especially when used without an explicit actor, is considered to result in incomplete requirements. The usage of weak words is considered to result in imprecise requirements that are hardly testable. But is the inversion of the claim correct, i.e. does the violation of the writing rules result in problematic specifications? At least in our environment (the passenger car development of Mercedes-Benz) we observe that authors often use passive voice, and there are many requirements containing weak words. To answer this question, we conducted an empirical investigation whose results we report in this paper. The results of this investigation are quite surprising: The use of passive voice, even when the actor is missing, is almost never problematic, as the missing information (the actor) can in most cases easily derived from the context (i.e. surrounding requirements or the general project context). The usage of weak words may be considered problematic in approximately 12% of all occurrences. For an automatic analysis on weak words linguistic patterns can be defined to detect these problematic occurrences.",
            "Award": ""
        },
        {
            "Title": "What You Ask Is What You Get: Understanding Architecturally Significant Functional Requirements",
            "Type": "Full Paper",
            "Key": "re15main-mainp042-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPreethu+Rose+Anish%2C+Maya+Daneva%2C+Jane+Cleland-Huang%2C+Roel+J.+Wieringa%2C+and+Smita+Ghaisas+%22What+You+Ask+Is+What+You+Get%3A+Understanding+Architecturally+Significant+Functional+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Preethu Rose Anish, Maya Daneva, Jane Cleland-Huang, Roel J. Wieringa, and Smita Ghaisas",
            "AffiliationsString": "Tata Consultancy Services, India; University of Twente, Netherlands; DePaul University, USA",
            "Authors": [
                "Preethu Rose Anish @ Tata Consultancy Services, India",
                "Maya Daneva @ University of Twente, Netherlands",
                "Jane Cleland-Huang @ DePaul University, USA",
                "Roel J. Wieringa @ University of Twente, Netherlands",
                "Smita Ghaisas @ Tata Consultancy Services, India"
            ],
            "Affiliations": [
                "Tata Consultancy Services, India",
                "University of Twente, Netherlands",
                "DePaul University, USA",
                "University of Twente, Netherlands",
                "Tata Consultancy Services, India"
            ],
            "Abstract": "Software architects are responsible for designing an architectural solution that satisfies the functional and non-functional requirements of the system to the fullest extent possible. However, the details they need to make informed architectural decisions are often missing from the requirements specification. An earlier study we conducted indicated that architects intuitively recognize architecturally significant requirements in a project, and often seek out relevant stakeholders in order to ask Probing Questions (PQs) that help them acquire the information they need. This paper presents results from a qualitative interview study aimed at identifying architecturally significant functional requirements’ categories from various business domains, exploring relevant PQs for each category, and then grouping PQs by type. Using inter-view data from 14 software architects in three countries, we identified 15 categories of architecturally significant functional requirements and 6 types of PQs. We found that the domain knowledge of the architect and her experience influence the choice of PQs significantly. A preliminary quantitative evaluation of the results against real-life software requirements specification documents indicated that software specifications in our sample largely do not contain the crucial architectural differentiators that may impact architectural choices and that PQs are a necessary mechanism to unearth them. Further, our findings provide the initial list of PQs which could be used to prompt business analysts to elicit architecturally significant functional requirements that the architects need.",
            "Award": ""
        },
        {
            "Title": "Reuse of Architecturally Derived Standards Requirements",
            "Type": "Industry Paper",
            "Key": "re15ind-indp002-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMichael+C.+Panis+%22Reuse+of+Architecturally+Derived+Standards+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Michael C. Panis",
            "AffiliationsString": "Teradyne, USA",
            "Authors": [
                "Michael C. Panis @ Teradyne, USA"
            ],
            "Affiliations": [
                "Teradyne, USA"
            ],
            "Abstract": "Requirements reuse promises to reduce product development cost and improve product quality. Applying a standard set of requirements to multiple products configured into the same system can ensure all the products take advantage of the system’s architectural features and do not adversely interact with each other. While existing literature provides guidance for developing requirements suitable for reuse, little has been written on the practical realities an organization faces in attempting to reuse requirements. This paper addresses that gap by describing a commercial engineering company’s deployment of a requirements reuse process, the problems encountered, the results obtained, and the plans for future improvement of the process.",
            "Award": ""
        },
        {
            "Title": "You versus Users - Who owns your roadmap?",
            "Type": "Keynote",
            "Key": "Aydin Y. Mirzaee @ FluidReview / SurveyMonkey : You versus Users - Who owns your roadmap?",
            "URL": "",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Aydin Y. Mirzaee",
            "AffiliationsString": "FluidReview; SurveyMonkey",
            "Authors": [
                "Aydin Y. Mirzaee @ FluidReview / SurveyMonkey"
            ],
            "Affiliations": [
                "FluidReview / SurveyMonkey"
            ],
            "Abstract": "",
            "Award": ""
        },
        {
            "Title": "Can you intentionally design a product that is cool?",
            "Type": "Keynote",
            "Key": "Karen Holtzblatt @ InContext Enterprises : Can you intentionally design a product that is cool?",
            "URL": "",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Karen Holtzblatt",
            "AffiliationsString": "InContext Enterprises",
            "Authors": [
                "Karen Holtzblatt @ InContext Enterprises"
            ],
            "Affiliations": [
                "InContext Enterprises"
            ],
            "Abstract": "",
            "Award": ""
        },
        {
            "Title": "Requirements, Behaviours and Software Engineering",
            "Type": "Keynote",
            "Key": "Michael Jackson @ The Open University : Requirements, Behaviours and Software Engineering",
            "URL": "",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Michael Jackson",
            "AffiliationsString": "The Open University",
            "Authors": [
                "Michael Jackson @ The Open University"
            ],
            "Affiliations": [
                "The Open University"
            ],
            "Abstract": "",
            "Award": ""
        },
        {
            "Title": "Inherent Characteristics of Traceability Artifacts: Less is More",
            "Type": "Paper",
            "Key": "re15next-nextp036-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJane+Huffman+Hayes%2C+Giuliano+Antoniol%2C+Bram+Adams%2C+and+Yann-Ga%C3%ABl+Gu%C3%A9h%C3%A9neuc+%22Inherent+Characteristics+of+Traceability+Artifacts%3A+Less+is+More%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jane Huffman Hayes, Giuliano Antoniol, Bram Adams, and Yann-Gaël Guéhéneuc",
            "AffiliationsString": "University of Kentucky, USA; Polytechnique Montréal, Canada",
            "Authors": [
                "Jane Huffman Hayes @ University of Kentucky, USA",
                "Giuliano Antoniol @ Polytechnique Montréal, Canada",
                "Bram Adams @ Polytechnique Montréal, Canada",
                "Yann-Gaël Guéhéneuc @ Polytechnique Montréal, Canada"
            ],
            "Affiliations": [
                "University of Kentucky, USA",
                "Polytechnique Montréal, Canada",
                "Polytechnique Montréal, Canada",
                "Polytechnique Montréal, Canada"
            ],
            "Abstract": "This paper describes ongoing work to characterize the inherent ease with which a textual artifact pair can be traced using an automated technique. Software traceability approaches collect varied measures to build models that automatically recover links between pairs of natural language documents. Thus far, most of the approaches use a single-step model, such as logistic regression, to identify new traceability links; however, true traceability links are by far in the minority of what is retrieved for a typical artifact pair and this reduces the performance of such models. Instead, this paper formulates the problem of traceability links as the problem of finding, for a given logistic regression model (first step), the subsets of links in the training set giving the best accuracy (in terms of G-metric) on the test set (second step). Using hill climbing with random restart for subset selection, we found that for the ChangeStyle dataset, we can classify links with a precision up to about 83% and a recall up to about 42% using a training set as small as nine true candidate links (27%) and 136 false links (out of 503 wrong links). In order to get better performance and learn the best possible logistic regression classifier, we must “discard” elements in the trace dataset that increase noise and avoid learning on links that are not representative. This is preliminary work, but has promise as it shows that few correct examples may perform better than several poor examples. Keywords: traceability, machine learning, model, logistic regression",
            "Award": ""
        },
        {
            "Title": "Trace Links Explained: An Automated Approach for Generating Rationales",
            "Type": "Paper",
            "Key": "re15next-nextp042-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJin+Guo%2C+Natawut+Monaikul%2C+and+Jane+Cleland-Huang+%22Trace+Links+Explained%3A+An+Automated+Approach+for+Generating+Rationales%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jin Guo, Natawut Monaikul, and Jane Cleland-Huang",
            "AffiliationsString": "DePaul University, USA",
            "Authors": [
                "Jin Guo @ DePaul University, USA",
                "Natawut Monaikul @ DePaul University, USA",
                "Jane Cleland-Huang @ DePaul University, USA"
            ],
            "Affiliations": [
                "DePaul University, USA",
                "DePaul University, USA",
                "DePaul University, USA"
            ],
            "Abstract": "Software Traceability is a critical element in all safety critical software systems. Trace links are created across diverse artifacts such as requirements, design, code, test cases, and hazards -- either manually or with the help of supporting tools. The links are then used to support a range of software engineering activities including impact analysis, compliance verification, and safety inspections. For traceability to effectively support these activities it is important for the meaning and rationale of each link to be clearly communicated. It is often insufficient to know that one artifact satisfies, realizes, or complies to another. Instead, it is important to know why and how it does so. Terms and phrases used to describe artifacts are connected through composition, synonymic, and generalization relationships which often can only be interpreted by domain experts. In this RE:Next! paper we propose a novel approach for utilizing domain-specific knowledge bases to generate trace link rationales. We illustrate our approach with examples of automatically generated rationales taken from the domain of Communication and Control of a Transportation system, and from a Medical Infusion pump domain.",
            "Award": ""
        },
        {
            "Title": "Handling Non-functional Requirements in Model-Driven Development: An Ongoing Industrial Survey",
            "Type": "Paper",
            "Key": "re15next-nextp003-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDavid+Ameller%2C+Xavier+Franch%2C+Cristina+G%C3%B3mez%2C+Jo%C3%A3o+Araujo%2C+Richard+Berntsson+Svensson%2C+Stefan+Biffl%2C+Jordi+Cabot%2C+Vittorio+Cortellessa%2C+Maya+Daneva%2C+Daniel+M%C3%A9ndez+Fern%C3%A1ndez%2C+Ana+Moreira%2C+Henry+Muccini%2C+Antonio+Vallecillo%2C+Manuel+Wimmer%2C+Vasco+Amaral%2C+Hugo+Bruneli%C3%A8re%2C+Loli+Burgue%C3%B1o%2C+Miguel+Goul%C3%A3o%2C+Bernhard+Sch%C3%A4tz%2C+and+Sabine+Teufl+%22Handling+Non-functional+Requirements+in+Model-Driven+Development%3A+An+Ongoing+Industrial+Survey%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "David Ameller, Xavier Franch, Cristina Gómez, João Araujo, Richard Berntsson Svensson, Stefan Biffl, Jordi Cabot, Vittorio Cortellessa, Maya Daneva, Daniel Méndez Fernández, Ana Moreira, Henry Muccini, Antonio Vallecillo, Manuel Wimmer, Vasco Amaral, Hugo Brunelière, Loli Burgueño, Miguel Goulão, Bernhard Schätz, and Sabine Teufl",
            "AffiliationsString": "Universitat Politècnica de Catalunya, Spain; Universidade Nova de Lisboa, Portugal; Blekinge Institute of Technology, Sweden; Vienna University of Technology, Austria; Open University of Catalonia, Spain; University of L'Aquila, Italy; University of Twente, Netherlands; TU München, Germany; University of Málaga, Spain; AtlanMod Team, France; Fortiss, Germany",
            "Authors": [
                "David Ameller @ Universitat Politècnica de Catalunya, Spain",
                "Xavier Franch @ Universitat Politècnica de Catalunya, Spain",
                "Cristina Gómez @ Universitat Politècnica de Catalunya, Spain",
                "João Araujo @ Universidade Nova de Lisboa, Portugal",
                "Richard Berntsson Svensson @ Blekinge Institute of Technology, Sweden",
                "Stefan Biffl @ Vienna University of Technology, Austria",
                "Jordi Cabot @ Open University of Catalonia, Spain",
                "Vittorio Cortellessa @ University of L'Aquila, Italy",
                "Maya Daneva @ University of Twente, Netherlands",
                "Daniel Méndez Fernández @ TU München, Germany",
                "Ana Moreira @ Universidade Nova de Lisboa, Portugal",
                "Henry Muccini @ University of L'Aquila, Italy",
                "Antonio Vallecillo @ University of Málaga, Spain",
                "Manuel Wimmer @ Vienna University of Technology, Austria",
                "Vasco Amaral @ Universidade Nova de Lisboa, Portugal",
                "Hugo Brunelière @ AtlanMod Team, France",
                "Loli Burgueño @ University of Málaga, Spain",
                "Miguel Goulão @ Universidade Nova de Lisboa, Portugal",
                "Bernhard Schätz @ Fortiss, Germany",
                "Sabine Teufl @ Fortiss, Germany"
            ],
            "Affiliations": [
                "Universitat Politècnica de Catalunya, Spain",
                "Universitat Politècnica de Catalunya, Spain",
                "Universitat Politècnica de Catalunya, Spain",
                "Universidade Nova de Lisboa, Portugal",
                "Blekinge Institute of Technology, Sweden",
                "Vienna University of Technology, Austria",
                "Open University of Catalonia, Spain",
                "University of L'Aquila, Italy",
                "University of Twente, Netherlands",
                "TU München, Germany",
                "Universidade Nova de Lisboa, Portugal",
                "University of L'Aquila, Italy",
                "University of Málaga, Spain",
                "Vienna University of Technology, Austria",
                "Universidade Nova de Lisboa, Portugal",
                "AtlanMod Team, France",
                "University of Málaga, Spain",
                "Universidade Nova de Lisboa, Portugal",
                "Fortiss, Germany",
                "Fortiss, Germany"
            ],
            "Abstract": "Model-Driven Development (MDD) is no longer a novel development paradigm. It has become mature from a research perspective and recent studies show its adoption in industry. Still, some issues remain a challenge. Among them, we are interested in the treatment of non-functional requirements (NFRs) in MDD processes. Very few MDD approaches have been reported to deal with NFRs (and they do it in a limited way). However, it is clear that NFRs need to be considered somehow in the final product of the MDD process. To better understand how NFRs are integrated into the existing MDD approaches, we have initiated the NFR4MDD project, a multi-national empirical study, based on interviews with companies working on MDD projects. Our project aims at surveying the state of the practice for this topic. In this paper, we summarize our research protocol and present the current status of our study. The discussion will focus on the peculiarities of our study&#039;s context and organization involving about 20 researchers from 8 European countries.",
            "Award": ""
        },
        {
            "Title": "Scalable Modeling and Analysis of Requirements Preferences: A Qualitative Approach using CI-Nets",
            "Type": "Paper",
            "Key": "re15next-nextp012-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DZachary+J.+Oster%2C+Ganesh+Ram+Santhanam%2C+and+Samik+Basu+%22Scalable+Modeling+and+Analysis+of+Requirements+Preferences%3A+A+Qualitative+Approach+using+CI-Nets%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Zachary J. Oster, Ganesh Ram Santhanam, and Samik Basu",
            "AffiliationsString": "University of Wisconsin-Whitewater, USA; Iowa State University, USA",
            "Authors": [
                "Zachary J. Oster @ University of Wisconsin-Whitewater, USA",
                "Ganesh Ram Santhanam @ Iowa State University, USA",
                "Samik Basu @ Iowa State University, USA"
            ],
            "Affiliations": [
                "University of Wisconsin-Whitewater, USA",
                "Iowa State University, USA",
                "Iowa State University, USA"
            ],
            "Abstract": "We present a framework for reasoning with preferences in the context of Goal-Oriented Requirements Engineering (GORE). Our choice of preference language, conditional importance networks (CI-nets), is motivated by the occurrence in requirements engineering of qualitative preferences and tradeoffs involving sets of items; such preferences are expressed more naturally in CI-nets than in other representations. Building on our past experience with CI-nets, we are improving the scalability and usability of CI-nets for specifying and analyzing requirements preferences. We discuss our ongoing work and long-term plans, including efforts to develop more efficient methods to identify conflicting preferences among possible requirements, guide negotiation of resolutions to such conflicts, and improve traceability and comprehension of requirements preferences.",
            "Award": ""
        },
        {
            "Title": "Rationalization of Goal Models in GRL using Formal Argumentation",
            "Type": "Paper",
            "Key": "re15next-nextp061-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMarc+van+Zee%2C+Floris+Bex%2C+and+Sepideh+Ghanavati+%22Rationalization+of+Goal+Models+in+GRL+using+Formal+Argumentation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Marc van Zee, Floris Bex, and Sepideh Ghanavati",
            "AffiliationsString": "University of Luxembourg, Luxembourg; Utrecht University, Netherlands; Luxembourg Institute of Science and Technology, Luxembourg",
            "Authors": [
                "Marc van Zee @ University of Luxembourg, Luxembourg",
                "Floris Bex @ Utrecht University, Netherlands",
                "Sepideh Ghanavati @ Luxembourg Institute of Science and Technology, Luxembourg"
            ],
            "Affiliations": [
                "University of Luxembourg, Luxembourg",
                "Utrecht University, Netherlands",
                "Luxembourg Institute of Science and Technology, Luxembourg"
            ],
            "Abstract": "We apply an existing formal framework for practical reasoning with arguments and evidence to the Goal-oriented Requirements Language (GRL), which is part of the User Requirements Notation (URN). This formal framework serves as a rationalization for elements in a GRL model: using attack relations between arguments we can automatically compute the acceptability status of elements in a GRL model, based on the acceptability status of their underlying arguments and the evidence. We integrate the formal framework into the GRL metamodel and we set out a research to further develop this framework.",
            "Award": ""
        },
        {
            "Title": "Cognitive Factors in Inconsistency Management",
            "Type": "Paper",
            "Key": "re15next-nextp018-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DIrit+Hadar+and+Anna+Zamansky+%22Cognitive+Factors+in+Inconsistency+Management%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Irit Hadar and Anna Zamansky",
            "AffiliationsString": "University of Haifa, Israel",
            "Authors": [
                "Irit Hadar @ University of Haifa, Israel",
                "Anna Zamansky @ University of Haifa, Israel"
            ],
            "Affiliations": [
                "University of Haifa, Israel",
                "University of Haifa, Israel"
            ],
            "Abstract": "Inconsistency is a major challenge in requirements engineering, commonly perceived as a problem that needs to be eliminated on sight. However, in practice maintaining consistency at all times is an intractable problem. Accordingly, recent paradigms for inconsistency management acknowledge that it is sometimes desirable to tolerate inconsistency, e.g. to allow distributed teamwork and prevent premature commitment to design decisions. However, a successful adoption of inconsistency management paradigms in industry highly depends on the human factor: intolerant attitudes of practitioners toward inconsistency may pose significant barriers to a wider acceptance of these paradigms. Thus, a thorough analysis of cognitive factors is a key to overcoming these barriers. In this paper we report on our preliminary empirical findings highlighting existing perceptions and attitudes of practitioners toward inconsistency, and propose dimensions for their classification. Based on these results, we outline a general research program for exploring cognitive factors in inconsistency management.",
            "Award": ""
        },
        {
            "Title": "Using Real Options to Manage Technical Debt in Requirements Engineering",
            "Type": "Paper",
            "Key": "re15next-nextp045-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DZahra+Shakeri+Hossein+Abad+and+Guenther+Ruhe+%22Using+Real+Options+to+Manage+Technical+Debt+in+Requirements+Engineering%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Zahra Shakeri Hossein Abad and Guenther Ruhe",
            "AffiliationsString": "University of Calgary, Canada",
            "Authors": [
                "Zahra Shakeri Hossein Abad @ University of Calgary, Canada",
                "Guenther Ruhe @ University of Calgary, Canada"
            ],
            "Affiliations": [
                "University of Calgary, Canada",
                "University of Calgary, Canada"
            ],
            "Abstract": "Abstract- Despite the importance of Requirements Engineering (RE) for the success of software products, most of the requirement decisions, such as requirement specification and prioritization, are still ad hoc and depend upon the managers&#039; preferences and the trade-offs they make. The Technical Debt (TD) metaphor looks into the trade-offs between short term and long-term goals in software development projects that may lead to increased cost in the future. This problem is mainly due to the lack of a systematic and well-defined approach to manage the high level of uncertainty in requirement decisions. In this paper, we propose to apply the real options thinking to develop a quantitative method for managing requirement decisions under uncertainty and, more specifically, for managing requirements debt in software development projects. A real option is a right without an obligation to make a specific future decision depending on how uncertainty resolves. We demonstrate the application of real options in the context of requirements debt valuation by using the binomial model combined with dynamic programming. We provide an illustrative example to show how uncertainty creates option value and influences requirement decisions and finally outline a future research agenda.",
            "Award": ""
        },
        {
            "Title": "QuantUn: Quantification of Uncertainty for the Reassessment of Requirements",
            "Type": "Paper",
            "Key": "re15next-nextp066-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DNelly+Bencomo+%22QuantUn%3A+Quantification+of+Uncertainty+for+the+Reassessment+of+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Nelly Bencomo",
            "AffiliationsString": "Aston University, UK",
            "Authors": [
                "Nelly Bencomo @ Aston University, UK"
            ],
            "Affiliations": [
                "Aston University, UK"
            ],
            "Abstract": "Self-adaptive systems (SASs) should be able to adapt to new environmental contexts dynamically. The uncertainty that demands this runtime self-adaptive capability makes it hard to formulate, validate and manage their requirements. QuantUn is part of our longer-term vision of requirements reflection, that is, the ability of a system to dynamically observe and reason about its own requirements. QuantUn&#039;s contribution to the achievement of this vision is the development of novel techniques to explicitly quantify uncertainty to support dynamic re-assessment of requirements and therefore improve decision-making for self-adaption. This short paper discusses the research gap we want to fill, present partial results and also the plan we propose to fill the gap.",
            "Award": ""
        },
        {
            "Title": "Towards Reuse in Safety Risk Analysis Based on Product Line Requirements",
            "Type": "Paper",
            "Key": "re15next-nextp002-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DHermann+Kaindl%2C+Roman+Popp%2C+and+David+Raneburger+%22Towards+Reuse+in+Safety+Risk+Analysis+Based+on+Product+Line+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Hermann Kaindl, Roman Popp, and David Raneburger",
            "AffiliationsString": "Vienna University of Technology, Austria",
            "Authors": [
                "Hermann Kaindl @ Vienna University of Technology, Austria",
                "Roman Popp @ Vienna University of Technology, Austria",
                "David Raneburger @ Vienna University of Technology, Austria"
            ],
            "Affiliations": [
                "Vienna University of Technology, Austria",
                "Vienna University of Technology, Austria",
                "Vienna University of Technology, Austria"
            ],
            "Abstract": "Risk analysis and requirements engineering for safety-critical systems are expensive and challenging, especially for the very high reliability required, e.g., in the automotive and railway industries. Currently, risk analysis is performed by safety engineers with little or no explicit reuse. Of course, these engineers build on their previous experience in this course, but explicit reuse of related artefacts, e.g., from a dedicated repository is not available according to our best knowledge. The key idea of our approach is reuse in risk analysis based on development and look-up of a repository built around product line requirements. We propose explicit reuse of related artefacts from previous risk analyses, such as information on failures, hazards and safety-related risks. Our assumption is that the risk analysis of a new product of the product line can utilize this information from similar existing products, if available. Therefore, we plan to build a repository of such artefacts and to facilitate its look-up in the course of doing risk analysis. Our innovative approach to extend product-line technology has the expected result of substantially less expensive development of safety-critical systems and shorter time-to-market in such domains through reuse of existing risk-analysis artefacts.",
            "Award": ""
        },
        {
            "Title": "An Environment-Driven Ontological Approach to Requirements Elicitation for Safety-Critical Systems",
            "Type": "Paper",
            "Key": "re15next-nextp029-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJiale+Zhou%2C+Kaj+H%C3%A4nninen%2C+Kristina+Lundqvist%2C+Yue+Lu%2C+Luciana+Provenzano%2C+and+Kristina+Forsberg+%22An+Environment-Driven+Ontological+Approach+to+Requirements+Elicitation+for+Safety-Critical+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jiale Zhou, Kaj Hänninen, Kristina Lundqvist, Yue Lu, Luciana Provenzano, and Kristina Forsberg",
            "AffiliationsString": "Mälardalen University, Sweden; Bombardier Transportation, Sweden; Saab, Sweden",
            "Authors": [
                "Jiale Zhou @ Mälardalen University, Sweden",
                "Kaj Hänninen @ Mälardalen University, Sweden",
                "Kristina Lundqvist @ Mälardalen University, Sweden",
                "Yue Lu @ Mälardalen University, Sweden",
                "Luciana Provenzano @ Bombardier Transportation, Sweden",
                "Kristina Forsberg @ Saab, Sweden"
            ],
            "Affiliations": [
                "Mälardalen University, Sweden",
                "Mälardalen University, Sweden",
                "Mälardalen University, Sweden",
                "Mälardalen University, Sweden",
                "Bombardier Transportation, Sweden",
                "Saab, Sweden"
            ],
            "Abstract": "The environment, where a safety critical system (SCS) operates, is an important source from which safety requirements of the SCS can originate. By treating the system under construction as a black box, the environment is typically documented as a number of assumptions, based on which a set of environmental safety requirements will be elicited. However, it is not a trivial task in practice to capture the environmental assumptions to elicit safety requirements. The lack of certain assumptions or too strict assumptions will either result in incomplete environmental safety requirements or waste many efforts on eliciting incorrect requirements. Moreover, the variety of operating environment for an SCS will further complicate the task, since the captured assumptions are at risk of invalidity, and consequently the elicited requirements need to be revisited to ensure safety has not been compromised by the change. This short paper presents an on-going work aiming to 1) systematically organize the knowledge of system operating environment and, 2) facilitate the elicitation of environmental safety requirements. We propose an ontological approach to achieve the objectives. In particular, we utilize conceptual ontologies to organize the environment knowledge in terms of relevant environment concepts, relations among them and axioms. Environmental assumptions are captured by instantiating the environment ontology. An ontological reasoning mechanism is also provided to support elicitation of safety requirements from the captured assumptions.",
            "Award": ""
        },
        {
            "Title": "Goals at Risk? Machine Learning at Support of Early Assessment",
            "Type": "Paper",
            "Key": "re15next-nextp030-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPaolo+Avesani%2C+Anna+Perini%2C+Alberto+Siena%2C+and+Angelo+Susi+%22Goals+at+Risk%3F+Machine+Learning+at+Support+of+Early+Assessment%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Paolo Avesani, Anna Perini, Alberto Siena, and Angelo Susi",
            "AffiliationsString": "Fondazione Bruno Kessler, Italy",
            "Authors": [
                "Paolo Avesani @ Fondazione Bruno Kessler, Italy",
                "Anna Perini @ Fondazione Bruno Kessler, Italy",
                "Alberto Siena @ Fondazione Bruno Kessler, Italy",
                "Angelo Susi @ Fondazione Bruno Kessler, Italy"
            ],
            "Affiliations": [
                "Fondazione Bruno Kessler, Italy",
                "Fondazione Bruno Kessler, Italy",
                "Fondazione Bruno Kessler, Italy",
                "Fondazione Bruno Kessler, Italy"
            ],
            "Abstract": "A relevant activity in the requirements engineering process consists in the identification, assessment and management of potential risks, which can prevent the system-to-be from meeting stakeholder needs. However, risk analysis techniques are often time- and resource- consuming activities, which may introduce in the requirements engineering process a significant overhead. To overcome this problem, we aim at supporting risk management activity in a semi-automated way, merging the capability to exploit existing risk-related information potentially present in a given organisation, with an automated ranking of the goals with respect to the level of risk the decision-maker estimates for them. In particular, this paper proposes an approach to address the general problem of risk decision-making, which combines knowledge about risks assessment techniques and Machine Learning to enable an active intervention of human evaluators in the decision process, learning from their feedback and integrating it with the organisational knowledge. The long term objective is that of improving the capacity of an organisation to be aware and to manage risks, by introducing new techniques in the field of risk management that are able to interactively and continuously extract useful knowledge from the organisation domain and from the decision-maker expertise.",
            "Award": ""
        },
        {
            "Title": "Democratic Mass Participation of Users in Requirements Engineering?",
            "Type": "Paper",
            "Key": "re15next-nextp027-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTimo+Johann+and+Walid+Maalej+%22Democratic+Mass+Participation+of+Users+in+Requirements+Engineering%3F%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Timo Johann and Walid Maalej",
            "AffiliationsString": "University of Hamburg, Germany",
            "Authors": [
                "Timo Johann @ University of Hamburg, Germany",
                "Walid Maalej @ University of Hamburg, Germany"
            ],
            "Affiliations": [
                "University of Hamburg, Germany",
                "University of Hamburg, Germany"
            ],
            "Abstract": "A large part of Requirements Engineering is concerned with involving system users, capturing their needs, and getting their feedback. As users are becoming more and more demanding, markets and technologies are evolving fast, and systems are getting more and more individual, a broad and systematic user involvement in Requirements Engineering is becoming more important than ever. This paper presents the idea of pushing user involvement in Requirements Engineering to its extreme by systematically delegating the responsibility for developing the requirements and deciding about future releases to the crowd of users. We summarize the pros and cons of this vision, its main challenges, and sketch promising solution concepts, which have been proposed and used in E-Participation and E-Democracy. We discussed our vision with ten experts from the fields of Requirements Engineering, politics, psychology, and market research, who were partly supportive partly skeptical.",
            "Award": ""
        },
        {
            "Title": "Exploiting Online Human Knowledge in Requirements Engineering",
            "Type": "Paper",
            "Key": "re15next-nextp052-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAnas+Mahmoud+and+Doris+Carver+%22Exploiting+Online+Human+Knowledge+in+Requirements+Engineering%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Anas Mahmoud and Doris Carver",
            "AffiliationsString": "Louisiana State University, USA",
            "Authors": [
                "Anas Mahmoud @ Louisiana State University, USA",
                "Doris Carver @ Louisiana State University, USA"
            ],
            "Affiliations": [
                "Louisiana State University, USA",
                "Louisiana State University, USA"
            ],
            "Abstract": "Data-driven Natural Language Processing (NLP) methods have noticeably advanced in the past few years. These advances can be tied to the drastic growth of the quality of collaborative knowledge bases (KB) available on the World Wide Web. Such KBs contain vast amounts of up-to-date structured human knowledge and common sense data that can be exploited by NLP methods to discover otherwise-unseen semantic dimensions in text, aiding in tasks related to natural language understanding, classification, and retrieval. Motivated by these observations, we describe our research agenda for exploiting online human knowledge in Requirements Engineering (RE). The underlying assumption is that requirements are a product of the human domain knowledge that is expressed mainly in natural language. In particular, our research is focused on methods that exploit the online encyclopedia Wikipedia as a textual corpus. Wikipedia provides access to a massive number of real-world concepts organized in hierarchical semantic structures. Such knowledge can be analyzed to provide automated support for several exhaustive RE activities including requirements elicitation, understanding, modeling, traceability, and reuse, across multiple application domains. This paper describes our preliminary findings in this domain, current state of research, and prospects of our future work.",
            "Award": ""
        },
        {
            "Title": "Towards Engineering Transparency as a Requirement in Socio-technical Systems",
            "Type": "Paper",
            "Key": "re15next-nextp022-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMahmood+Hosseini%2C+Alimohammad+Shahri%2C+Keith+Phalp%2C+and+Raian+Ali+%22Towards+Engineering+Transparency+as+a+Requirement+in+Socio-technical+Systems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mahmood Hosseini, Alimohammad Shahri, Keith Phalp, and Raian Ali",
            "AffiliationsString": "Bournemouth University, UK",
            "Authors": [
                "Mahmood Hosseini @ Bournemouth University, UK",
                "Alimohammad Shahri @ Bournemouth University, UK",
                "Keith Phalp @ Bournemouth University, UK",
                "Raian Ali @ Bournemouth University, UK"
            ],
            "Affiliations": [
                "Bournemouth University, UK",
                "Bournemouth University, UK",
                "Bournemouth University, UK",
                "Bournemouth University, UK"
            ],
            "Abstract": "The improvement and success of socio-technical systems depend on the joint optimisation of both the social and the technical parts. Improving the social part of a socio-technical system is a meticulous task, as social requirements are diverse and dynamic, and they usually evolve with time and context. Information transparency (henceforth, transparency) is one of the social requirements that can affect the overall attitude of the stakeholders present within a socio-technical system, and influence their other social requirements such as privacy, trust, collaboration and non-bias. In this paper, we advocate the need to engineer transparency as a first class requirement, propose a baseline model for transparency and show how this model can be a starting point for the analysis of transparency requirements of different stakeholders. We showcase our on-going research in the modelling and analysis of transparency as a requirement, discuss some of the challenges of transparency requirements elicitation, and present our future work.",
            "Award": ""
        },
        {
            "Title": "Towards a General Formal Framework of Coherence Management in RE",
            "Type": "Paper",
            "Key": "re15next-nextp039-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAlexander+Borgida%2C+Ivan+Jureta%2C+and+Anna+Zamansky+%22Towards+a+General+Formal+Framework+of+Coherence+Management+in+RE%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Alexander Borgida, Ivan Jureta, and Anna Zamansky",
            "AffiliationsString": "Rutgers University, USA; University of Namur, Belgium; University of Haifa, Israel",
            "Authors": [
                "Alexander Borgida @ Rutgers University, USA",
                "Ivan Jureta @ University of Namur, Belgium",
                "Anna Zamansky @ University of Haifa, Israel"
            ],
            "Affiliations": [
                "Rutgers University, USA",
                "University of Namur, Belgium",
                "University of Haifa, Israel"
            ],
            "Abstract": "Coherence Management refers to all efforts one needs to invest, in order to ensure that information shown in, and implied by a representation of requirements makes sense as a whole, is coherent. Coherence Management is an umbrella term we use to cover, and more importantly, stimulate research on relationships between identification, measurement, and action on phenomena which reflect tensions between information in requirements representations. Such tensions exist between information which is, for example, logically inconsistent, or stakeholders disagree on, or signals tradeoffs (meaning that improvement on some requirements, for instance, necessarily means some quantifiable (or not) deterioration of others). These tensions are an important topic of research in Requirements Engineering, and various methods have been proposed for the identification, measurement, and action on logical inconsistency in requirements models, on negotiating disagreements, and on settling tradeoffs. Despite focusing on related phenomena, these methods are different and each come with their own specific definition of when a representation of requirements is incoherent and what to do about it. This makes it hard to compare existing methods, design new ones, and choose those to apply when doing RE. In this short communication we outline our research agenda for developing a unified formal framework for the systematization and classification of Coherence Management efforts in the context of RE, as well as exploring their compatibility.",
            "Award": ""
        },
        {
            "Title": "SACRE: A Tool for Dealing with Uncertainty in Contextual Requirements at Runtime",
            "Type": "Poster",
            "Key": "re15demo-demoid15-p",
            "URL": "http%3A%2F%2Fwww.upc.edu%2Fgessi%2FSACRE%2FSACRE.pdf",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D6iBlvbpJ29w",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Edith Zavala, Xavier Franch, Jordi Marco, Alessia Knauss, and Daniela Damian",
            "AffiliationsString": "Universitat Politècnica de Catalunya, Spain; University of Victoria, Canada",
            "Authors": [
                "Edith Zavala @ Universitat Politècnica de Catalunya, Spain",
                "Xavier Franch @ Universitat Politècnica de Catalunya, Spain",
                "Jordi Marco @ Universitat Politècnica de Catalunya, Spain",
                "Alessia Knauss @ University of Victoria, Canada",
                "Daniela Damian @ University of Victoria, Canada"
            ],
            "Affiliations": [
                "Universitat Politècnica de Catalunya, Spain",
                "Universitat Politècnica de Catalunya, Spain",
                "Universitat Politècnica de Catalunya, Spain",
                "University of Victoria, Canada",
                "University of Victoria, Canada"
            ],
            "Abstract": "Self-adaptive systems are capable of dealing with uncertainty at runtime handling complex issues as resource variability, changing user needs, and system intrusions or faults. If the requirements depend on context, runtime uncertainty will affect the execution of these contextual requirements. This work presents SACRE, a proof-of-concept implementation of an existing approach, ACon, developed by researchers of the Univ. of Victoria (Canada) in collaboration with the UPC (Spain). ACon uses a feedback loop to detect contextual requirements affected by uncertainty and data mining techniques to determine the best operationalization of contexts on top of sensed data. The implementation is placed in the domain of smart vehicles and the contextual requirements provide functionality for drowsy drivers.",
            "Award": ""
        },
        {
            "Title": "ReqPat: Efficient Documentation of High-Quality Requirements using Controlled Natural Language",
            "Type": "Poster",
            "Key": "re15demo-demoid5-p",
            "URL": "https%3A%2F%2Fwww.hni.uni-paderborn.de%2Fpublikationen%2Fpublikationen%2F%3Ftx_hnippview_pi1%255Bpublikation%255D%3D9100%26tx_hnippview_pi1%255Bfelder%255D%255Blade%255D%3D2241",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2FTXBLjIClSXs",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Markus Fockel and Jörg Holtmann",
            "AffiliationsString": "Fraunhofer IPT, Germany",
            "Authors": [
                "Markus Fockel @ Fraunhofer IPT, Germany",
                "Jörg Holtmann @ Fraunhofer IPT, Germany"
            ],
            "Affiliations": [
                "Fraunhofer IPT, Germany",
                "Fraunhofer IPT, Germany"
            ],
            "Abstract": "The growing complexity of today&#039;s software intensive systems results in an increased size of requirements specifications, which are typically documented by means of natural language (NL). Large NL requirements specifications are prone to contain defects (e.g., contradictions), and the inherent ambiguity of NL impedes automatic techniques to support the requirements engineer. In order to cope with this problem, we conceived a requirements documentation approach implemented in the tool ReqPat. Using a controlled NL, it supports an efficient requirements documentation, an automatic requirements validation, and an automatic transition to models--while still keeping the requirements understandable for all stakeholders.",
            "Award": ""
        },
        {
            "Title": "Holistic Security Requirements Analysis: An Attacker&#039;s Perspective",
            "Type": "Poster",
            "Key": "re15demo-demoid17-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTong+Li%2C+Elda+Paja%2C+John+Mylopoulos%2C+Jennifer+Horkoff%2C+and+Kristian+Beckers+%22Holistic+Security+Requirements+Analysis%3A+An+Attacker%27s+Perspective%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Tong Li, Elda Paja, John Mylopoulos, Jennifer Horkoff, and Kristian Beckers",
            "AffiliationsString": "University of Trento, Italy; City University London, UK; TU München, Germany",
            "Authors": [
                "Tong Li @ University of Trento, Italy",
                "Elda Paja @ University of Trento, Italy",
                "John Mylopoulos @ University of Trento, Italy",
                "Jennifer Horkoff @ City University London, UK",
                "Kristian Beckers @ TU München, Germany"
            ],
            "Affiliations": [
                "University of Trento, Italy",
                "University of Trento, Italy",
                "University of Trento, Italy",
                "City University London, UK",
                "TU München, Germany"
            ],
            "Abstract": "The ever-growing complexity of systems makes their protection more challenging, as a single vulnerability or exposure of any component of the system can lead to serious security breaches. This problem is exacerbated by the fact that the system development community has not kept up with advances in attack knowledge. In this demo paper, we propose a holistic attack analysis approach to identify and tackle both atomic and multistage attacks, taking into account not only software attacks but also attacks that are targeted at people and hardware. To bridge the knowledge gap between attackers and defenders, we systematically analyze and refine the malicious desires of attackers (i.e., anti-goals), and leverage a comprehensive attack pattern repository (CAPEC) to operationalize attacker goals into concrete attack actions. Based on the results of our attack anal- ysis, appropriate security controls can be selected to effectively tackle potential attacks.",
            "Award": ""
        },
        {
            "Title": "Breeze: A Modeling Tool for Designing, Analyzing, and Improving Software Architecture",
            "Type": "Poster",
            "Key": "re15demo-demoid2-p",
            "URL": "http%3A%2F%2Fwww.cs.sjtu.edu.cn%2F%7Ezhonghao%2Fpaper%2Fbreeze15.pdf",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dumyx8r1dW6c",
            "URLinfo": "https%3A%2F%2Fgithub.com%2FBreezeCSA%2FBreeze",
            "DOI": "",
            "PersonsString": "Luxi Chen, Linpeng Huang, Hao Zhong, Chen Li, and Xiwen Wu",
            "AffiliationsString": "Shanghai Jiao Tong University, China",
            "Authors": [
                "Luxi Chen @ Shanghai Jiao Tong University, China",
                "Linpeng Huang @ Shanghai Jiao Tong University, China",
                "Hao Zhong @ Shanghai Jiao Tong University, China",
                "Chen Li @ Shanghai Jiao Tong University, China",
                "Xiwen Wu @ Shanghai Jiao Tong University, China"
            ],
            "Affiliations": [
                "Shanghai Jiao Tong University, China",
                "Shanghai Jiao Tong University, China",
                "Shanghai Jiao Tong University, China",
                "Shanghai Jiao Tong University, China",
                "Shanghai Jiao Tong University, China"
            ],
            "Abstract": "One of the key challenges in the software engineering lies in requirement engineering. As an important technique for modeling and analyzing requirements, software architecture has been intensively studied in recent years. Although various modeling tools have been proposed in both academy and industry, these tools typically provide limited support for analyzing nonfunctional requirements at architecture level. To address this problem, in this tool demo, we present a tool, called Breeze, that models, analyzes, and improves software architecture, with an emphasis on its non-functional requirements. In particular, Breeze has three key modules: (1) a modeling module that facilitates the modeling for software systems, (2) an analysis module that verifies non-functional requirements (e.g. safety, reliability and correctness) at the architecture level, and (3) a reconfiguration module that allows users to repair defects or to further improve architectures.",
            "Award": ""
        },
        {
            "Title": "StakeCloud Tool: From Cloud Consumers&#039; Search Queries to New Service Requirements",
            "Type": "Poster",
            "Key": "re15demo-demoid6-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DIrina+Todoran+Koitz+and+Martin+Glinz+%22StakeCloud+Tool%3A+From+Cloud+Consumers%27+Search+Queries+to+New+Service+Requirements%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Irina Todoran Koitz and Martin Glinz",
            "AffiliationsString": "University of Zurich, Switzerland",
            "Authors": [
                "Irina Todoran Koitz @ University of Zurich, Switzerland",
                "Martin Glinz @ University of Zurich, Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "Requirements elicitation is indispensable for delivering successful services. Nevertheless, cloud service providers mostly rely on ad-hoc approaches, as there are no dedicated elicitation methods for cloud services. To address this problem, we developed the StakeCloud approach, which helps cloud providers elicit requirements for future cloud services. StakeCloud builds and analyzes fuzzy Galois lattices based on consumers’ advanced search queries for cloud services. Our StakeCloud Tool automatically builds the lattice from the given search queries. It provides the requirements analyst with extensive clustering and analysis capabilities as well as means for comparing different newly generated classes of services. These allow identifying the threshold for achieving the largest populations of satisfied consumers with a minimum set of features implemented. Further, our tool enables eliciting real requirements from global consumers unobtrusively.",
            "Award": ""
        },
        {
            "Title": "An Enhanced Requirements Gathering Interface for Open Source Software Development Environments",
            "Type": "Poster",
            "Key": "re15demo-demoid20-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJaison+Kuriakose+and+Jeffrey+Parsons+%22An+Enhanced+Requirements+Gathering+Interface+for+Open+Source+Software+Development+Environments%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Jaison Kuriakose and Jeffrey Parsons",
            "AffiliationsString": "Memorial University, Canada",
            "Authors": [
                "Jaison Kuriakose @ Memorial University, Canada",
                "Jeffrey Parsons @ Memorial University, Canada"
            ],
            "Affiliations": [
                "Memorial University, Canada",
                "Memorial University, Canada"
            ],
            "Abstract": "In this paper, we propose an enhancement to requirements gathering interface used in open source software (OSS) development environments. Specifically we propose embedding currently used interface with reusable requirement patterns. We propose this enhancement based on the result we obtained from an experiment on the availability of requirement patterns during requirements generation in OSS development.",
            "Award": ""
        },
        {
            "Title": "Supporting Quantitative Assessment of Requirements in Goal Orientation",
            "Type": "Poster",
            "Key": "re15demo-demoid3-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRobert+Darimont+and+Christophe+Ponsard+%22Supporting+Quantitative+Assessment+of+Requirements+in+Goal+Orientation%22",
            "URLvideo": "http%3A%2F%2Fwww.objectiver.com%2FRE2015",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Robert Darimont and Christophe Ponsard",
            "AffiliationsString": "Respect-IT, Belgium; CETIC, Belgium",
            "Authors": [
                "Robert Darimont @ Respect-IT, Belgium",
                "Christophe Ponsard @ CETIC, Belgium"
            ],
            "Affiliations": [
                "Respect-IT, Belgium",
                "CETIC, Belgium"
            ],
            "Abstract": "Goal-Orientation provides a rich framework for reasoning about systems during the Requirements Engineering (RE) phase. While critical properties like safety or security can require formal semantics, performing quantitative reasoning on semi-formal models in a much more lightweight approach reveals to be sufficient in many projects. Most of the time, existing RE tools only target specific quantification scenarios or do not provide easy mechanisms for implementing them. In order to demonstrate the ability to provide mechanisms that are both generic and powerful, we developed an extension of the Objectiver tool in three directions: (1) internal reasoning capabilities on AND-OR goal/obstacles structures, (2) close integration with an external spreadsheet application and (3) model export for building assessment tools using model-driven engineering techniques. We also demonstrate how our approach can cope with a variety of industrial scenarios requiring some form of quantification such as risk analysis, selection of design alternatives, effort estimation, and assessment of customer satisfaction.",
            "Award": ""
        },
        {
            "Title": "Web Tool for Goal Modelling and Statechart Derivation",
            "Type": "Poster",
            "Key": "re15demo-demoid21-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJo%C3%A3o+Pimentel%2C+J%C3%A9ssyka+Vilela%2C+and+Jaelson+Castro+%22Web+Tool+for+Goal+Modelling+and+Statechart+Derivation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "João Pimentel, Jéssyka Vilela, and Jaelson Castro",
            "AffiliationsString": "Federal University of Pernambuco, Brazil",
            "Authors": [
                "João Pimentel @ Federal University of Pernambuco, Brazil",
                "Jéssyka Vilela @ Federal University of Pernambuco, Brazil",
                "Jaelson Castro @ Federal University of Pernambuco, Brazil"
            ],
            "Affiliations": [
                "Federal University of Pernambuco, Brazil",
                "Federal University of Pernambuco, Brazil",
                "Federal University of Pernambuco, Brazil"
            ],
            "Abstract": "Creating and maintaining visual models is a time-consuming step in software engineering processes. In order to support the crea-tion of some of these models, we have developed the Goal to Ar-chitecture tool (GATO). This web tool handles the creation and edition of goal models, as well as the derivation of statecharts. The particular variation of goal modelling supported by this tool contains four views: requirements view, design view, delegation view, and behavioural view.",
            "Award": ""
        },
        {
            "Title": "The PGR-BSC Cube Business Modeler: From Requirements Elicitation to a Business Model Canvas",
            "Type": "Poster",
            "Key": "re15demo-demoid22-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DCarlos+E.+Salgado%2C+Ricardo+J.+Machado%2C+and+Rita+S.+P.+Maciel+%22The+PGR-BSC+Cube+Business+Modeler%3A+From+Requirements+Elicitation+to+a+Business+Model+Canvas%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Carlos E. Salgado, Ricardo J. Machado, and Rita S. P. Maciel",
            "AffiliationsString": "University of Minho, Portugal; Federal University of Bahia, Brazil",
            "Authors": [
                "Carlos E. Salgado @ University of Minho, Portugal",
                "Ricardo J. Machado @ University of Minho, Portugal",
                "Rita S. P. Maciel @ Federal University of Bahia, Brazil"
            ],
            "Affiliations": [
                "University of Minho, Portugal",
                "University of Minho, Portugal",
                "Federal University of Bahia, Brazil"
            ],
            "Abstract": "Business models play a pivotal role in organizations, building bridges and enabling dialogue between business and technological worlds. Accordingly goals and rules associate with processes to compose their base structure, driving and supporting an organization’s strategy. In addition, as balanced scorecards are the reference in strategy management, a combination of these three dimensions (processes, goals and rules, and scorecards) can lead to a stronger, more strategy-oriented, business model. Our PGR-BSC Cube three-dimensional business model covers the elicitation of business goals and rules from process-level use cas-es, and their connection to balanced scorecard, aggregating func-tional, nonfunctional and strategy dimensions. By taking ad-vantage of its cube structure and an associated tailorable method, adaptable to model variations, we propose a business modeler tool to perform the complete requirements elicitation and the concluding generation of a business model canvas. This tool al-lows for the use of different viewpoints to perform diverse busi-ness model transformations.",
            "Award": ""
        },
        {
            "Title": "Challenges of Requirements Engineering in AUTOSAR Ecosystems",
            "Type": "Poster",
            "Key": "re15demo-demoid18-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMozhan+Soltani+and+Eric+Knauss+%22Challenges+of+Requirements+Engineering+in+AUTOSAR+Ecosystems%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Mozhan Soltani and Eric Knauss",
            "AffiliationsString": "University of Gothenburg, Sweden; Chalmers University of Technology, Sweden",
            "Authors": [
                "Mozhan Soltani @ University of Gothenburg, Sweden",
                "Eric Knauss @ Chalmers University of Technology, Sweden"
            ],
            "Affiliations": [
                "University of Gothenburg, Sweden",
                "Chalmers University of Technology, Sweden"
            ],
            "Abstract": "Abstract—AUTOSAR has changed significantly how software is developed in the automotive sector. As a central standard, AUTOSAR enables reuse of software components as well as their interoperability. For AUTOSAR compliant ECU development, car manufacturers source Electronic Control Units (ECUs) from Tier-1 suppliers, but ask those Tier-1 suppliers to install AUTOSAR compliant basic software from a certified AUTOSAR-Tier-2 supplier. In this setup (to which we refer as the AUTOSAR ecosystem), the OEM has a direct business relationship with the Tier-1, but only an indirect relationship to the AUTOSAR-Tier-2 supplier, which leads to complex flows of requirements and related information between the organizations involved. In this extended abstract, we summarize preliminary results of a qualitative investigation of Requirements Engineering challenges in the AUTOSAR ecosystem. In particular, we interviewed 7 project managers from an AUTOSAR-Tier-2 supplier, and triangulated our results with 6 additional interviews with subjects from two Tier-1 suppliers and one OEM. We found that most of the requirements towards the AUTOSAR-Tier-2 supplier can be directly mapped to standard AUTOSAR components. However, a significant amount of requirements were new requirements and specific to the OEM or even a project. The well-known requirements engineering challenges we found to surface in the AUTOSAR ecosystem were mainly connected to these non-standard requirements. Standard and non-standard requirements are usually mixed, which makes it hard to fully leverage the potential benefits of reuse within the AUTOSAR standard. We argue that the holistic ecosystem perspective allows exploration of new strategies for mitigating this challenge.",
            "Award": ""
        },
        {
            "Title": "Incorporating Preferences from Multiple Stakeholders in Software Requirements Selection: An Interactive Search-Based Approach",
            "Type": "FULL DS PAPER",
            "Key": "re15doc-docid2-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAntonio+Pitangueira+%22Incorporating+Preferences+from+Multiple+Stakeholders+in+Software+Requirements+Selection%3A+An+Interactive+Search-Based+Approach%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Antonio Pitangueira",
            "AffiliationsString": "IFBA, Brazil",
            "Authors": [
                "Antonio Pitangueira @ IFBA, Brazil"
            ],
            "Affiliations": [
                "IFBA, Brazil"
            ],
            "Abstract": "The software requirements selection process has an important role in software development because it aims in identifying an (close to) optimal subset of candidate requirements by exploiting trade-offs among these requirements to satisfy the demands of users. Usually, more than one stakeholder participates in the requirements selection process analyzing important aspects in this context, such as budget, costs, available resources, and technical aspects to find a set of requirements that meets the users’ needs. In a scenario in which different stakeholders are involved, the inclusion of their preferences, decision criteria and judgment are important factors to guarantee the selection of the best requirements according to project constraints. An interactive approach to incorporate preferences from multiple stakeholders is proposed aiming to assist users in obtaining solutions as close to their needs.",
            "Award": ""
        },
        {
            "Title": "How Can Corpus Linguistics Help Improve Requirements Writing? Specifications of a Space Project as a Case Study",
            "Type": "FULL DS PAPER",
            "Key": "re15doc-docid3-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMaxime+Warnier+%22How+Can+Corpus+Linguistics+Help+Improve+Requirements+Writing%3F+Specifications+of+a+Space+Project+as+a+Case+Study%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Maxime Warnier",
            "AffiliationsString": "CLLE-ERSS, France; CNES, France",
            "Authors": [
                "Maxime Warnier @ CLLE-ERSS, France / CNES, France"
            ],
            "Affiliations": [
                "CLLE-ERSS, France / CNES, France"
            ],
            "Abstract": "The specific purpose of this doctoral research is to improve the writing of requirements at the French Space Agency (CNES) by proposing a set of linguistic rules – referred to as a Controlled Natural Language (CNL) – that engineers should follow when writing out specifications in French. CNLs for technical writing do already exist, but if they are reviewed from a linguistic point of view, they are found unsatisfactory and too constraining, because some of the rules they impose lack relevance or are not compatible with the way engineers actually specify large-scale systems. In this research abstract, we will present a methodology based on corpus analysis aimed at improving existing rules and suggesting new ones that are inspired by existing data. We will also consider requirements extracted from specifications written at CNES to demonstrate its feasibility.",
            "Award": ""
        },
        {
            "Title": "The Personal Information Security Assistant",
            "Type": "FULL DS PAPER",
            "Key": "re15doc-docid4-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRoeland+H.+P.+Kegel+%22The+Personal+Information+Security+Assistant%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Roeland H. P. Kegel",
            "AffiliationsString": "University of Twente, Netherlands",
            "Authors": [
                "Roeland H. P. Kegel @ University of Twente, Netherlands"
            ],
            "Affiliations": [
                "University of Twente, Netherlands"
            ],
            "Abstract": "The human element is often found to be the weakest link in the information security chain. The Personal Information Security Assistant project aims to address this by improving the privacy and security awareness of end-users and by aligning the user&#039;s personal IT environment to the user&#039;s security requirements. It does this by elicitation of a user&#039;s privacy and security requirements (risk appetite) as well as a user&#039;s risk perception. The PISA then takes action by aligning the user&#039;s requirements and perceptions, thereby improving user awareness regarding privacy and security. This article outlines the research questions, methodology and current results associated with the PISA project.",
            "Award": ""
        },
        {
            "Title": "Security Assurance Requirements Engineering (STARE) for Trustworthy Service Level Agreements",
            "Type": "POSTER AND SHORT PAPER",
            "Key": "re15doc-docid6-p",
            "URL": "http%3A%2F%2Fwww.cs.ox.ac.uk%2Ffiles%2F7404%2FSTARE%2520for%2520Trustworthy%2520Service%2520Level%2520Agreements_Nugraha_IEEE%2520DS-RE%252715.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Yudhistira Nugraha",
            "AffiliationsString": "University of Oxford, UK",
            "Authors": [
                "Yudhistira Nugraha @ University of Oxford, UK"
            ],
            "Affiliations": [
                "University of Oxford, UK"
            ],
            "Abstract": "With the development of trustworthy services, security requirements are of paramount importance for any service (X-as-a-Service). This work-in-progress paper motivates the need for a new approach to requirements engineering for trustworthy services, which helps organisations to systematically define a set of security requirements and describe these in a service level agreement (SLA). This proposed research aims to provide adequate assurances to users by introducing the concept of the Trustworthy Service Level Agreement (TSLA). The proposed research design involves three stages: The first is to develop an initial method of Security Assurance Requirements Engineering (STARE) by refining the nine Security Quality Requirements Engineering (SQUARE) activities. The key activities of STARE include: eliciting security requirements, classification of security requirements, and developing the novel concept of the TSLA. In the second stage, the effectiveness of STARE is evaluated using two real-world case studies: state cyber defence and lawful interception as a service. Finally, the process of implementing the STARE activities will be evaluated using selected service providers that deliver such services to defence and law enforcement agencies. Given the current state of requirements engineering for services, it is anticipated that this research will have a significant impact in terms of guaranteeing secure and trustworthy services in various domains",
            "Award": ""
        },
        {
            "Title": "A Magnet-and-Spring Based Visualization Technique for Enhancing the Manipulation of Requirements Artifacts",
            "Type": "FULL DS PAPER",
            "Key": "re15doc-docid7-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DParisa+Ghazi+%22A+Magnet-and-Spring+Based+Visualization+Technique+for+Enhancing+the+Manipulation+of+Requirements+Artifacts%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Parisa Ghazi",
            "AffiliationsString": "University of Zurich, Switzerland",
            "Authors": [
                "Parisa Ghazi @ University of Zurich, Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland"
            ],
            "Abstract": "Requirements engineers model the system of interest from different points of view by creating numerous artifacts. Although they have to deal with a great amount of information, the display space of the devices is limited. This limitation leads to a time consuming navigation through the artifacts. Requirements engineers have to scroll through numerous pages and switch between multiple windows. However, they have to rely on their memory when there is no space left on the screen to view another piece of relevant information. In this research, we propose to develop a novel visualization technique that flexibly creates editable views of a linked set of elements or artifacts where the pieces show different levels of detail according to the user’s demand for the current task. Thus, important parts are shown in detail, while the space taken for displaying unimportant parts is minimized. Our conceptual solution is a combination of the focus+context concept and a magnet-and-spring system. The focus+context concept is responsible for resizing and relocating objects to make space for more relevant information. The magnet-and-spring system is responsible for distributing the distortion caused by the focus+context concept throughout the workspace, such that the distorted view of the information looks more natural. Considering the artifacts of a software development project as a single hypothetical artifact enables us to manage the artifacts in the same way we deal with the objects inside an artifact. Our envisaged tool support should be embeddable in requirements applications and bring its benefits to the applications manipulating requirements artifacts.",
            "Award": ""
        },
        {
            "Title": "A Language for Writing System Specifications in an Aeronautical Context",
            "Type": "FULL DS PAPER",
            "Key": "re15doc-docid8-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DBenoit+Lebeaupin+%22A+Language+for+Writing+System+Specifications+in+an+Aeronautical+Context%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "",
            "PersonsString": "Benoit Lebeaupin",
            "AffiliationsString": "École Centrale Paris, France",
            "Authors": [
                "Benoit Lebeaupin @ École Centrale Paris, France"
            ],
            "Affiliations": [
                "École Centrale Paris, France"
            ],
            "Abstract": "The ambiguity of natural language is an issue which predates requirement engineering. This issue is, in the general case, obviously unsolvable, nor actually needing a solution. However, we think that in particular contexts, it is feasible and desirable to reduce the ambiguity of free text specifications. We look at how specifications are actually handled in a company to be able to propose an useful but not too disruptive method for writing better specifications. We are currently developing and investigating how to validate this method.",
            "Award": ""
        }
    ],
    "Sessions": [
        {
            "Id": "Aedo4vee1U",
            "Title": "How to Combine Requirements and Interaction Design",
            "ShortTitle": "How to Combine Requirements and Interaction Design",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-24 09:00 How to Combine Requirements and Interaction Design",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "eich6hoo2I",
            "Title": "Writing Good Requirements",
            "ShortTitle": "Writing Good Requirements",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-24 09:00 Writing Good Requirements",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "EiGhei0ahs",
            "Title": "Boosting requirements analysis and validation skills through feedback-enabled semantic prototyping",
            "ShortTitle": "Boosting requirements analysis and validation skills through feedback-enabled semantic prototyping",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-24 09:00 Boosting requirements analysis and validation skills through feedback-enabled semantic prototyping",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "iaMohsh8au",
            "Title": "Secure Systems Requirements and Construction with Security Patterns",
            "ShortTitle": "Secure Systems Requirements and Construction with Security Patterns",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-24 09:00 Secure Systems Requirements and Construction with Security Patterns",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "oJ1die0eeb",
            "Title": "Introduction to Grounded Theory, Measurement and Applications",
            "ShortTitle": "Introduction to Grounded Theory, Measurement and Applications",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-24 09:00 Introduction to Grounded Theory, Measurement and Applications",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "xie7Phoo2t",
            "Title": "Eliciting Unstated Requirements (or Be Careful What You Ask Users)",
            "ShortTitle": "Eliciting Unstated Requirements (or Be Careful What You Ask Users)",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-24 09:00 Eliciting Unstated Requirements (or Be Careful What You Ask Users)",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "aequeibo6W",
            "Title": "5th International Model-Driven Requirements Engineering Workshop",
            "ShortTitle": "5th International Model-Driven Requirements Engineering Workshop",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-24 09:00 5th International Model-Driven Requirements Engineering Workshop",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "bosaa8xieJ",
            "Title": "8th International i* Workshop",
            "ShortTitle": "8th International i* Workshop",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-24 09:00 8th International i* Workshop",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "chaV3iepho",
            "Title": "2nd International Workshop on Artificial Intelligence for Requirements Engineering",
            "ShortTitle": "2nd International Workshop on Artificial Intelligence for Requirements Engineering",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-24 09:00 2nd International Workshop on Artificial Intelligence for Requirements Engineering",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "iHae1WahCu",
            "Title": "5th Workshop on Empirical Requirements Engineering",
            "ShortTitle": "5th Workshop on Empirical Requirements Engineering",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-24 09:00 5th Workshop on Empirical Requirements Engineering",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "ViehiTh9ah",
            "Title": "4th International Workshop on Requirements Engineering for Sustainable Systems",
            "ShortTitle": "4th International Workshop on Requirements Engineering for Sustainable Systems",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-24 09:00 4th International Workshop on Requirements Engineering for Sustainable Systems",
            "Day": "2015-08-24",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "EeThaa0auY",
            "Title": "Leverage BABOK® Guide v3 to Deliver Better Business Outcomes",
            "ShortTitle": "Leverage BABOK® Guide v3 to Deliver Better Business Outcomes",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-25 09:00 Leverage BABOK® Guide v3 to Deliver Better Business Outcomes",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Eigho2Nacu",
            "Title": "21 More Powerful Ways to Catch Inadequate Requirements Early",
            "ShortTitle": "21 More Powerful Ways to Catch Inadequate Requirements Early",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-25 09:00 21 More Powerful Ways to Catch Inadequate Requirements Early",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "GahL9Puup3",
            "Title": "Business Process Compliance Analysis: A Graphical Representation with Tool Support",
            "ShortTitle": "Business Process Compliance Analysis: A Graphical Representation with Tool Support",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-25 09:00 Business Process Compliance Analysis: A Graphical Representation with Tool Support",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "OoSieZie2o",
            "Title": "Business and Software Ecosystems: How to model, analyze, and survive!",
            "ShortTitle": "Business and Software Ecosystems: How to model, analyze, and survive!",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-25 09:00 Business and Software Ecosystems: How to model, analyze, and survive!",
            "Day": "2015-08-25",
            "Time": "09:00 - 12:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Ooted6KohM",
            "Title": "Writing better requirements with EARS+",
            "ShortTitle": "Writing better requirements with EARS+",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-25 09:00 Writing better requirements with EARS+",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "ahgh5Tohli",
            "Title": "1st Workshop on Just-In-Time RE",
            "ShortTitle": "1st Workshop on Just-In-Time RE",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-25 09:00 1st Workshop on Just-In-Time RE",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Aivoarae8t",
            "Title": "The First International Workshop on Crowd-Based Requirements Engineering",
            "ShortTitle": "The First International Workshop on Crowd-Based Requirements Engineering",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-25 09:00 The First International Workshop on Crowd-Based Requirements Engineering",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "aixei5Thae",
            "Title": "2nd Workshop on Evolving Security and Privacy Requirements Engineering",
            "ShortTitle": "2nd Workshop on Evolving Security and Privacy Requirements Engineering",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-25 09:00 2nd Workshop on Evolving Security and Privacy Requirements Engineering",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "eghahGh4qu",
            "Title": "8th International Workshop on Requirements Engineering and Law",
            "ShortTitle": "8th International Workshop on Requirements Engineering and Law",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-25 09:00 8th International Workshop on Requirements Engineering and Law",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "ohHi0lohsh",
            "Title": "8th International i* Workshop",
            "ShortTitle": "8th International i* Workshop",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-25 09:00 8th International i* Workshop",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Oog4tew0ie",
            "Title": "5th International Workshop on Requirements Patterns",
            "ShortTitle": "5th International Workshop on Requirements Patterns",
            "Type": "Workshop",
            "ShortType": "Workshop",
            "Key": "2015-08-25 09:00 5th International Workshop on Requirements Patterns",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "7",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "shohPiiqu1",
            "Title": "Doctoral Symposium",
            "ShortTitle": "Doctoral Symposium",
            "Type": "Doctoral Symposium",
            "ShortType": "Doctoral Symposium",
            "Key": "2015-08-25 09:00 Doctoral Symposium",
            "Day": "2015-08-25",
            "Time": "09:00 - 17:30",
            "Location": "",
            "LocationIndex": "4",
            "ChairsString": "Jane Cleland-Huang and Peter Sawyer",
            "Chairs": [
                "Jane Cleland-Huang @",
                "Peter Sawyer @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15DOC",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15doc-docid2-p",
                "re15doc-docid3-p",
                "re15doc-docid4-p",
                "re15doc-docid6-p",
                "re15doc-docid7-p",
                "re15doc-docid8-p"
            ]
        },
        {
            "Id": "er9Iegad4u",
            "Title": "Distributed Systems Development using Info Cases",
            "ShortTitle": "Distributed Systems Development using Info Cases",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-25 14:00 Distributed Systems Development using Info Cases",
            "Day": "2015-08-25",
            "Time": "14:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "uYeeb5voh3",
            "Title": "Aligning Product Line Strategy, Requirements and Features",
            "ShortTitle": "Aligning Product Line Strategy, Requirements and Features",
            "Type": "Tutorial",
            "ShortType": "Tutorial",
            "Key": "2015-08-25 14:00 Aligning Product Line Strategy, Requirements and Features",
            "Day": "2015-08-25",
            "Time": "14:00 - 17:30",
            "Location": "",
            "LocationIndex": "6",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "yi3thoo2Ph",
            "Title": "Welcome Reception on the Ottawa River",
            "ShortTitle": "Welcome Reception on the Ottawa River",
            "Type": "Social Event",
            "ShortType": "Social Event",
            "Key": "2015-08-25 18:30 Welcome Reception on the Ottawa River",
            "Day": "2015-08-25",
            "Time": "18:30 - 21:30",
            "Location": "",
            "LocationIndex": "5",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "vaim0Ahvai",
            "Title": "Message from the Chairs",
            "ShortTitle": "Message from the Chairs",
            "Type": "Plenary",
            "ShortType": "Plenary",
            "Key": "2015-08-26 08:30 Message from the Chairs",
            "Day": "2015-08-26",
            "Time": "08:30 - 09:00",
            "Location": "MRN Auditorium",
            "LocationIndex": "0",
            "ChairsString": "Daniel Amyot, Didar Zowghi, and Vincenzo Gervasi",
            "Chairs": [
                "Daniel Amyot @",
                "Didar Zowghi @",
                "Vincenzo Gervasi @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15FOREWORD",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15foreword-fm001-p"
            ]
        },
        {
            "Id": "ub1chah7Ae",
            "Title": "You versus Users - Who owns your roadmap?",
            "ShortTitle": "You versus Users - Who owns your roadmap?",
            "Type": "Keynote",
            "ShortType": "Keynote",
            "Key": "2015-08-26 09:00 You versus Users - Who owns your roadmap?",
            "Day": "2015-08-26",
            "Time": "09:00 - 10:30",
            "Location": "MRN Auditorium",
            "LocationIndex": "0",
            "ChairsString": "Claude Laguë",
            "Chairs": [
                "Claude Laguë @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "Aydin Y. Mirzaee @ FluidReview / SurveyMonkey : You versus Users - Who owns your roadmap?"
            ]
        },
        {
            "Id": "aih4Guique",
            "Title": "Risks",
            "ShortTitle": "Risks",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-26 11:00 Risks",
            "Day": "2015-08-26",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp063-p",
                "re15main-mainp045-p",
                "re15main-mainp090-p"
            ]
        },
        {
            "Id": "vaePhushe4",
            "Title": "Tracing",
            "ShortTitle": "Tracing",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-26 11:00 Tracing",
            "Day": "2015-08-26",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp121-p",
                "re15ind-indp016-p",
                "re15main-mainp023-p"
            ]
        },
        {
            "Id": "cooM1ke3lo",
            "Title": "Most Influential Paper 10 Years Later (from RE’05)",
            "ShortTitle": "Most Influential Paper 10 Years Later (from RE’05)",
            "Type": "Meeting",
            "ShortType": "Meeting",
            "Key": "2015-08-26 14:00 Most Influential Paper 10 Years Later (from RE’05)",
            "Day": "2015-08-26",
            "Time": "14:00 - 15:30",
            "Location": "",
            "LocationIndex": "4",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "coh8ash6eZ",
            "Title": "Testing",
            "ShortTitle": "Testing",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-26 14:00 Testing",
            "Day": "2015-08-26",
            "Time": "14:00 - 15:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp043-p",
                "re15ind-indp010-p",
                "re15ind-indp019-p"
            ]
        },
        {
            "Id": "Thah9ciaX7",
            "Title": "Creativity",
            "ShortTitle": "Creativity",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-26 16:00 Creativity",
            "Day": "2015-08-26",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp033-p",
                "re15main-mainp125-p"
            ]
        },
        {
            "Id": "Zeix6ahk4a",
            "Title": "Elicitation",
            "ShortTitle": "Elicitation",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-26 16:00 Elicitation",
            "Day": "2015-08-26",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp008-p",
                "re15ind-indp003-p",
                "re15ind-indp004-p"
            ]
        },
        {
            "Id": "lai6Ij7ieK",
            "Title": "Demos and Posters",
            "ShortTitle": "Demos and Posters",
            "Type": "Demos and Posters",
            "ShortType": "Demos and Posters",
            "Key": "2015-08-26 16:00 Demos and Posters",
            "Day": "2015-08-26",
            "Time": "16:00 - 18:00",
            "Location": "",
            "LocationIndex": "2",
            "ChairsString": "Maya Daneva and Sepideh Ghanavati",
            "Chairs": [
                "Maya Daneva @",
                "Sepideh Ghanavati @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15DEMO",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15demo-demoid15-p",
                "re15demo-demoid5-p",
                "re15demo-demoid17-p",
                "re15demo-demoid2-p",
                "re15demo-demoid6-p",
                "re15demo-demoid20-p",
                "re15demo-demoid3-p",
                "re15demo-demoid21-p",
                "re15demo-demoid22-p",
                "re15demo-demoid18-p"
            ]
        },
        {
            "Id": "Oko6quech8",
            "Title": "RE Steering Committee Meeting",
            "ShortTitle": "RE Steering Committee Meeting",
            "Type": "Meeting",
            "ShortType": "Meeting",
            "Key": "2015-08-26 18:00 RE Steering Committee Meeting",
            "Day": "2015-08-26",
            "Time": "18:00 - 19:00",
            "Location": "",
            "LocationIndex": "4",
            "ChairsString": "Jane Cleland-Huang",
            "Chairs": [
                "Jane Cleland-Huang @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Aequ9Chu2u",
            "Title": "Ottawa Walking Tours",
            "ShortTitle": "Ottawa Walking Tours",
            "Type": "Social Event",
            "ShortType": "Social Event",
            "Key": "2015-08-26 19:00 Ottawa Walking Tours",
            "Day": "2015-08-26",
            "Time": "19:00 - 20:30",
            "Location": "",
            "LocationIndex": "5",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Ahchei1ida",
            "Title": "Organization/Program Committees Dinner",
            "ShortTitle": "Organization/Program Committees Dinner",
            "Type": "Social Event",
            "ShortType": "Social Event",
            "Key": "2015-08-26 19:00 Organization/Program Committees Dinner",
            "Day": "2015-08-26",
            "Time": "19:00 - 22:00",
            "Location": "",
            "LocationIndex": "5",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "oNg1oocohp",
            "Title": "Can you intentionally design a product that is cool?",
            "ShortTitle": "Can you intentionally design a product that is cool?",
            "Type": "Keynote",
            "ShortType": "Keynote",
            "Key": "2015-08-27 09:00 Can you intentionally design a product that is cool?",
            "Day": "2015-08-27",
            "Time": "09:00 - 10:30",
            "Location": "MRN Auditorium",
            "LocationIndex": "0",
            "ChairsString": "Dan Berry",
            "Chairs": [
                "Dan Berry @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "Karen Holtzblatt @ InContext Enterprises : Can you intentionally design a product that is cool?"
            ]
        },
        {
            "Id": "taiB9Huice",
            "Title": "Industry Presentations",
            "ShortTitle": "Industry Presentations",
            "Type": "Industry Experience",
            "ShortType": "Industry Experience",
            "Key": "2015-08-27 11:00 Industry Presentations",
            "Day": "2015-08-27",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "2",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Roh1Boh9ya",
            "Title": "Agile",
            "ShortTitle": "Agile",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-27 11:00 Agile",
            "Day": "2015-08-27",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp053-p",
                "re15ind-indp011-p",
                "re15ind-indp026-p"
            ]
        },
        {
            "Id": "hae5ohweT3",
            "Title": "Tracing",
            "ShortTitle": "Tracing",
            "Type": "RE:Next! Track",
            "ShortType": "RE:Next! Track",
            "Key": "2015-08-27 11:00 Tracing",
            "Day": "2015-08-27",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15NEXT",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15next-nextp036-p",
                "re15next-nextp042-p"
            ]
        },
        {
            "Id": "Theip9Shu1",
            "Title": "Quidditch Match: Ottawa Against The World!",
            "ShortTitle": "Quidditch Match: Ottawa Against The World!",
            "Type": "Social Event",
            "ShortType": "Social Event",
            "Key": "2015-08-27 12:30 Quidditch Match: Ottawa Against The World!",
            "Day": "2015-08-27",
            "Time": "12:30 - 14:00",
            "Location": "",
            "LocationIndex": "5",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Ohcheigh0b",
            "Title": "From The Trenches",
            "ShortTitle": "From The Trenches",
            "Type": "Industry Experience",
            "ShortType": "Industry Experience",
            "Key": "2015-08-27 14:00 From The Trenches",
            "Day": "2015-08-27",
            "Time": "14:00 - 15:30",
            "Location": "",
            "LocationIndex": "2",
            "ChairsString": "Sarah C. Gregory",
            "Chairs": [
                "Sarah C. Gregory @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "teel5Ur7xa",
            "Title": "Cognitive",
            "ShortTitle": "Cognitive",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-27 14:00 Cognitive",
            "Day": "2015-08-27",
            "Time": "14:00 - 15:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp012-p",
                "re15main-mainp026-p",
                "re15main-mainp093-p"
            ]
        },
        {
            "Id": "vohBah8ief",
            "Title": "Goals and NFRs",
            "ShortTitle": "Goals and NFRs",
            "Type": "RE:Next! Track",
            "ShortType": "RE:Next! Track",
            "Key": "2015-08-27 14:00 Goals and NFRs",
            "Day": "2015-08-27",
            "Time": "14:00 - 15:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15NEXT",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15next-nextp003-p",
                "re15next-nextp012-p",
                "re15next-nextp061-p"
            ]
        },
        {
            "Id": "Nah8aecah8",
            "Title": "Technology Transfer – Requirements Engineering Research to Industrial Practice – An Open (Ended) Debate",
            "ShortTitle": "Technology Transfer – Requirements Engineering Research to Industrial Practice – An Open (Ended) Debate",
            "Type": "Panel",
            "ShortType": "Panel",
            "Key": "2015-08-27 16:00 Technology Transfer – Requirements Engineering Research to Industrial Practice – An Open (Ended) Debate",
            "Day": "2015-08-27",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Carlos Henrique C. Duarte and Tony Gorschek",
            "Chairs": [
                "Carlos Henrique C. Duarte @",
                "Tony Gorschek @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "utu4tooChi",
            "Title": "Mass RE",
            "ShortTitle": "Mass RE",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-27 16:00 Mass RE",
            "Day": "2015-08-27",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp036-p",
                "re15main-mainp048-p",
                "re15main-mainp095-p"
            ]
        },
        {
            "Id": "uliweed4Oo",
            "Title": "Cognitive",
            "ShortTitle": "Cognitive",
            "Type": "RE:Next! Track",
            "ShortType": "RE:Next! Track",
            "Key": "2015-08-27 16:00 Cognitive",
            "Day": "2015-08-27",
            "Time": "16:00 - 17:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15NEXT",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15next-nextp018-p",
                "re15next-nextp045-p",
                "re15next-nextp066-p"
            ]
        },
        {
            "Id": "aith8ieZoG",
            "Title": "RE&#039;16 Organization Meeting",
            "ShortTitle": "RE&#039;16 Organization Meeting",
            "Type": "Meeting",
            "ShortType": "Meeting",
            "Key": "2015-08-27 17:30 RE&#039;16 Organization Meeting",
            "Day": "2015-08-27",
            "Time": "17:30 - 18:15",
            "Location": "",
            "LocationIndex": "4",
            "ChairsString": "Zhi Jin",
            "Chairs": [
                "Zhi Jin @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "Ohthei7Cha",
            "Title": "Museum of Canadian History and Banquet",
            "ShortTitle": "Museum of Canadian History and Banquet",
            "Type": "Social Event",
            "ShortType": "Social Event",
            "Key": "2015-08-27 18:15 Museum of Canadian History and Banquet",
            "Day": "2015-08-27",
            "Time": "18:15 - 23:00",
            "Location": "",
            "LocationIndex": "5",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "aiw2Doh6Lo",
            "Title": "Requirements, Behaviours and Software Engineering",
            "ShortTitle": "Requirements, Behaviours and Software Engineering",
            "Type": "Keynote",
            "ShortType": "Keynote",
            "Key": "2015-08-28 09:00 Requirements, Behaviours and Software Engineering",
            "Day": "2015-08-28",
            "Time": "09:00 - 10:30",
            "Location": "MRN Auditorium",
            "LocationIndex": "0",
            "ChairsString": "Vincenzo Gervasi",
            "Chairs": [
                "Vincenzo Gervasi @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "Michael Jackson @ The Open University : Requirements, Behaviours and Software Engineering"
            ]
        },
        {
            "Id": "ahj4diX1vi",
            "Title": "Ready-Set-Transfer! Technology Transfer in the Requirements Engineering Domain",
            "ShortTitle": "Ready-Set-Transfer! Technology Transfer in the Requirements Engineering Domain",
            "Type": "Panel",
            "ShortType": "Panel",
            "Key": "2015-08-28 11:00 Ready-Set-Transfer! Technology Transfer in the Requirements Engineering Domain",
            "Day": "2015-08-28",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "Jane Cleland-Huang",
            "Chairs": [
                "Jane Cleland-Huang @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        },
        {
            "Id": "faiM0ahli0",
            "Title": "NL in RE",
            "ShortTitle": "NL in RE",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-28 11:00 NL in RE",
            "Day": "2015-08-28",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp003-p",
                "re15main-mainp027-p",
                "re15ind-indp014-p"
            ]
        },
        {
            "Id": "Iec3ohGhai",
            "Title": "Risks",
            "ShortTitle": "Risks",
            "Type": "RE:Next! Track",
            "ShortType": "RE:Next! Track",
            "Key": "2015-08-28 11:00 Risks",
            "Day": "2015-08-28",
            "Time": "11:00 - 12:30",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15NEXT",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15next-nextp002-p",
                "re15next-nextp029-p",
                "re15next-nextp030-p"
            ]
        },
        {
            "Id": "ahdoo3Aang",
            "Title": "Architecture",
            "ShortTitle": "Architecture",
            "Type": "Research/Industry",
            "ShortType": "Research/Industry",
            "Key": "2015-08-28 14:00 Architecture",
            "Day": "2015-08-28",
            "Time": "14:00 - 15:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15main-mainp042-p",
                "re15ind-indp002-p"
            ]
        },
        {
            "Id": "Eemeexie6v",
            "Title": "Frameworks",
            "ShortTitle": "Frameworks",
            "Type": "RE:Next! Track",
            "ShortType": "RE:Next! Track",
            "Key": "2015-08-28 14:00 Frameworks",
            "Day": "2015-08-28",
            "Time": "14:00 - 15:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15NEXT",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15next-nextp022-p",
                "re15next-nextp039-p"
            ]
        },
        {
            "Id": "olahNg3ogh",
            "Title": "Mass RE",
            "ShortTitle": "Mass RE",
            "Type": "RE:Next! Track",
            "ShortType": "RE:Next! Track",
            "Key": "2015-08-28 14:00 Mass RE",
            "Day": "2015-08-28",
            "Time": "14:00 - 15:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15NEXT",
            "URL": "",
            "Abstract": "",
            "Items": [
                "re15next-nextp027-p",
                "re15next-nextp052-p"
            ]
        },
        {
            "Id": "Ooy6aeceu3",
            "Title": "Closing session: Farewell and presentation of next year’s RE",
            "ShortTitle": "Closing session: Farewell and presentation of next year’s RE",
            "Type": "Plenary",
            "ShortType": "Plenary",
            "Key": "2015-08-28 15:30 Closing session: Farewell and presentation of next year’s RE",
            "Day": "2015-08-28",
            "Time": "15:30 - 16:15",
            "Location": "",
            "LocationIndex": "3",
            "ChairsString": "Daniel Amyot, Didar Zowghi, and Vincenzo Gervasi",
            "Chairs": [
                "Daniel Amyot @",
                "Didar Zowghi @",
                "Vincenzo Gervasi @"
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "RE15",
            "URL": "",
            "Abstract": ""
        }
    ],
    "People": [
        {
            "Name": "Daniel Aceituna",
            "Affiliation": "North Dakota State University, USA",
            "Key": "Daniel Aceituna @ North Dakota State University, USA",
            "Id": "ffa3e877ca",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bram Adams",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Bram Adams @ Polytechnique Montréal, Canada",
            "Id": "bd76796e61",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fatima Alabdulkareem",
            "Affiliation": "York University, Canada",
            "Key": "Fatima Alabdulkareem @ York University, Canada",
            "Id": "30e4bd8847",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Raian Ali",
            "Affiliation": "Bournemouth University, UK",
            "Key": "Raian Ali @ Bournemouth University, UK",
            "Id": "25a1472cbf",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Afnan Al-Subaihin",
            "Affiliation": "University College London, UK",
            "Key": "Afnan Al-Subaihin @ University College London, UK",
            "Id": "d35af6b6dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Vasco Amaral",
            "Affiliation": "Universidade Nova de Lisboa, Portugal",
            "Key": "Vasco Amaral @ Universidade Nova de Lisboa, Portugal",
            "Id": "31c109ac3d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Ameller",
            "Affiliation": "Universitat Politècnica de Catalunya, Spain",
            "Key": "David Ameller @ Universitat Politècnica de Catalunya, Spain",
            "Id": "30cb508453",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Amyot",
            "Affiliation": "",
            "Key": "Daniel Amyot @",
            "Id": "7897313d5e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Preethu Rose Anish",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Preethu Rose Anish @ Tata Consultancy Services, India",
            "Id": "cf60ab3ee9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Giuliano Antoniol",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Giuliano Antoniol @ Polytechnique Montréal, Canada",
            "Id": "9d7fd855e2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "João Araujo",
            "Affiliation": "Universidade Nova de Lisboa, Portugal",
            "Key": "João Araujo @ Universidade Nova de Lisboa, Portugal",
            "Id": "cea67fdd96",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chetan Arora",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Chetan Arora @ University of Luxembourg, Luxembourg",
            "Id": "dba9388430",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Benedikt Aumayr",
            "Affiliation": "JKU Linz, Austria",
            "Key": "Benedikt Aumayr @ JKU Linz, Austria",
            "Id": "56c6dd2319",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paolo Avesani",
            "Affiliation": "Fondazione Bruno Kessler, Italy",
            "Key": "Paolo Avesani @ Fondazione Bruno Kessler, Italy",
            "Id": "143d9738ad",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohammad R. Basirati",
            "Affiliation": "TU München, Germany",
            "Key": "Mohammad R. Basirati @ TU München, Germany",
            "Id": "456ece26eb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Samik Basu",
            "Affiliation": "Iowa State University, USA",
            "Key": "Samik Basu @ Iowa State University, USA",
            "Id": "8b4aed3e32",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kristian Beckers",
            "Affiliation": "TU München, Germany",
            "Key": "Kristian Beckers @ TU München, Germany",
            "Id": "2072efbc37",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nelly Bencomo",
            "Affiliation": "Aston University, UK",
            "Key": "Nelly Bencomo @ Aston University, UK",
            "Id": "b394ef43ab",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Johan Bengtsson",
            "Affiliation": "Swedish Defence Research Agency, Sweden",
            "Key": "Johan Bengtsson @ Swedish Defence Research Agency, Sweden",
            "Id": "03fc88a4a0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Richard Berntsson Svensson",
            "Affiliation": "Blekinge Institute of Technology, Sweden",
            "Key": "Richard Berntsson Svensson @ Blekinge Institute of Technology, Sweden",
            "Id": "9a71ba282f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dan Berry",
            "Affiliation": "",
            "Key": "Dan Berry @",
            "Id": "4c311749a7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Floris Bex",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Floris Bex @ Utrecht University, Netherlands",
            "Id": "45200b5896",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stefan Biffl",
            "Affiliation": "Vienna University of Technology, Austria",
            "Key": "Stefan Biffl @ Vienna University of Technology, Austria",
            "Id": "7126457500",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alexander Borgida",
            "Affiliation": "Rutgers University, USA",
            "Key": "Alexander Borgida @ Rutgers University, USA",
            "Id": "79403001b0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Travis D. Breaux",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Travis D. Breaux @ Carnegie Mellon University, USA",
            "Id": "4b661d414d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lionel C. Briand",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Lionel C. Briand @ University of Luxembourg, Luxembourg",
            "Id": "a7933979fa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sjaak Brinkkemper",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Sjaak Brinkkemper @ Utrecht University, Netherlands",
            "Id": "1447dbc013",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stephen B. Broomell",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Stephen B. Broomell @ Carnegie Mellon University, USA",
            "Id": "62ad04f5b3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hugo Brunelière",
            "Affiliation": "AtlanMod Team, France",
            "Key": "Hugo Brunelière @ AtlanMod Team, France",
            "Id": "9861aab150",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Loli Burgueño",
            "Affiliation": "University of Málaga, Spain",
            "Key": "Loli Burgueño @ University of Málaga, Spain",
            "Id": "054da0e405",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jordi Cabot",
            "Affiliation": "Open University of Catalonia, Spain",
            "Key": "Jordi Cabot @ Open University of Catalonia, Spain",
            "Id": "e0e73ab4ae",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Antoine Cailliau",
            "Affiliation": "Université Catholique de Louvain, Belgium",
            "Key": "Antoine Cailliau @ Université Catholique de Louvain, Belgium",
            "Id": "e8e8a4ebcf",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Callele",
            "Affiliation": "Experience First Design, Canada",
            "Key": "David Callele @ Experience First Design, Canada",
            "Id": "22ecd4ffa5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Doris Carver",
            "Affiliation": "Louisiana State University, USA",
            "Key": "Doris Carver @ Louisiana State University, USA",
            "Id": "b6bf157d7a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jaelson Castro",
            "Affiliation": "Federal University of Pernambuco, Brazil",
            "Key": "Jaelson Castro @ Federal University of Pernambuco, Brazil",
            "Id": "72da0060ff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nick Cercone",
            "Affiliation": "York University, Canada",
            "Key": "Nick Cercone @ York University, Canada",
            "Id": "4fbfadbb08",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Luxi Chen",
            "Affiliation": "Shanghai Jiao Tong University, China",
            "Key": "Luxi Chen @ Shanghai Jiao Tong University, China",
            "Id": "c0970ca8f2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Cleland-Huang",
            "Affiliation": "",
            "Key": "Jane Cleland-Huang @",
            "Id": "0bb19ef9ba",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Cleland-Huang",
            "Affiliation": "DePaul University, USA",
            "Key": "Jane Cleland-Huang @ DePaul University, USA",
            "Id": "64f5ba02ff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Vittorio Cortellessa",
            "Affiliation": "University of L'Aquila, Italy",
            "Key": "Vittorio Cortellessa @ University of L'Aquila, Italy",
            "Id": "bd12773b8e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fabiano Dalpiaz",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Fabiano Dalpiaz @ Utrecht University, Netherlands",
            "Id": "9b8566914f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniela Damian",
            "Affiliation": "University of Victoria, Canada",
            "Key": "Daniela Damian @ University of Victoria, Canada",
            "Id": "b741b3a670",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maya Daneva",
            "Affiliation": "",
            "Key": "Maya Daneva @",
            "Id": "23b79214fa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maya Daneva",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Maya Daneva @ University of Twente, Netherlands",
            "Id": "bce83aefb9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Robert Darimont",
            "Affiliation": "Respect-IT, Belgium",
            "Key": "Robert Darimont @ Respect-IT, Belgium",
            "Id": "91cba02eff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sangeeta Dey",
            "Affiliation": "Ajou University, South Korea",
            "Key": "Sangeeta Dey @ Ajou University, South Korea",
            "Id": "df02204784",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hyunsook Do",
            "Affiliation": "North Dakota State University, USA",
            "Key": "Hyunsook Do @ North Dakota State University, USA",
            "Id": "fb75a27663",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Carlos Henrique C. Duarte",
            "Affiliation": "",
            "Key": "Carlos Henrique C. Duarte @",
            "Id": "375ac7a9b7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Philip Dueck",
            "Affiliation": "Experience First Design, Canada",
            "Key": "Philip Dueck @ Experience First Design, Canada",
            "Id": "d122a3d683",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sebastian Eder",
            "Affiliation": "TU München, Germany",
            "Key": "Sebastian Eder @ TU München, Germany",
            "Id": "f426efd1c3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ulf Eliasson",
            "Affiliation": "Volvo, Sweden",
            "Key": "Ulf Eliasson @ Volvo, Sweden",
            "Id": "2374a5e3ee",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Henning Femmer",
            "Affiliation": "TU München, Germany",
            "Key": "Henning Femmer @ TU München, Germany",
            "Id": "3792f785f7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Méndez Fernández",
            "Affiliation": "TU München, Germany",
            "Key": "Daniel Méndez Fernández @ TU München, Germany",
            "Id": "a4fb7d90e3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alessio Ferrari",
            "Affiliation": "ISTI-CNR, Italy",
            "Key": "Alessio Ferrari @ ISTI-CNR, Italy",
            "Id": "21d1d1a6dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Markus Fockel",
            "Affiliation": "Fraunhofer IPT, Germany",
            "Key": "Markus Fockel @ Fraunhofer IPT, Germany",
            "Id": "352e4a282f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kristina Forsberg",
            "Affiliation": "Saab, Sweden",
            "Key": "Kristina Forsberg @ Saab, Sweden",
            "Id": "56d4afa2ab",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xavier Franch",
            "Affiliation": "Universitat Politècnica de Catalunya, Spain",
            "Key": "Xavier Franch @ Universitat Politècnica de Catalunya, Spain",
            "Id": "bfcd7fafab",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Fritzsche",
            "Affiliation": "Munich Re, Germany",
            "Key": "Martin Fritzsche @ Munich Re, Germany",
            "Id": "622a6e91dc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Vincenzo Gervasi",
            "Affiliation": "",
            "Key": "Vincenzo Gervasi @",
            "Id": "c5eefca29d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Smita Ghaisas",
            "Affiliation": "Tata Consultancy Services, India",
            "Key": "Smita Ghaisas @ Tata Consultancy Services, India",
            "Id": "d639749ee5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sepideh Ghanavati",
            "Affiliation": "",
            "Key": "Sepideh Ghanavati @",
            "Id": "064d6a26ab",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sepideh Ghanavati",
            "Affiliation": "Luxembourg Institute of Science and Technology, Luxembourg",
            "Key": "Sepideh Ghanavati @ Luxembourg Institute of Science and Technology, Luxembourg",
            "Id": "457e5cc9ca",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Parisa Ghazi",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Parisa Ghazi @ University of Zurich, Switzerland",
            "Id": "926d98f268",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Glinz",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Martin Glinz @ University of Zurich, Switzerland",
            "Id": "b894e77c4b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stefania Gnesi",
            "Affiliation": "ISTI-CNR, Italy",
            "Key": "Stefania Gnesi @ ISTI-CNR, Italy",
            "Id": "f8b12a936d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Arda Goknil",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Arda Goknil @ University of Luxembourg, Luxembourg",
            "Id": "e55a71f87b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Cristina Gómez",
            "Affiliation": "Universitat Politècnica de Catalunya, Spain",
            "Key": "Cristina Gómez @ Universitat Politècnica de Catalunya, Spain",
            "Id": "4264b510e1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tony Gorschek",
            "Affiliation": "",
            "Key": "Tony Gorschek @",
            "Id": "feae3e5f4a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Miguel Goulão",
            "Affiliation": "Universidade Nova de Lisboa, Portugal",
            "Key": "Miguel Goulão @ Universidade Nova de Lisboa, Portugal",
            "Id": "647116a409",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sarah C. Gregory",
            "Affiliation": "",
            "Key": "Sarah C. Gregory @",
            "Id": "9af8d9f775",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paul Grünbacher",
            "Affiliation": "JKU Linz, Austria",
            "Key": "Paul Grünbacher @ JKU Linz, Austria",
            "Id": "65fd7c104b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yann-Gaël Guéhéneuc",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Yann-Gaël Guéhéneuc @ Polytechnique Montréal, Canada",
            "Id": "837681dd22",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jin Guo",
            "Affiliation": "DePaul University, USA",
            "Key": "Jin Guo @ DePaul University, USA",
            "Id": "7a12251731",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Irit Hadar",
            "Affiliation": "University of Haifa, Israel",
            "Key": "Irit Hadar @ University of Haifa, Israel",
            "Id": "c7d6c64c73",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kaj Hänninen",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Kaj Hänninen @ Mälardalen University, Sweden",
            "Id": "64c494d0bf",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mark Harman",
            "Affiliation": "University College London, UK",
            "Key": "Mark Harman @ University College London, UK",
            "Id": "bfac79946d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rogardt Heldal",
            "Affiliation": "Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
            "Key": "Rogardt Heldal @ Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
            "Id": "6d6ada2733",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hanan Hibshi",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Hanan Hibshi @ Carnegie Mellon University, USA",
            "Id": "7061ec72ab",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hannes Holm",
            "Affiliation": "Swedish Defence Research Agency, Sweden",
            "Key": "Hannes Holm @ Swedish Defence Research Agency, Sweden",
            "Id": "e9d3f5a150",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maria Holmegaard",
            "Affiliation": "Mjølner Informatics, Denmark",
            "Key": "Maria Holmegaard @ Mjølner Informatics, Denmark",
            "Id": "70435859d8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jörg Holtmann",
            "Affiliation": "Fraunhofer IPT, Germany",
            "Key": "Jörg Holtmann @ Fraunhofer IPT, Germany",
            "Id": "2b5e60284a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Karen Holtzblatt",
            "Affiliation": "InContext Enterprises",
            "Key": "Karen Holtzblatt @ InContext Enterprises",
            "Id": "fa01ba0725",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jennifer Horkoff",
            "Affiliation": "City University London, UK",
            "Key": "Jennifer Horkoff @ City University London, UK",
            "Id": "24fd89c2ee",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mahmood Hosseini",
            "Affiliation": "Bournemouth University, UK",
            "Key": "Mahmood Hosseini @ Bournemouth University, UK",
            "Id": "17d633d759",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Frank Houdek",
            "Affiliation": "Daimler, Germany",
            "Key": "Frank Houdek @ Daimler, Germany",
            "Id": "10a3fe049f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Linpeng Huang",
            "Affiliation": "Shanghai Jiao Tong University, China",
            "Key": "Linpeng Huang @ Shanghai Jiao Tong University, China",
            "Id": "e7dd91d91c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jane Huffman Hayes",
            "Affiliation": "University of Kentucky, USA",
            "Key": "Jane Huffman Hayes @ University of Kentucky, USA",
            "Id": "1aed38bd93",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Peitsa Hynninen",
            "Affiliation": "Aalto University, Finland",
            "Key": "Peitsa Hynninen @ Aalto University, Finland",
            "Id": "3ba5036bf3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Jackson",
            "Affiliation": "The Open University",
            "Key": "Michael Jackson @ The Open University",
            "Id": "6f95b8f022",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yue Jia",
            "Affiliation": "University College London, UK",
            "Key": "Yue Jia @ University College London, UK",
            "Id": "d2e0936948",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhi Jin",
            "Affiliation": "",
            "Key": "Zhi Jin @",
            "Id": "5ec005ae6b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jens Bæk Jørgensen",
            "Affiliation": "Mjølner Informatics, Denmark",
            "Key": "Jens Bæk Jørgensen @ Mjølner Informatics, Denmark",
            "Id": "5e73e5dc1b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Timo Johann",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Timo Johann @ University of Hamburg, Germany",
            "Id": "e0299ec28a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ivan Jureta",
            "Affiliation": "University of Namur, Belgium",
            "Key": "Ivan Jureta @ University of Namur, Belgium",
            "Id": "77a3300da1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marja Käpyaho",
            "Affiliation": "Futurice, Finland / Aalto University, Finland",
            "Key": "Marja Käpyaho @ Futurice, Finland / Aalto University, Finland",
            "Id": "87d882d869",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hermann Kaindl",
            "Affiliation": "Vienna University of Technology, Austria",
            "Key": "Hermann Kaindl @ Vienna University of Technology, Austria",
            "Id": "697e5806b1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anup K. Kalia",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Anup K. Kalia @ North Carolina State University, USA",
            "Id": "9a3da9404b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marjo Kauppinen",
            "Affiliation": "Aalto University, Finland",
            "Key": "Marjo Kauppinen @ Aalto University, Finland",
            "Id": "7e2561d80c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Roeland H. P. Kegel",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Roeland H. P. Kegel @ University of Twente, Netherlands",
            "Id": "bd7f092f76",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alessia Knauss",
            "Affiliation": "University of Victoria, Canada",
            "Key": "Alessia Knauss @ University of Victoria, Canada",
            "Id": "e91b67ea64",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eric Knauss",
            "Affiliation": "Chalmers University of Technology, Sweden",
            "Key": "Eric Knauss @ Chalmers University of Technology, Sweden",
            "Id": "9efc81ea2c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eric Knauss",
            "Affiliation": "Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
            "Key": "Eric Knauss @ Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
            "Id": "7fd7e5cb92",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jennifer Krisch",
            "Affiliation": "Daimler, Germany",
            "Key": "Jennifer Krisch @ Daimler, Germany",
            "Id": "4d84f937f1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jaison Kuriakose",
            "Affiliation": "Memorial University, Canada",
            "Key": "Jaison Kuriakose @ Memorial University, Canada",
            "Id": "092465738b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Claude Laguë",
            "Affiliation": "",
            "Key": "Claude Laguë @",
            "Id": "a43a46a9fa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Benoit Lebeaupin",
            "Affiliation": "École Centrale Paris, France",
            "Key": "Benoit Lebeaupin @ École Centrale Paris, France",
            "Id": "5cb98226eb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Seok-Won Lee",
            "Affiliation": "Ajou University, South Korea",
            "Key": "Seok-Won Lee @ Ajou University, South Korea",
            "Id": "e60654aa39",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chen Li",
            "Affiliation": "Shanghai Jiao Tong University, China",
            "Key": "Chen Li @ Shanghai Jiao Tong University, China",
            "Id": "d2a1e65e2a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tong Li",
            "Affiliation": "University of Trento, Italy",
            "Key": "Tong Li @ University of Trento, Italy",
            "Id": "42030a055a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sotirios Liaskos",
            "Affiliation": "York University, Canada",
            "Key": "Sotirios Liaskos @ York University, Canada",
            "Id": "c19a35c557",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Sørensen Loft",
            "Affiliation": "Mjølner Informatics, Denmark",
            "Key": "Michael Sørensen Loft @ Mjølner Informatics, Denmark",
            "Id": "a677b4db0c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yue Lu",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Yue Lu @ Mälardalen University, Sweden",
            "Id": "bb2a7c7813",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Garm Lucassen",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Garm Lucassen @ Utrecht University, Netherlands",
            "Id": "7f6a5c1995",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kristina Lundqvist",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Kristina Lundqvist @ Mälardalen University, Sweden",
            "Id": "e5baed5a2b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Walid Maalej",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Walid Maalej @ University of Hamburg, Germany",
            "Id": "3b34bea334",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ricardo J. Machado",
            "Affiliation": "University of Minho, Portugal",
            "Key": "Ricardo J. Machado @ University of Minho, Portugal",
            "Id": "cdac61e5ca",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rita S. P. Maciel",
            "Affiliation": "Federal University of Bahia, Brazil",
            "Key": "Rita S. P. Maciel @ Federal University of Bahia, Brazil",
            "Id": "913150f3ce",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Patrick Mäder",
            "Affiliation": "TU Ilmenau, Germany",
            "Key": "Patrick Mäder @ TU Ilmenau, Germany",
            "Id": "cbf3a7392a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anas Mahmoud",
            "Affiliation": "Louisiana State University, USA",
            "Key": "Anas Mahmoud @ Louisiana State University, USA",
            "Id": "c275ba5c6c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jordi Marco",
            "Affiliation": "Universitat Politècnica de Catalunya, Spain",
            "Key": "Jordi Marco @ Universitat Politècnica de Catalunya, Spain",
            "Id": "43e4d4c0b6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "William Martin",
            "Affiliation": "University College London, UK",
            "Key": "William Martin @ University College London, UK",
            "Id": "838a26e567",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aydin Y. Mirzaee",
            "Affiliation": "FluidReview / SurveyMonkey",
            "Key": "Aydin Y. Mirzaee @ FluidReview / SurveyMonkey",
            "Id": "ba42e7f523",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Natawut Monaikul",
            "Affiliation": "DePaul University, USA",
            "Key": "Natawut Monaikul @ DePaul University, USA",
            "Id": "1f94d4a712",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tobias Morciniec",
            "Affiliation": "Daimler, Germany",
            "Key": "Tobias Morciniec @ Daimler, Germany",
            "Id": "420451b363",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ana Moreira",
            "Affiliation": "Universidade Nova de Lisboa, Portugal",
            "Key": "Ana Moreira @ Universidade Nova de Lisboa, Portugal",
            "Id": "6a955865ca",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Henry Muccini",
            "Affiliation": "University of L'Aquila, Italy",
            "Key": "Henry Muccini @ University of L'Aquila, Italy",
            "Id": "3309b0617f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pradeep K. Murukannaiah",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Pradeep K. Murukannaiah @ North Carolina State University, USA",
            "Id": "7e256a5a4d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "John Mylopoulos",
            "Affiliation": "University of Trento, Italy",
            "Key": "John Mylopoulos @ University of Trento, Italy",
            "Id": "46a66c3c54",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hadeer Nabil",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Hadeer Nabil @ University of Hamburg, Germany",
            "Id": "63f754582e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yudhistira Nugraha",
            "Affiliation": "University of Oxford, UK",
            "Key": "Yudhistira Nugraha @ University of Oxford, UK",
            "Id": "084bca6507",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zachary J. Oster",
            "Affiliation": "University of Wisconsin-Whitewater, USA",
            "Key": "Zachary J. Oster @ University of Wisconsin-Whitewater, USA",
            "Id": "ee26704e02",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Elda Paja",
            "Affiliation": "University of Trento, Italy",
            "Key": "Elda Paja @ University of Trento, Italy",
            "Id": "92b0f144c8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael C. Panis",
            "Affiliation": "Teradyne, USA",
            "Key": "Michael C. Panis @ Teradyne, USA",
            "Id": "de9ccaa82b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jeffrey Parsons",
            "Affiliation": "Memorial University, Canada",
            "Key": "Jeffrey Parsons @ Memorial University, Canada",
            "Id": "50f180a439",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Patrizio Pelliccione",
            "Affiliation": "Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
            "Key": "Patrizio Pelliccione @ Chalmers University of Technology, Sweden / University of Gothenburg, Sweden",
            "Id": "853d09196f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anna Perini",
            "Affiliation": "Fondazione Bruno Kessler, Italy",
            "Key": "Anna Perini @ Fondazione Bruno Kessler, Italy",
            "Id": "4792978b60",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Keith Phalp",
            "Affiliation": "Bournemouth University, UK",
            "Key": "Keith Phalp @ Bournemouth University, UK",
            "Id": "285334cbdc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "João Pimentel",
            "Affiliation": "Federal University of Pernambuco, Brazil",
            "Key": "João Pimentel @ Federal University of Pernambuco, Brazil",
            "Id": "35818d3e0d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Antonio Pitangueira",
            "Affiliation": "IFBA, Brazil",
            "Key": "Antonio Pitangueira @ IFBA, Brazil",
            "Id": "6e24a90d0e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andreas Podelski",
            "Affiliation": "University of Freiburg, Germany",
            "Key": "Andreas Podelski @ University of Freiburg, Germany",
            "Id": "f0348eceee",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christophe Ponsard",
            "Affiliation": "CETIC, Belgium",
            "Key": "Christophe Ponsard @ CETIC, Belgium",
            "Id": "af6044de17",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Roman Popp",
            "Affiliation": "Vienna University of Technology, Austria",
            "Key": "Roman Popp @ Vienna University of Technology, Austria",
            "Id": "86c7c9a494",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Luciana Provenzano",
            "Affiliation": "Bombardier Transportation, Sweden",
            "Key": "Luciana Provenzano @ Bombardier Transportation, Sweden",
            "Id": "79f6492e66",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rick Rabiser",
            "Affiliation": "JKU Linz, Austria",
            "Key": "Rick Rabiser @ JKU Linz, Austria",
            "Id": "1cbed1acb9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Raneburger",
            "Affiliation": "Vienna University of Technology, Austria",
            "Key": "David Raneburger @ Vienna University of Technology, Austria",
            "Id": "34d8cb7aae",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Patrick Rempel",
            "Affiliation": "TU Ilmenau, Germany",
            "Key": "Patrick Rempel @ TU Ilmenau, Germany",
            "Id": "34834a5773",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Guenther Ruhe",
            "Affiliation": "University of Calgary, Canada",
            "Key": "Guenther Ruhe @ University of Calgary, Canada",
            "Id": "a7aa7330d6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mehrdad Sabetzadeh",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Mehrdad Sabetzadeh @ University of Luxembourg, Luxembourg",
            "Id": "80f00f8653",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Carlos E. Salgado",
            "Affiliation": "University of Minho, Portugal",
            "Key": "Carlos E. Salgado @ University of Minho, Portugal",
            "Id": "e9ed3a7bd4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ganesh Ram Santhanam",
            "Affiliation": "Iowa State University, USA",
            "Key": "Ganesh Ram Santhanam @ Iowa State University, USA",
            "Id": "94bcf88be7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Federica Sarro",
            "Affiliation": "University College London, UK",
            "Key": "Federica Sarro @ University College London, UK",
            "Id": "e3501cfea3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Peter Sawyer",
            "Affiliation": "",
            "Key": "Peter Sawyer @",
            "Id": "4b7fb10b59",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bernhard Schätz",
            "Affiliation": "Fortiss, Germany",
            "Key": "Bernhard Schätz @ Fortiss, Germany",
            "Id": "b164023266",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Norbert Seyff",
            "Affiliation": "University of Applied Sciences and Arts Northwestern Switzerland, Switzerland / University of Zurich, Switzerland",
            "Key": "Norbert Seyff @ University of Applied Sciences and Arts Northwestern Switzerland, Switzerland / University of Zurich, Switzerland",
            "Id": "e54bab5100",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alimohammad Shahri",
            "Affiliation": "Bournemouth University, UK",
            "Key": "Alimohammad Shahri @ Bournemouth University, UK",
            "Id": "2ca8778053",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zahra Shakeri Hossein Abad",
            "Affiliation": "University of Calgary, Canada",
            "Key": "Zahra Shakeri Hossein Abad @ University of Calgary, Canada",
            "Id": "d0b12b5244",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alberto Siena",
            "Affiliation": "Fondazione Bruno Kessler, Italy",
            "Key": "Alberto Siena @ Fondazione Bruno Kessler, Italy",
            "Id": "10f08914e7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Munindar P. Singh",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Munindar P. Singh @ North Carolina State University, USA",
            "Id": "2f9a5259e3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Smullen",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Daniel Smullen @ Carnegie Mellon University, USA",
            "Id": "45e44aed3e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mozhan Soltani",
            "Affiliation": "University of Gothenburg, Sweden",
            "Key": "Mozhan Soltani @ University of Gothenburg, Sweden",
            "Id": "42bdb65d23",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Teodor Sommestad",
            "Affiliation": "Swedish Defence Research Agency, Sweden",
            "Key": "Teodor Sommestad @ Swedish Defence Research Agency, Sweden",
            "Id": "e974dcb712",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paola Spoletini",
            "Affiliation": "Kennesaw State University, USA",
            "Key": "Paola Spoletini @ Kennesaw State University, USA",
            "Id": "b437844f58",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Stig Stissing",
            "Affiliation": "Mjølner Informatics, Denmark",
            "Key": "Martin Stig Stissing @ Mjølner Informatics, Denmark",
            "Id": "66994c9a8e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Angelo Susi",
            "Affiliation": "Fondazione Bruno Kessler, Italy",
            "Key": "Angelo Susi @ Fondazione Bruno Kessler, Italy",
            "Id": "3db717d1e2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maryam Taghavianfar",
            "Affiliation": "Chalmers University of Technology, Sweden",
            "Key": "Maryam Taghavianfar @ Chalmers University of Technology, Sweden",
            "Id": "2bdb10e645",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pankaj R. Telang",
            "Affiliation": "Cisco Systems, USA",
            "Key": "Pankaj R. Telang @ Cisco Systems, USA",
            "Id": "fb93ae424a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sabine Teufl",
            "Affiliation": "Fortiss, Germany",
            "Key": "Sabine Teufl @ Fortiss, Germany",
            "Id": "9c66f77afd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Irina Todoran Koitz",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Irina Todoran Koitz @ University of Zurich, Switzerland",
            "Id": "dc879da0b3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Antonio Vallecillo",
            "Affiliation": "University of Málaga, Spain",
            "Key": "Antonio Vallecillo @ University of Málaga, Spain",
            "Id": "bcb6ecb9ab",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Axel Van Lamsweerde",
            "Affiliation": "Université Catholique de Louvain, Belgium",
            "Key": "Axel Van Lamsweerde @ Université Catholique de Louvain, Belgium",
            "Id": "ccb647ed7e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Vierhauser",
            "Affiliation": "JKU Linz, Austria",
            "Key": "Michael Vierhauser @ JKU Linz, Austria",
            "Id": "d4ee00680b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jéssyka Vilela",
            "Affiliation": "Federal University of Pernambuco, Brazil",
            "Key": "Jéssyka Vilela @ Federal University of Pernambuco, Brazil",
            "Id": "c94d61040d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andreas Vogelsang",
            "Affiliation": "TU München, Germany",
            "Key": "Andreas Vogelsang @ TU München, Germany",
            "Id": "645a35d10b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Maxime Warnier",
            "Affiliation": "CLLE-ERSS, France / CNES, France",
            "Key": "Maxime Warnier @ CLLE-ERSS, France / CNES, France",
            "Id": "0f31de34bb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "J.M.E.M. van der Werf",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "J.M.E.M. van der Werf @ Utrecht University, Netherlands",
            "Id": "4799cc12a7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alexander Widera",
            "Affiliation": "Munich Re, Germany",
            "Key": "Alexander Widera @ Munich Re, Germany",
            "Id": "9f9b4a0a0c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Roel J. Wieringa",
            "Affiliation": "University of Twente, Netherlands",
            "Key": "Roel J. Wieringa @ University of Twente, Netherlands",
            "Id": "f4b4d2f288",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Manuel Wimmer",
            "Affiliation": "Vienna University of Technology, Austria",
            "Key": "Manuel Wimmer @ Vienna University of Technology, Austria",
            "Id": "f68368a020",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christian Winkler",
            "Affiliation": "MAN Truck & Bus, Germany",
            "Key": "Christian Winkler @ MAN Truck & Bus, Germany",
            "Id": "58d7015921",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Krzysztof Wnuk",
            "Affiliation": "Blekinge Institute of Technology, Sweden",
            "Key": "Krzysztof Wnuk @ Blekinge Institute of Technology, Sweden",
            "Id": "cd8f9a05ee",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xiwen Wu",
            "Affiliation": "Shanghai Jiao Tong University, China",
            "Key": "Xiwen Wu @ Shanghai Jiao Tong University, China",
            "Id": "2274d29092",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dustin Wüest",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Dustin Wüest @ University of Zurich, Switzerland",
            "Id": "434c55e652",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Anna Zamansky",
            "Affiliation": "University of Haifa, Israel",
            "Key": "Anna Zamansky @ University of Haifa, Israel",
            "Id": "12e3a84fa4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Edith Zavala",
            "Affiliation": "Universitat Politècnica de Catalunya, Spain",
            "Key": "Edith Zavala @ Universitat Politècnica de Catalunya, Spain",
            "Id": "a01db335a3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marc van Zee",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Marc van Zee @ University of Luxembourg, Luxembourg",
            "Id": "877c65bc6b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yuanyuan Zhang",
            "Affiliation": "University College London, UK",
            "Key": "Yuanyuan Zhang @ University College London, UK",
            "Id": "1a3efe61b3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hao Zhong",
            "Affiliation": "Shanghai Jiao Tong University, China",
            "Key": "Hao Zhong @ Shanghai Jiao Tong University, China",
            "Id": "51c043421b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jiale Zhou",
            "Affiliation": "Mälardalen University, Sweden",
            "Key": "Jiale Zhou @ Mälardalen University, Sweden",
            "Id": "ce769ec015",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Frank Zimmer",
            "Affiliation": "SES TechCom, Luxembourg",
            "Key": "Frank Zimmer @ SES TechCom, Luxembourg",
            "Id": "ff1e33ceff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Didar Zowghi",
            "Affiliation": "",
            "Key": "Didar Zowghi @",
            "Id": "7a45d63b06",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        }
    ]
}
 
