{
    "DataRevision": 1438353024,
    "Preliminary": "false",
    "Event": "ESEC/FSE 2015",
    "Name": "ESEC/FSE 2015",
    "Description": "",
    "Date": "August 30 – September 4, 2015",
    "DateStart": "2015-08-30",
    "DateEnd": "2015-09-04",
    "Location": "Bergamo, Italy",
    "Sponsors": "",
    "URL": "http://esec-fse15.dei.polimi.it/",
    "MultiTrack": "true",
    "UseMiniPage": "true",
    "NewPagePerDay": "false",
    "NumOfParallelTracks": 6,
    "Organization": {
        "General Chairs": [
                "Elisabetta Di Nitto"
        ],
        "PC Chairs": [
                "Mark Harman",
                "Patrick Heymans"
        ]
    },
    "SocialFeeds": [
        {
            "Name": "Twitter",
            "Keywords": [
                "FSEconf"
            ],
            "URL": ""
        }
    ],
    "VenueInfo": {
        "Name": "",
        "GPS": {
            "Latitude": 0,
            "Longitude": 0
        }
    },
    "InfoPage": {
        "xaml": "foo",
        "Elements": [
            {
                "XamlName": "ConferenceCenterMap",
                "Type": "Map",
                "GPS": {
                    "Latitude": 0,
                    "Longitude": 0
                },
                "MapLabel": ""
            },
            {
                "XamlName": "LicenseButton",
                "Type": "WebLink",
                "URL": "http://research.microsoft.com/en-US/projects/confapp/terms.aspx"
            },
            {
                "XamlName": "PrivacyButton",
                "Type": "WebLink",
                "URL": "http://privacy.microsoft.com/en-us/default.msp"
            }
        ]
    },
    "SessionPriorities": [
        "Award",
        "Invited Talk",
        "Other"
    ],
    "Items": [
        {
            "Title": "Gamification for Enforcing Coding Conventions",
            "Type": "Full Paper",
            "Key": "fse15main-mainid8-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DChristian+R.+Prause+and+Matthias+Jarke+%22Gamification+for+Enforcing+Coding+Conventions%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786806",
            "PersonsString": "Christian R. Prause and Matthias Jarke",
            "AffiliationsString": "DLR, Germany; RWTH Aachen University, Germany",
            "Authors": [
                "Christian R. Prause @ DLR, Germany",
                "Matthias Jarke @ RWTH Aachen University, Germany"
            ],
            "Affiliations": [
                "DLR, Germany",
                "RWTH Aachen University, Germany"
            ],
            "Abstract": "Software is a knowledge intensive product, which can only evolve if there is effective and efficient information exchange between developers. Complying to coding conventions improves information exchange by improving the readability of source code. However, without some form of enforcement, compliance to coding conventions is limited. We look at the problem of information exchange in code and propose gamification as a way to motivate developers to invest in compliance. Our concept consists of a technical prototype and its integration into a Scrum environment. By means of two experiments with agile software teams and subsequent surveys, we show that gamification can effectively improve adherence to coding conventions.",
            "Award": ""
        },
        {
            "Title": "FlexJava: Language Support for Safe and Modular Approximate Programming",
            "Type": "Full Paper",
            "Key": "fse15main-mainid18-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJongse+Park%2C+Hadi+Esmaeilzadeh%2C+Xin+Zhang%2C+Mayur+Naik%2C+and+William+Harris+%22FlexJava%3A+Language+Support+for+Safe+and+Modular+Approximate+Programming%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786807",
            "PersonsString": "Jongse Park, Hadi Esmaeilzadeh, Xin Zhang, Mayur Naik, and William Harris",
            "AffiliationsString": "Georgia Tech, USA",
            "Authors": [
                "Jongse Park @ Georgia Tech, USA",
                "Hadi Esmaeilzadeh @ Georgia Tech, USA",
                "Xin Zhang @ Georgia Tech, USA",
                "Mayur Naik @ Georgia Tech, USA",
                "William Harris @ Georgia Tech, USA"
            ],
            "Affiliations": [
                "Georgia Tech, USA",
                "Georgia Tech, USA",
                "Georgia Tech, USA",
                "Georgia Tech, USA",
                "Georgia Tech, USA"
            ],
            "Abstract": "Energy efficiency is a primary constraint in modern systems. Approximate computing is a promising approach that trades quality of result for gains in efficiency and performance. State- of-the-art approximate programming models require extensive manual annotations on program data and operations to guarantee safe execution of approximate programs. The need for extensive manual annotations hinders the practical use of approximation techniques. This paper describes FlexJava, a small set of language extensions, that significantly reduces the annotation effort, paving the way for practical approximate programming. These extensions enable programmers to annotate approximation-tolerant method outputs. The FlexJava compiler, which is equipped with an approximation safety analysis, automatically infers the operations and data that affect these outputs and selectively marks them approximable while giving safety guarantees. The automation and the language–compiler codesign relieve programmers from manually and explicitly an- notating data declarations or operations as safe to approximate. FlexJava is designed to support safety, modularity, generality, and scalability in software development. We have implemented FlexJava annotations as a Java library and we demonstrate its practicality using a wide range of Java applications and by con- ducting a user study. Compared to EnerJ, a recent approximate programming system, FlexJava provides the same energy savings with significant reduction (from 2× to 17×) in the number of annotations. In our user study, programmers spend 6× to 12× less time annotating programs using FlexJava than when using EnerJ.",
            "Award": ""
        },
        {
            "Title": "Responsive Designs in a Snap",
            "Type": "Full Paper",
            "Key": "fse15main-mainid24-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DNishant+Sinha+and+Rezwana+Karim+%22Responsive+Designs+in+a+Snap%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786808",
            "PersonsString": "Nishant Sinha and Rezwana Karim",
            "AffiliationsString": "IBM Research, India; Rutgers University, USA",
            "Authors": [
                "Nishant Sinha @ IBM Research, India",
                "Rezwana Karim @ Rutgers University, USA"
            ],
            "Affiliations": [
                "IBM Research, India",
                "Rutgers University, USA"
            ],
            "Abstract": "With the massive adoption of mobile devices with different form- factors, UI designers face the challenge of designing responsive UIs which are visually appealing across a wide range of devices. De- signing responsive UIs requires a deep knowledge of HTML/CSS as well as responsive patterns - juggling through various design configurations and re-designing for multiple devices is laborious and time-consuming. We present DECOR, a recommendation tool for creating multi-device responsive UIs. Given an initial UI de- sign, user-specified design constraints and a list of devices, DECOR provides ranked, device-specific recommendations to the designer for approval. Design space exploration involves a combinatorial explosion: we formulate it as a design repair problem and devise several design space pruning techniques to enable efficient repair. An evaluation over real-life designs shows that DECOR is able to compute the desired recommendations, involving a variety of responsive design patterns, in less than a minute.",
            "Award": ""
        },
        {
            "Title": "How Practitioners Perceive the Relevance of Software Engineering Research",
            "Type": "Full Paper",
            "Key": "fse15main-mainid34-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDavid+Lo%2C+Nachiappan+Nagappan%2C+and+Thomas+Zimmermann+%22How+Practitioners+Perceive+the+Relevance+of+Software+Engineering+Research%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786809",
            "PersonsString": "David Lo, Nachiappan Nagappan, and Thomas Zimmermann",
            "AffiliationsString": "Singapore Management University, Singapore; Microsoft Research, USA",
            "Authors": [
                "David Lo @ Singapore Management University, Singapore",
                "Nachiappan Nagappan @ Microsoft Research, USA",
                "Thomas Zimmermann @ Microsoft Research, USA"
            ],
            "Affiliations": [
                "Singapore Management University, Singapore",
                "Microsoft Research, USA",
                "Microsoft Research, USA"
            ],
            "Abstract": "The number of software engineering research papers over the last few years has grown significantly. An important question here is: how relevant is software engineering research to practitioners in the field? To address this question, we conducted a survey at Microsoft where we invited 3,000 industry practitioners to rate the relevance of research ideas contained in 571 ICSE, ESEC/FSE and FSE papers that were published over a five year period. We received 17,913 ratings by 512 practitioners who labelled ideas as essential, worthwhile, unimportant, or unwise. The results from the survey suggest that practitioners are positive towards studies done by the software engineering research community: 71% of all ratings were essential or worthwhile. We found no correlation between the citation counts and the relevance scores of the papers. Through a qualitative analysis of free text responses, we identify several reasons why practitioners considered certain research ideas to be unwise. The survey approach described in this paper is lightweight: on average, a participant spent only 22.5 minutes to respond to the survey. At the same time, the results can provide useful insight to conference organizers, authors, and participating practitioners.",
            "Award": ""
        },
        {
            "Title": "Automatically Deriving Pointer Reference Expressions from Binary Code for Memory Dump Analysis",
            "Type": "Full Paper",
            "Key": "fse15main-mainid35-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYangchun+Fu%2C+Zhiqiang+Lin%2C+and+David+Brumley+%22Automatically+Deriving+Pointer+Reference+Expressions+from+Binary+Code+for+Memory+Dump+Analysis%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786810",
            "PersonsString": "Yangchun Fu, Zhiqiang Lin, and David Brumley",
            "AffiliationsString": "University of Texas at Dallas, USA; Carnegie Mellon University, USA",
            "Authors": [
                "Yangchun Fu @ University of Texas at Dallas, USA",
                "Zhiqiang Lin @ University of Texas at Dallas, USA",
                "David Brumley @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "University of Texas at Dallas, USA",
                "University of Texas at Dallas, USA",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Given a crash dump or a kernel memory snapshot, it is often desirable to have a capability that can traverse its pointers to locate the root cause of the crash, or check their integrity to detect the control flow hijacks. To achieve this, one key challenge lies in how to locate where the pointers are. While locating a pointer usually requires the data structure knowledge of the corresponding program, an important advance made by this work is that we show a technique of extracting address-independent data reference expressions for pointers through dynamic binary analysis. This novel pointer reference expression encodes how a pointer is accessed through the combination of a base address (usually a global variable) with certain offset and further pointer dereferences. We have applied our techniques to OS kernels, and our experimental results with a number of real world kernel malware show that we can correctly identify the hijacked kernel function pointers by locating them using the extracted pointer reference expressions when only given a memory snapshot.",
            "Award": ""
        },
        {
            "Title": "Staged Program Repair with Condition Synthesis",
            "Type": "Full Paper",
            "Key": "fse15main-mainid37-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DFan+Long+and+Martin+Rinard+%22Staged+Program+Repair+with+Condition+Synthesis%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fgroups.csail.mit.edu%2Fpac%2Fspr%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786811",
            "PersonsString": "Fan Long and Martin Rinard",
            "AffiliationsString": "Massachusetts Institute of Technology, USA",
            "Authors": [
                "Fan Long @ Massachusetts Institute of Technology, USA",
                "Martin Rinard @ Massachusetts Institute of Technology, USA"
            ],
            "Affiliations": [
                "Massachusetts Institute of Technology, USA",
                "Massachusetts Institute of Technology, USA"
            ],
            "Abstract": "We present SPR, a new program repair system that combines staged program repair and condition synthesis. These techniques enable SPR to work productively with a set of parameterized transformation schemas to generate and efficiently search a rich space of program repairs. Together these techniques enable SPR to generate correct repairs for over five times as many defects as previous systems evaluated on the same benchmark set.",
            "Award": ""
        },
        {
            "Title": "Questions Developers Ask While Diagnosing Potential Security Vulnerabilities with Static Analysis",
            "Type": "Full Paper",
            "Key": "fse15main-mainid46-p",
            "URL": "http%3A%2F%2Fwww4.ncsu.edu%2F%7Ejssmit11%2FPublications%2FCamera%2520Ready%2520FSE15.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww4.ncsu.edu%2F%7Ebijohnso%2Fprojects.html%23TSQDAASV",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786812",
            "PersonsString": "Justin Smith, Brittany Johnson, Emerson Murphy-Hill, Bill Chu, and Heather Richter Lipford",
            "AffiliationsString": "North Carolina State University, USA; University of North Carolina at Charlotte, USA",
            "Authors": [
                "Justin Smith @ North Carolina State University, USA",
                "Brittany Johnson @ North Carolina State University, USA",
                "Emerson Murphy-Hill @ North Carolina State University, USA",
                "Bill Chu @ University of North Carolina at Charlotte, USA",
                "Heather Richter Lipford @ University of North Carolina at Charlotte, USA"
            ],
            "Affiliations": [
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "University of North Carolina at Charlotte, USA",
                "University of North Carolina at Charlotte, USA"
            ],
            "Abstract": "Security tools can help developers answer questions about potential vulnerabilities in their code. A better understanding of the types of questions asked by developers may help toolsmiths design more effective tools. In this paper, we describe how we collected and categorized these questions by conducting an exploratory study with novice and experienced software developers. We equipped them with Find Security Bugs, a security-oriented static analysis tool, and observed their interactions with security vulnerabilities in an open-source system that they had previously contributed to. We found that they asked questions not only about security vulnerabilities, associated attacks, and fixes, but also questions about the software itself, the social ecosystem that built the software, and related resources and tools. For example, when participants asked questions about the source of tainted data, their tools forced them to make imperfect tradeoffs between systematic and ad hoc program navigation strategies.",
            "Award": ""
        },
        {
            "Title": "Heterogeneous Cross-Company Defect Prediction by Unified Metric Representation and CCA-Based Transfer Learning",
            "Type": "Full Paper",
            "Key": "fse15main-mainid54-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DXiaoyuan+Jing%2C+Fei+Wu%2C+Xiwei+Dong%2C+Fumin+Qi%2C+and+Baowen+Xu+%22Heterogeneous+Cross-Company+Defect+Prediction+by+Unified+Metric+Representation+and+CCA-Based+Transfer+Learning%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786813",
            "PersonsString": "Xiaoyuan Jing, Fei Wu, Xiwei Dong, Fumin Qi, and Baowen Xu",
            "AffiliationsString": "Wuhan University, China; Nanjing University, China",
            "Authors": [
                "Xiaoyuan Jing @ Wuhan University, China",
                "Fei Wu @ Wuhan University, China",
                "Xiwei Dong @ Wuhan University, China",
                "Fumin Qi @ Wuhan University, China",
                "Baowen Xu @ Nanjing University, China"
            ],
            "Affiliations": [
                "Wuhan University, China",
                "Wuhan University, China",
                "Wuhan University, China",
                "Wuhan University, China",
                "Nanjing University, China"
            ],
            "Abstract": "Cross-company defect prediction (CCDP) learns a prediction model by using training data from one or multiple projects of a source company and then applies the model to the target company data. Existing CCDP methods are based on the assumption that the data of source and target companies should have the same software metrics. However, for CCDP, the source and target company data is usually heterogeneous, namely the metrics used and the size of metric set are different in the data of two companies. We call CCDP in this scenario as heterogeneous CCDP (HCCDP) task. In this paper, we aim to provide an effective solution for HCCDP. We propose a unified metric representation (UMR) for the data of source and target companies. The UMR consists of three types of metrics, i.e., the common metrics of the source and target companies, source-company specific metrics and target-company specific metrics. To construct UMR for source company data, the target-company specific metrics are set as zeros, while for UMR of the target company data, the source-company specific metrics are set as zeros. Based on the unified metric representation, we for the first time introduce canonical correlation analysis (CCA), an effective transfer learning method, into CCDP to make the data distributions of source and target companies similar. Experiments on 14 public heterogeneous datasets from four companies indicate that: 1) for HCCDP with partially different metrics, our approach significantly outperforms state-of-the-art CCDP methods; 2) for HCCDP with totally different metrics, our approach obtains comparable prediction performances in contrast with within-project prediction results. The proposed approach is effective for HCCDP.",
            "Award": ""
        },
        {
            "Title": "Heterogeneous Defect Prediction",
            "Type": "Full Paper",
            "Key": "fse15main-mainid56-p",
            "URL": "http%3A%2F%2Fwww.cse.ust.hk%2F%7Ejcnam%2Ffiles%2FHDP_FSE2015.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786814",
            "PersonsString": "Jaechang Nam and Sunghun Kim",
            "AffiliationsString": "Hong Kong University of Science and Technology, China",
            "Authors": [
                "Jaechang Nam @ Hong Kong University of Science and Technology, China",
                "Sunghun Kim @ Hong Kong University of Science and Technology, China"
            ],
            "Affiliations": [
                "Hong Kong University of Science and Technology, China",
                "Hong Kong University of Science and Technology, China"
            ],
            "Abstract": "Software defect prediction is one of the most active research areas in software engineering. We can build a prediction model with defect data collected from a software project and predict defects in the same project, i.e. within-project defect prediction (WPDP). Researchers also proposed cross-project defect prediction (CPDP) to predict defects for new projects lacking in defect data by using prediction models built by other projects. In recent studies, CPDP is proved to be feasible. However, CPDP requires projects that have the same metric set, meaning the metric sets should be identical between projects. As a result, current techniques for CPDP are difficult to apply across projects with heterogeneous metric sets. To address the limitation, we propose heterogeneous defect prediction (HDP) to predict defects across projects with heterogeneous metric sets. Our HDP approach conducts metric selection and metric matching to build a prediction model between projects with heterogeneous metric sets. Our empirical study on 28 subjects shows that about 68% of predictions using our approach outperform or are comparable to WPDP with statistical significance.",
            "Award": ""
        },
        {
            "Title": "What Change History Tells Us about Thread Synchronization",
            "Type": "Full Paper",
            "Key": "fse15main-mainid59-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRui+Gu%2C+Guoliang+Jin%2C+Linhai+Song%2C+Linjie+Zhu%2C+and+Shan+Lu+%22What+Change+History+Tells+Us+about+Thread+Synchronization%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786815",
            "PersonsString": "Rui Gu, Guoliang Jin, Linhai Song, Linjie Zhu, and Shan Lu",
            "AffiliationsString": "Columbia University, USA; North Carolina State University, USA; University of Wisconsin-Madison, USA; University of Chicago, USA",
            "Authors": [
                "Rui Gu @ Columbia University, USA",
                "Guoliang Jin @ North Carolina State University, USA",
                "Linhai Song @ University of Wisconsin-Madison, USA",
                "Linjie Zhu @ University of Wisconsin-Madison, USA",
                "Shan Lu @ University of Chicago, USA"
            ],
            "Affiliations": [
                "Columbia University, USA",
                "North Carolina State University, USA",
                "University of Wisconsin-Madison, USA",
                "University of Wisconsin-Madison, USA",
                "University of Chicago, USA"
            ],
            "Abstract": "Multi-threaded programs are pervasive, yet difficult to write. Missing proper synchronization leads to correctness bugs and over synchronization leads to performance problems. To improve the correctness and efficiency of multi-threaded software, we need a better understanding of synchronization challenges faced by real-world developers. This paper studies the code repositories of open-source multi-threaded software projects to obtain a broad and in- depth view of how developers handle synchronizations. We first examine how critical sections are changed when software evolves by checking over 250,000 revisions of four representative open-source software projects. The findings help us answer questions like how often synchronization is an afterthought for developers; whether it is difficult for devel- opers to decide critical section boundaries and lock variables; and what are real-world over-synchronization problems. We then conduct case studies to better understand (1) how critical sections are changed to solve performance prob- lems (i.e. over-synchronization issues) and (2) how soft- ware changes lead to synchronization-related correctness problems (i.e. concurrency bugs). This in-depth study shows that tool support is needed to help developers tackle over-synchronization problems; it also shows that concur- rency bug avoidance, detection, and testing can be improved through better awareness of code revision history.",
            "Award": ""
        },
        {
            "Title": "Quantifying Developers&#039; Adoption of Security Tools",
            "Type": "Full Paper",
            "Key": "fse15main-mainid62-p",
            "URL": "http%3A%2F%2Fpeople.engr.ncsu.edu%2Fermurph3%2Fpapers%2Ffse15-main-jim.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786816",
            "PersonsString": "Jim Witschey, Olga Zielinska, Allaire Welk, Emerson Murphy-Hill, Chris Mayhorn, and Thomas Zimmermann",
            "AffiliationsString": "North Carolina State University, USA; Microsoft Research, USA",
            "Authors": [
                "Jim Witschey @ North Carolina State University, USA",
                "Olga Zielinska @ North Carolina State University, USA",
                "Allaire Welk @ North Carolina State University, USA",
                "Emerson Murphy-Hill @ North Carolina State University, USA",
                "Chris Mayhorn @ North Carolina State University, USA",
                "Thomas Zimmermann @ Microsoft Research, USA"
            ],
            "Affiliations": [
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "North Carolina State University, USA",
                "Microsoft Research, USA"
            ],
            "Abstract": "Security tools could help developers find critical vulnerabilities, yet such tools remain underused. We surveyed developers from 14 companies and 5 mailing lists about their reasons for using and not using security tools. The resulting thirty-nine predictors of security tool use provide both expected and unexpected insights. As we expected, developers who perceive security to be important are more likely to use security tools than those who do not. But that was not the strongest predictor of security tool use, it was instead developers&#039; ability to observe their peers using security tools.",
            "Award": ""
        },
        {
            "Title": "TLV: Abstraction through Testing, Learning, and Validation",
            "Type": "Full Paper",
            "Key": "fse15main-mainid64-p",
            "URL": "https%3A%2F%2Fsites.google.com%2Fsite%2Fspencerhaoxiao%2FPublications%2FFSE15.pdf%3Fattredirects%3D0",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fsites.google.com%2Fsite%2Fspencerhaoxiao%2Fdataset%2Ffse2015-replication-package",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786817",
            "PersonsString": "Jun Sun, Hao Xiao, Yang Liu, Shang-Wei Lin, and Shengchao Qin",
            "AffiliationsString": "Singapore University of Technology and Design, Singapore; Nanyang Technological University, Singapore; Teesside University, UK",
            "Authors": [
                "Jun Sun @ Singapore University of Technology and Design, Singapore",
                "Hao Xiao @ Nanyang Technological University, Singapore",
                "Yang Liu @ Nanyang Technological University, Singapore",
                "Shang-Wei Lin @ Singapore University of Technology and Design, Singapore",
                "Shengchao Qin @ Teesside University, UK"
            ],
            "Affiliations": [
                "Singapore University of Technology and Design, Singapore",
                "Nanyang Technological University, Singapore",
                "Nanyang Technological University, Singapore",
                "Singapore University of Technology and Design, Singapore",
                "Teesside University, UK"
            ],
            "Abstract": "A (Java) class provides a service to its clients (i.e., programs which use the class). The service must satisfy certain specifications. Different specifications might be expected at different levels of abstraction depending on the client&#039;s objective. In order to effectively contrast the class against its specifications, whether manually or automatically, one essential step is to automatically construct an abstraction of the given class at a proper level of abstraction. The abstraction should be correct (i.e., over-approximating) and accurate (i.e., with few spurious traces). We present an automatic approach, which combines testing, learning, and validation, to constructing an abstraction. Our approach is designed such that a large part of the abstraction is generated based on testing and learning so as to minimize the use of heavy-weight techniques like symbolic execution. The abstraction is generated through a process of abstraction/refinement, with no user input, and converges to a specific level of abstraction depending on the usage context. The generated abstraction is guaranteed to be correct and accurate. We have implemented the proposed approach in a toolkit named TLV and evaluated TLV with a number of benchmark programs as well as three real-world ones. The results show that TLV generates abstraction for program analysis and verification more efficiently.",
            "Award": ""
        },
        {
            "Title": "Effective Test Suites for Mixed Discrete-Continuous Stateflow Controllers",
            "Type": "Full Paper",
            "Key": "fse15main-mainid65-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DReza+Matinnejad%2C+Shiva+Nejati%2C+Lionel+C.+Briand%2C+and+Thomas+Bruckmann+%22Effective+Test+Suites+for+Mixed+Discrete-Continuous+Stateflow+Controllers%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786818",
            "PersonsString": "Reza Matinnejad, Shiva Nejati, Lionel C. Briand, and Thomas Bruckmann",
            "AffiliationsString": "University of Luxembourg, Luxembourg; Delphi Automotive Systems, Luxembourg",
            "Authors": [
                "Reza Matinnejad @ University of Luxembourg, Luxembourg",
                "Shiva Nejati @ University of Luxembourg, Luxembourg",
                "Lionel C. Briand @ University of Luxembourg, Luxembourg",
                "Thomas Bruckmann @ Delphi Automotive Systems, Luxembourg"
            ],
            "Affiliations": [
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg",
                "University of Luxembourg, Luxembourg",
                "Delphi Automotive Systems, Luxembourg"
            ],
            "Abstract": "Modeling mixed discrete-continuous controllers using Stateflow is common practice and has a long tradition in the embedded software system industry. Testing Stateflow models is complicated by expensive and manual test oracles that are not amenable to full automation due to the complex continuous behaviors of such models. In this paper, we reduce the cost of manual test oracles by providing test case selection algorithms that help engineers develop small test suites with high fault revealing power for Stateflow models. We present six test selection algorithms for discrete-continuous Stateflows: An adaptive random test selection algorithm that diversifies test inputs, two white-box coverage-based algorithms, a black-box algorithm that diversifies test outputs, and two search-based black-box algorithms that aim to maximize the likelihood of presence of continuous output failure patterns. We evaluate and compare our test selection algorithms, and find that our three output-based algorithms consistently outperform the coverage- and input-based algorithms in revealing faults in discrete-continuous Stateflow models. Further, we show that our output-based algorithms are complementary as the two search-based algorithms perform best in revealing specific failures with small test suites, while the output diversity algorithm is able to identify different failure types better than other algorithms when test suites are above a certain size.",
            "Award": ""
        },
        {
            "Title": "Crowd Debugging",
            "Type": "Full Paper",
            "Key": "fse15main-mainid70-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DFuxiang+Chen+and+Sunghun+Kim+%22Crowd+Debugging%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786819",
            "PersonsString": "Fuxiang Chen and Sunghun Kim",
            "AffiliationsString": "Hong Kong University of Science and Technology, China",
            "Authors": [
                "Fuxiang Chen @ Hong Kong University of Science and Technology, China",
                "Sunghun Kim @ Hong Kong University of Science and Technology, China"
            ],
            "Affiliations": [
                "Hong Kong University of Science and Technology, China",
                "Hong Kong University of Science and Technology, China"
            ],
            "Abstract": "Research shows that, in general, many people turn to QA sites to solicit answers to their problems. We observe in Stack Overflow a huge number of recurring questions, 1,632,590, despite mechanisms having been put into place to prevent these recurring questions. Recurring questions imply developers are facing similar issues in their source code. However, limitations exist in the QA sites. Developers need to visit them frequently and/or should be familiar with all the content to take advantage of the crowd&#039;s knowledge. Due to the large and rapid growth of QA data, it is difficult, if not impossible for developers to catch up. To address these limitations, we propose mining the QA site, Stack Overflow, to leverage the huge mass of crowd knowledge to help developers debug their code. Our approach reveals 189 warnings and 171 (90.5%) of them are confirmed by developers from eight high-quality and well-maintained projects. Developers appreciate these findings because the crowd provides solutions and comprehensive explanations to the issues. We compared the confirmed bugs with three popular static analysis tools (FindBugs, JLint and PMD). Of the 171 bugs identified by our approach, only FindBugs detected six of them whereas JLint and PMD detected none.",
            "Award": ""
        },
        {
            "Title": "Detecting JavaScript Races That Matter",
            "Type": "Full Paper",
            "Key": "fse15main-mainid72-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DErdal+Mutlu%2C+Serdar+Tasiran%2C+and+Benjamin+Livshits+%22Detecting+JavaScript+Races+That+Matter%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fmsrc.ku.edu.tr%2Fprojects%2Fdetecting-javascript-races-that-matter%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786820",
            "PersonsString": "Erdal Mutlu, Serdar Tasiran, and Benjamin Livshits",
            "AffiliationsString": "Koç University, Turkey; Microsoft Research, USA",
            "Authors": [
                "Erdal Mutlu @ Koç University, Turkey",
                "Serdar Tasiran @ Koç University, Turkey",
                "Benjamin Livshits @ Microsoft Research, USA"
            ],
            "Affiliations": [
                "Koç University, Turkey",
                "Koç University, Turkey",
                "Microsoft Research, USA"
            ],
            "Abstract": "As JavaScript has become virtually omnipresent as the language for programming large and complex web applications in the last several years, we have seen an increase in interest in finding data races in client-side JavaScript. While JavaScript execution is single-threaded, there is still enough potential for data races, created largely by the non-determinism of the scheduler. Recently, several academic efforts have explored both static and run-time analysis approaches in an effort to find data races. However, despite this, we have not seen these analysis techniques deployed in practice and we have only seen scarce evidence that developers find and fix bugs related to data races in JavaScript. In this paper we argue for a different formulation of what it means to have a data race in a JavaScript application and distinguish between benign and harmful races, affecting persistent browser or server state. We further argue that while benign races — the subject of the majority of prior work — do exist, harmful races are exceedingly rare in practice (19 harmful vs. 621 benign). Our results shed a new light on the issues of data race prevalence and importance. To find races, we also propose a novel lightweight run-time symbolic exploration algorithm for finding races in traces of run-time execution. Our algorithm eschews schedule exploration in favor of smaller run-time overheads and thus can be used by beta testers or in crowd-sourced testing. In our experiments on 26 sites, we demonstrate that benign races are considerably more common than harmful ones.",
            "Award": ""
        },
        {
            "Title": "Auto-patching DOM-Based XSS at Scale",
            "Type": "Full Paper",
            "Key": "fse15main-mainid73-p",
            "URL": "http%3A%2F%2Fwww.comp.nus.edu.sg%2F%7Eenricob%2F2015%2Ffse15-main.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.comp.nus.edu.sg%2F%7Eenricob%2Fdexterjs%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786821",
            "PersonsString": "Inian Parameshwaran, Enrico Budianto, Shweta Shinde, Hung Dang, Atul Sadhu, and Prateek Saxena",
            "AffiliationsString": "National University of Singapore, Singapore",
            "Authors": [
                "Inian Parameshwaran @ National University of Singapore, Singapore",
                "Enrico Budianto @ National University of Singapore, Singapore",
                "Shweta Shinde @ National University of Singapore, Singapore",
                "Hung Dang @ National University of Singapore, Singapore",
                "Atul Sadhu @ National University of Singapore, Singapore",
                "Prateek Saxena @ National University of Singapore, Singapore"
            ],
            "Affiliations": [
                "National University of Singapore, Singapore",
                "National University of Singapore, Singapore",
                "National University of Singapore, Singapore",
                "National University of Singapore, Singapore",
                "National University of Singapore, Singapore",
                "National University of Singapore, Singapore"
            ],
            "Abstract": "DOM-based cross-site scripting (XSS) is a client-side code injection vulnerability that results from unsafe dynamic code generation in JavaScript applications, and has few known practical defenses. We study dynamic code evaluation practices on nearly a quarter million URLs crawled starting from the the Alexa Top 1000 websites. Of 777,082 cases of dynamic HTML/JS code generation we observe, 13.3% use unsafe string interpolation for dynamic code generation — a well-known dangerous coding practice. To remedy this, we propose a technique to generate secure patches that replace unsafe string interpolation with safer code that utilizes programmatic DOM construction techniques. Our system transparently auto-patches the vulnerable site while incurring only 5.2 − 8.07% overhead. The patching mechanism requires no access to server-side code or modification to browsers, and thus is practical as a turnkey defense.",
            "Award": ""
        },
        {
            "Title": "Efficient and Reasonable Object-Oriented Concurrency",
            "Type": "Full Paper",
            "Key": "fse15main-mainid74-p",
            "URL": "http%3A%2F%2Fse.inf.ethz.ch%2Fpeople%2Fnanz%2Fpublications%2Fwest-nanz-meyer_esecfse15.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786822",
            "PersonsString": "Scott West, Sebastian Nanz, and Bertrand Meyer",
            "AffiliationsString": "Google, Switzerland; ETH Zurich, Switzerland",
            "Authors": [
                "Scott West @ Google, Switzerland",
                "Sebastian Nanz @ ETH Zurich, Switzerland",
                "Bertrand Meyer @ ETH Zurich, Switzerland"
            ],
            "Affiliations": [
                "Google, Switzerland",
                "ETH Zurich, Switzerland",
                "ETH Zurich, Switzerland"
            ],
            "Abstract": "Making threaded programs safe and easy to reason about is one of the chief difficulties in modern programming. This work provides an efficient execution model for SCOOP, a concurrency approach that provides not only data-race freedom but also pre/postcondition reasoning guarantees between threads. The extensions we propose influence both the underlying semantics to increase the amount of concurrent execution that is possible, exclude certain classes of deadlocks, and enable greater performance. These extensions are used as the basis of an efficient runtime and optimization pass that improve performance 15x over a baseline implementation. This new implementation of SCOOP is, on average, also 2x faster than other well-known safe concurrent languages. The measurements are based on both coordination-intensive and data-manipulation-intensive benchmarks designed to offer a mixture of workloads.",
            "Award": ""
        },
        {
            "Title": "Efficient Dependency Detection for Safe Java Test Acceleration",
            "Type": "Full Paper",
            "Key": "fse15main-mainid75-p",
            "URL": "http%3A%2F%2Fjonbell.net%2Fpublications%2Felectrictest",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786823",
            "PersonsString": "Jonathan Bell, Gail Kaiser, Eric Melski, and Mohan Dattatreya",
            "AffiliationsString": "Columbia University, USA; Electric Cloud, USA",
            "Authors": [
                "Jonathan Bell @ Columbia University, USA",
                "Gail Kaiser @ Columbia University, USA",
                "Eric Melski @ Electric Cloud, USA",
                "Mohan Dattatreya @ Electric Cloud, USA"
            ],
            "Affiliations": [
                "Columbia University, USA",
                "Columbia University, USA",
                "Electric Cloud, USA",
                "Electric Cloud, USA"
            ],
            "Abstract": "Slow builds remain a plague for software developers. The frequency with which code can be built (compiled, tested and packaged) directly impacts the productivity of developers: longer build times mean a longer wait before determining if a change to the application being built was successful. We have discovered that in the case of some languages, such as Java, the majority of build time is spent running tests, where dependencies between individual tests are complicated to discover, making many existing test acceleration techniques unsound to deploy in practice. Without knowledge of which tests are dependent on others, we cannot safely parallelize the execution of the tests, nor can we perform incremental testing (i.e., execute only a subset of an application&#039;s tests for each build). The previous techniques for detecting these dependencies did not scale to large test suites: given a test suite that normally ran in two hours, the best-case running scenario for the previous tool would have taken over 422 CPU days to find dependencies between all test methods (and would not soundly find all dependencies) — on the same project the exhaustive technique (to find all dependencies) would have taken over 1e300 years. We present a novel approach to detecting all dependencies between test cases in large projects that can enable safe exploitation of parallelism and test selection with a modest analysis cost.",
            "Award": ""
        },
        {
            "Title": "GR(1) Synthesis for LTL Specification Patterns",
            "Type": "Full Paper",
            "Key": "fse15main-mainid76-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DShahar+Maoz+and+Jan+Oliver+Ringert+%22GR%281%29+Synthesis+for+LTL+Specification+Patterns%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786824",
            "PersonsString": "Shahar Maoz and Jan Oliver Ringert",
            "AffiliationsString": "Tel Aviv University, Israel",
            "Authors": [
                "Shahar Maoz @ Tel Aviv University, Israel",
                "Jan Oliver Ringert @ Tel Aviv University, Israel"
            ],
            "Affiliations": [
                "Tel Aviv University, Israel",
                "Tel Aviv University, Israel"
            ],
            "Abstract": "Reactive synthesis is an automated procedure to obtain a correct-by-construction reactive system from its temporal logic specification. Two of the main challenges in bringing reactive synthesis to software engineering practice are its very high worst-case complexity -- for linear temporal logic (LTL) it is double exponential in the length of the formula, and the difficulty of writing declarative specifications using basic LTL operators. To address the first challenge, Piterman et al. have suggested the General Reactivity of Rank 1 (GR(1)) fragment of LTL, which has an efficient polynomial time symbolic synthesis algorithm. To address the second challenge, Dwyer et al. have identified 55 LTL specification patterns, which are common in industrial specifications and make writing specifications easier. In this work we show that almost all of the 55 LTL specification patterns identified by Dwyer et al. can be expressed as assumptions and guarantees in the GR(1) fragment of LTL. Specifically, we present an automated, sound and complete translation of the patterns to the GR(1) form, which effectively results in an efficient reactive synthesis procedure for any specification that is written using the patterns. We have validated the correctness of the catalog of GR(1) templates we have created. The work is implemented in our reactive synthesis environment. It provides positive, promising evidence, for the potential feasibility of using reactive synthesis in practice.",
            "Award": ""
        },
        {
            "Title": "Is the Cure Worse Than the Disease? Overfitting in Automated Program Repair",
            "Type": "Full Paper",
            "Key": "fse15main-mainid82-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DEdward+K.+Smith%2C+Earl+T.+Barr%2C+Claire+Le+Goues%2C+and+Yuriy+Brun+%22Is+the+Cure+Worse+Than+the+Disease%3F+Overfitting+in+Automated+Program+Repair%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786825",
            "PersonsString": "Edward K. Smith, Earl T. Barr, Claire Le Goues, and Yuriy Brun",
            "AffiliationsString": "University of Massachusetts at Amherst, USA; University College London, UK; Carnegie Mellon University, USA; University of Massachusetts, USA",
            "Authors": [
                "Edward K. Smith @ University of Massachusetts at Amherst, USA",
                "Earl T. Barr @ University College London, UK",
                "Claire Le Goues @ Carnegie Mellon University, USA",
                "Yuriy Brun @ University of Massachusetts, USA"
            ],
            "Affiliations": [
                "University of Massachusetts at Amherst, USA",
                "University College London, UK",
                "Carnegie Mellon University, USA",
                "University of Massachusetts, USA"
            ],
            "Abstract": "Automated program repair has shown promise for reducing the significant manual effort debugging requires. This paper addresses a deficit of earlier evaluations of automated repair techniques caused by repairing programs and evaluating generated patches&#039; correctness using the same set of tests. Since tests are an imperfect metric of program correctness, evaluations of this type do not discriminate between correct patches and patches that overfit the available tests and break untested but desired functionality. This paper evaluates two well-studied repair tools, GenProg and TrpAutoRepair, on a publicly available benchmark of bugs, each with a human-written patch. By evaluating patches using tests independent from those used during repair, we find that the tools are unlikely to improve the proportion of independent tests passed, and that the quality of the patches is proportional to the coverage of the test suite used during repair. For programs that pass most tests, the tools are as likely to break tests as to fix them. However, novice developers also overfit, and automated repair performs no worse than these developers. In addition to overfitting, we measure the effects of test suite coverage, test suite provenance, and starting program quality, as well as the difference in quality between novice-developer-written and tool-generated patches when quality is assessed with a test suite independent from the one used for patch generation.",
            "Award": ""
        },
        {
            "Title": "The Making of Cloud Applications: An Empirical Study on Software Development for the Cloud",
            "Type": "Full Paper",
            "Key": "fse15main-mainid84-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJ%C3%BCrgen+Cito%2C+Philipp+Leitner%2C+Thomas+Fritz%2C+and+Harald+C.+Gall+%22The+Making+of+Cloud+Applications%3A+An+Empirical+Study+on+Software+Development+for+the+Cloud%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786826",
            "PersonsString": "Jürgen Cito, Philipp Leitner, Thomas Fritz, and Harald C. Gall",
            "AffiliationsString": "University of Zurich, Switzerland",
            "Authors": [
                "Jürgen Cito @ University of Zurich, Switzerland",
                "Philipp Leitner @ University of Zurich, Switzerland",
                "Thomas Fritz @ University of Zurich, Switzerland",
                "Harald C. Gall @ University of Zurich, Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "Cloud computing is gaining more and more traction as a deployment and provisioning model for software. While a large body of research already covers how to optimally operate a cloud system, we still lack insights into how professional software engineers actually use clouds, and how the cloud impacts development practices. This paper reports on the first systematic study on how software developers build applications for the cloud. We conducted a mixed-method study, consisting of qualitative interviews of 25 professional developers and a quantitative survey with 294 responses. Our results show that adopting the cloud has a profound impact throughout the software development process, as well as on how developers utilize tools and data in their daily work. Among other things, we found that (1) developers need better means to anticipate runtime problems and rigorously define metrics for improved fault localization and (2) the cloud offers an abundance of operational data, however, developers still often rely on their experience and intuition rather than utilizing metrics. From our findings, we extracted a set of guidelines for cloud development and identified challenges for researchers and tool vendors.",
            "Award": ""
        },
        {
            "Title": "Summarizing and Measuring Development Activity",
            "Type": "Full Paper",
            "Key": "fse15main-mainid88-p",
            "URL": "https%3A%2F%2Fctreude.files.wordpress.com%2F2015%2F07%2Fdevelopmentactivity.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fctreude.ca%2F2015%2F07%2F15%2Fdevelopment-activity%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786827",
            "PersonsString": "Christoph Treude, Fernando Figueira Filho, and Uirá Kulesza",
            "AffiliationsString": "Federal University of Rio Grande do Norte, Brazil",
            "Authors": [
                "Christoph Treude @ Federal University of Rio Grande do Norte, Brazil",
                "Fernando Figueira Filho @ Federal University of Rio Grande do Norte, Brazil",
                "Uirá Kulesza @ Federal University of Rio Grande do Norte, Brazil"
            ],
            "Affiliations": [
                "Federal University of Rio Grande do Norte, Brazil",
                "Federal University of Rio Grande do Norte, Brazil",
                "Federal University of Rio Grande do Norte, Brazil"
            ],
            "Abstract": "Software developers pursue a wide range of activities as part of their work, and making sense of what they did in a given time frame is far from trivial as evidenced by the large number of awareness and coordination tools that have been developed in recent years. To inform tool design for making sense of the information available about a developer&#039;s activity, we conducted an empirical study with 156 GitHub users to investigate what information they would expect in a summary of development activity, how they would measure development activity, and what factors influence how such activity can be condensed into textual summaries or numbers. We found that unexpected events are as important as expected events in summaries of what a developer did, and that many developers do not believe in measuring development activity. Among the factors that influence summarization and measurement of development activity, we identified development experience and programming languages.",
            "Award": ""
        },
        {
            "Title": "Generating TCP/UDP Network Data for Automated Unit Test Generation",
            "Type": "Full Paper",
            "Key": "fse15main-mainid91-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAndrea+Arcuri%2C+Gordon+Fraser%2C+and+Juan+Pablo+Galeotti+%22Generating+TCP%2FUDP+Network+Data+for+Automated+Unit+Test+Generation%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786828",
            "PersonsString": "Andrea Arcuri, Gordon Fraser, and Juan Pablo Galeotti",
            "AffiliationsString": "Scienta, Norway; University of Luxembourg, Luxembourg; University of Sheffield, UK; Saarland University, Germany",
            "Authors": [
                "Andrea Arcuri @ Scienta, Norway / University of Luxembourg, Luxembourg",
                "Gordon Fraser @ University of Sheffield, UK",
                "Juan Pablo Galeotti @ Saarland University, Germany"
            ],
            "Affiliations": [
                "Scienta, Norway / University of Luxembourg, Luxembourg",
                "University of Sheffield, UK",
                "Saarland University, Germany"
            ],
            "Abstract": "Although automated unit test generation techniques can in principle generate test suites that achieve high code coverage, in practice this is often inhibited by the dependence of the code under test on external resources. In particular, a common problem in modern programming languages is posed by code that involves networking (e.g., opening a TCP listening port). In order to generate tests for such code, we describe an approach where we mock (simulate) the networking interfaces of the Java standard library, such that a search-based test generator can treat the network as part of the test input space. This not only has the benefit that it overcomes many limitations of testing networking code (e.g., different tests binding to the same local ports, and deterministic resolution of hostnames and ephemeral ports), it also substantially increases code coverage. An evaluation on 23,886 classes from 110 open source projects, totalling more than 6.6 million lines of Java code, reveals that network access happens in 2,642 classes (11%). Our implementation of the proposed technique as part of the EVOSUITE testing tool addresses the networking code contained in 1,672 (63%) of these classes, and leads to an increase of the average line coverage from 29.1% to 50.8%. On a manual selection of 42 Java classes heavily depending on networking, line coverage with EVOSUITE more than doubled with the use of network mocking, increasing from 31.8% to 76.6%.",
            "Award": ""
        },
        {
            "Title": "Getting to Know You: Towards a Capability Model for Java",
            "Type": "Full Paper",
            "Key": "fse15main-mainid92-p",
            "URL": "http%3A%2F%2Fwww.thewhitespace.de%2Fpublications%2Fhrem15-capmodel.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.thewhitespace.de%2Fprojects%2Fpeaks%2Fcapmodel.html",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786829",
            "PersonsString": "Ben Hermann, Michael Reif, Michael Eichberg, and Mira Mezini",
            "AffiliationsString": "TU Darmstadt, Germany",
            "Authors": [
                "Ben Hermann @ TU Darmstadt, Germany",
                "Michael Reif @ TU Darmstadt, Germany",
                "Michael Eichberg @ TU Darmstadt, Germany",
                "Mira Mezini @ TU Darmstadt, Germany"
            ],
            "Affiliations": [
                "TU Darmstadt, Germany",
                "TU Darmstadt, Germany",
                "TU Darmstadt, Germany",
                "TU Darmstadt, Germany"
            ],
            "Abstract": "Developing software from reusable libraries lets developers face a security dilemma: Either be efficient and reuse libraries as they are or inspect them, know about their resource usage, but possibly miss deadlines as reviews are a time consuming process. In this paper, we propose a novel capability inference mechanism for libraries written in Java. It uses a coarse-grained capability model for system resources that can be presented to developers. We found that the capability inference agrees by 86.81% on expectations towards capabilities that can be derived from project documentation. Moreover, our approach can find capabilities that cannot be discovered using project documentation. It is thus a helpful tool for developers mitigating the aforementioned dilemma.",
            "Award": ""
        },
        {
            "Title": "MultiSE: Multi-path Symbolic Execution using Value Summaries",
            "Type": "Full Paper",
            "Key": "fse15main-mainid93-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKoushik+Sen%2C+George+Necula%2C+Liang+Gong%2C+and+Wontae+Choi+%22MultiSE%3A+Multi-path+Symbolic+Execution+using+Value+Summaries%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786830",
            "PersonsString": "Koushik Sen, George Necula, Liang Gong, and Wontae Choi",
            "AffiliationsString": "University of California at Berkeley, USA",
            "Authors": [
                "Koushik Sen @ University of California at Berkeley, USA",
                "George Necula @ University of California at Berkeley, USA",
                "Liang Gong @ University of California at Berkeley, USA",
                "Wontae Choi @ University of California at Berkeley, USA"
            ],
            "Affiliations": [
                "University of California at Berkeley, USA",
                "University of California at Berkeley, USA",
                "University of California at Berkeley, USA",
                "University of California at Berkeley, USA"
            ],
            "Abstract": "Dynamic symbolic execution (DSE) has been proposed to effectively generate test inputs for real-world programs. Unfortunately, DSE techniques do not scale well for large realistic programs, because often the number of feasible execution paths of a program increases exponentially with the increase in the length of an execution path. In this paper, we propose MultiSE, a new technique for merging states incrementally during symbolic execution, without using auxiliary variables. The key idea of MultiSE is based on an alternative representation of the state, where we map each variable, including the program counter, to a set of guarded symbolic expressions called a value summary. MultiSE has several advantages over conventional DSE and conventional state merging techniques: value summaries enable sharing of symbolic expressions and path constraints along multiple paths and thus avoid redundant execution. MultiSE does not introduce auxiliary symbolic variables, which enables it to 1) make progress even when merging values not supported by the constraint solver, 2) avoid expensive constraint solver calls when resolving function calls and jumps, and 3) carry out most operations concretely. Moreover, MultiSE updates value summaries incrementally at every assignment instruction, which makes it unnecessary to identify the join points and to keep track of variables to merge at join points. We have implemented MultiSE for JavaScript programs in a publicly available open-source tool. Our evaluation of MultiSE on several programs shows that 1) value summaries are an eective technique to take advantage of the sharing of value along multiple execution path, that 2) MultiSE can run significantly faster than traditional dynamic symbolic execution and, 3) MultiSE saves a substantial number of state merges compared to conventional state-merging techniques.",
            "Award": ""
        },
        {
            "Title": "JITProf: Pinpointing JIT-Unfriendly JavaScript Code",
            "Type": "Full Paper",
            "Key": "fse15main-mainid94-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLiang+Gong%2C+Michael+Pradel%2C+and+Koushik+Sen+%22JITProf%3A+Pinpointing+JIT-Unfriendly+JavaScript+Code%22",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fgithub.com%2FBerkeley-Correctness-Group%2FJITProf",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786831",
            "PersonsString": "Liang Gong, Michael Pradel, and Koushik Sen",
            "AffiliationsString": "University of California at Berkeley, USA; TU Darmstadt, Germany",
            "Authors": [
                "Liang Gong @ University of California at Berkeley, USA",
                "Michael Pradel @ TU Darmstadt, Germany",
                "Koushik Sen @ University of California at Berkeley, USA"
            ],
            "Affiliations": [
                "University of California at Berkeley, USA",
                "TU Darmstadt, Germany",
                "University of California at Berkeley, USA"
            ],
            "Abstract": "Most modern JavaScript engines use just-in-time (JIT) compilation to translate parts of JavaScript code into efficient machine code at runtime. Despite the overall success of JIT compilers, programmers may still write code that uses the dynamic features of JavaScript in a way that prohibits profitable optimizations. Unfortunately, there currently is no way to measure how prevalent such JIT-unfriendly code is and to help developers detect such code locations. This paper presents JITProf, a profiling framework to dynamically identify code locations that prohibit profitable JIT optimizations. The key idea is to associate meta-information with JavaScript objects and code locations, to update this information whenever particular runtime events occur, and to use the meta-information to identify JIT-unfriendly operations. We use JITProf to analyze widely used JavaScript web applications and show that JIT-unfriendly code is prevalent in practice. Furthermore, we show how to use the approach as a profiling technique that finds optimization opportunities in a program. Applying the profiler to popular benchmark programs shows that refactoring these programs to avoid performance problems identified by JITProf leads to statistically significant performance improvements of up to 26.3% in 15 benchmarks.",
            "Award": ""
        },
        {
            "Title": "Iterative Distribution-Aware Sampling for Probabilistic Symbolic Execution",
            "Type": "Full Paper",
            "Key": "fse15main-mainid95-p",
            "URL": "http%3A%2F%2Fwww.antonio.filieri.name%2Fpublications%2Fpreprints%2F2015-fse-qcoral.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.antonio.filieri.name%2Fpublications%2Fpreprints%2F2015-fse-qcoral%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786832",
            "PersonsString": "Mateus Borges, Antonio Filieri, Marcelo D'Amorim, and Corina S. Păsăreanu",
            "AffiliationsString": "Federal University of Pernambuco, Brazil; University of Stuttgart, Germany; Carnegie Mellon University, USA; NASA Ames Research Center, USA",
            "Authors": [
                "Mateus Borges @ Federal University of Pernambuco, Brazil",
                "Antonio Filieri @ University of Stuttgart, Germany",
                "Marcelo D'Amorim @ Federal University of Pernambuco, Brazil",
                "Corina S. Păsăreanu @ Carnegie Mellon University, USA / NASA Ames Research Center, USA"
            ],
            "Affiliations": [
                "Federal University of Pernambuco, Brazil",
                "University of Stuttgart, Germany",
                "Federal University of Pernambuco, Brazil",
                "Carnegie Mellon University, USA / NASA Ames Research Center, USA"
            ],
            "Abstract": "Probabilistic symbolic execution aims at quantifying the probability of reaching program events of interest assuming that program inputs follow given probabilistic distributions. The technique collects constraints on the inputs that lead to the target events and analyzes them to quantify how likely it is for an input to satisfy the constraints. Current techniques either handle only linear constraints or only support continuous distributions using a “discretization” of the input domain, leading to imprecise and costly results. We propose an iterative distribution-aware sampling approach to support probabilistic symbolic execution for arbitrarily complex mathematical constraints and continuous input distributions. We follow a compositional approach, where the symbolic constraints are decomposed into sub-problems whose solution can be solved independently. At each iteration the convergence rate of the com- putation is increased by automatically refocusing the analysis on estimating the sub-problems that mostly affect the accuracy of the results, as guided by three different ranking strategies. Experiments on publicly available benchmarks show that the proposed technique improves on previous approaches in terms of scalability and accuracy of the results.",
            "Award": ""
        },
        {
            "Title": "Automated Multi-objective Control for Self-Adaptive Software Design",
            "Type": "Full Paper",
            "Key": "fse15main-mainid97-p",
            "URL": "http%3A%2F%2Fwww.antonio.filieri.name%2Fpublications%2Fpreprints%2F2015-fse-control.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786833",
            "PersonsString": "Antonio Filieri, Henry Hoffmann, and Martina Maggio",
            "AffiliationsString": "University of Stuttgart, Germany; University of Chicago, USA; Lund University, Sweden",
            "Authors": [
                "Antonio Filieri @ University of Stuttgart, Germany",
                "Henry Hoffmann @ University of Chicago, USA",
                "Martina Maggio @ Lund University, Sweden"
            ],
            "Affiliations": [
                "University of Stuttgart, Germany",
                "University of Chicago, USA",
                "Lund University, Sweden"
            ],
            "Abstract": "While software is becoming more complex everyday, the requirements on its behavior are not getting any easier to satisfy. An application should offer a certain quality of service, adapt to the current environmental conditions and withstand runtime variations that were simply unpredictable during the design phase. To tackle this complexity, control theory has been proposed as a technique for managing software&#039;s dynamic behavior, obviating the need for human intervention. Control-theoretical solutions, however, are either tailored for the specific application or do not handle the complexity of multiple interacting components and multiple goals. In this paper, we develop an automated control synthesis methodology that takes, as input, the configurable software components (or knobs) and the goals to be achieved. Our approach automatically constructs a control system that manages the specified knobs and guarantees the goals are met. These claims are backed up by experimental studies on three different software applications, where we show how the proposed automated approach handles the complexity of multiple knobs and objectives.",
            "Award": ""
        },
        {
            "Title": "An Empirical Study of Goto in C Code from GitHub Repositories",
            "Type": "Full Paper",
            "Key": "fse15main-mainid104-p",
            "URL": "http%3A%2F%2Fmei-nagappan.com%2Fpublications%2Fpublications%2FFSE2015-Nagappan.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786834",
            "PersonsString": "Meiyappan Nagappan, Romain Robbes, Yasutaka Kamei, Éric Tanter, Shane McIntosh, Audris Mockus, and Ahmed E. Hassan",
            "AffiliationsString": "Rochester Institute of Technology, USA; University of Chile, Chile; Kyushu University, Japan; McGill University, Canada; University of Tennessee, USA; Queen's University, Canada",
            "Authors": [
                "Meiyappan Nagappan @ Rochester Institute of Technology, USA",
                "Romain Robbes @ University of Chile, Chile",
                "Yasutaka Kamei @ Kyushu University, Japan",
                "Éric Tanter @ University of Chile, Chile",
                "Shane McIntosh @ McGill University, Canada",
                "Audris Mockus @ University of Tennessee, USA",
                "Ahmed E. Hassan @ Queen's University, Canada"
            ],
            "Affiliations": [
                "Rochester Institute of Technology, USA",
                "University of Chile, Chile",
                "Kyushu University, Japan",
                "University of Chile, Chile",
                "McGill University, Canada",
                "University of Tennessee, USA",
                "Queen's University, Canada"
            ],
            "Abstract": "It is nearly 50 years since Dijkstra argued that goto obscures the flow of control in program execution and urged programmers to abandon the goto statement. While past research has shown that goto is still in use, little is known about whether goto is used in the unrestricted manner that Dijkstra feared, and if it is ‘harmful’ enough to be a part of a post-release bug. We, therefore, conduct a two part empirical study - (1) qualitatively analyze a statistically rep- resentative sample of 384 files from a population of almost 250K C programming language files collected from over 11K GitHub repositories and find that developers use goto in C files for error handling (80.21±5%) and cleaning up resources at the end of a procedure (40.36 ± 5%); and (2) quantitatively analyze the commit history from the release branches of six OSS projects and find that no goto statement was re- moved/modified in the post-release phase of four of the six projects. We conclude that developers limit themselves to using goto appropriately in most cases, and not in an unrestricted manner like Dijkstra feared, thus suggesting that goto does not appear to be harmful in practice.",
            "Award": ""
        },
        {
            "Title": "Guided Differential Testing of Certificate Validation in SSL/TLS Implementations",
            "Type": "Full Paper",
            "Key": "fse15main-mainid108-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYuting+Chen+and+Zhendong+Su+%22Guided+Differential+Testing+of+Certificate+Validation+in+SSL%2FTLS+Implementations%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fstap.sjtu.edu.cn%2F%7Echenyt%2Fmucert.html",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786835",
            "PersonsString": "Yuting Chen and Zhendong Su",
            "AffiliationsString": "Shanghai Jiao Tong University, China; University of California at Davis, USA",
            "Authors": [
                "Yuting Chen @ Shanghai Jiao Tong University, China",
                "Zhendong Su @ University of California at Davis, USA"
            ],
            "Affiliations": [
                "Shanghai Jiao Tong University, China",
                "University of California at Davis, USA"
            ],
            "Abstract": "Certificate validation in SSL/TLS implementations is critical for Internet security. There is recent strong effort, namely frankencert, in automatically synthesizing certificates for stress-testing certificate validation. Despite its early promise, it remains a significant challenge to generate effective test certificates as they are structurally complex with intricate syntactic and semantic constraints. This paper tackles this challenge by introducing mucert, a novel, guided technique to much more effectively test real-world certificate validation code. Our core insight is to (1) leverage easily accessible Internet certificates as seed certificates, and (2) diversify them by adapting Markov Chain Monte Carlo (MCMC) sampling. The diversified certificates are then used to reveal discrepancies, thus potential flaws, among different certificate validation implementations. We have implemented mucert and extensively evaluated it against frankencert. Our experimental results show that mucert is significantly more cost-effective than frankencert. Indeed, 1K mucerts (i.e., mucert-mutated certificates) yield three times as many distinct discrepancies as 8M frankencerts (i.e., frankencert-synthesized certificates), and 200 mucerts can achieve higher code coverage than 100,000 frankencerts. This improvement is significant as it incurs much cost to test each generated certificate. We have analyzed and reported 20+ latent discrepancies (presumably missed by frankencert), and reported an additional 357 discrepancy-triggering certificates to SSL/TLS developers, who have already confirmed some of our reported issues and are investigating causes of all the reported discrepancies. In particular, our reports have led to bug fixes, active discussions in the community, and proposed changes to relevant IETF’s RFCs. We believe that mucert is practical and effective for helping improve the robustness of SSL/TLS implementations.",
            "Award": ""
        },
        {
            "Title": "Detecting Event Anomalies in Event-Based Systems",
            "Type": "Full Paper",
            "Key": "fse15main-mainid122-p",
            "URL": "http%3A%2F%2Fwww-scf.usc.edu%2F%7Egsafi%2FFSE2015Replication%2FSafiFinalCamReadyv3.pdf",
            "URLvideo": "http%3A%2F%2Fwww-scf.usc.edu%2F%7Egsafi%2FFSE2015Replication%2FVideo.html",
            "URLinfo": "http%3A%2F%2Fwww-scf.usc.edu%2F%7Egsafi%2FFSE2015Replication",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786836",
            "PersonsString": "Gholamreza Safi, Arman Shahbazian, William G. J. Halfond, and Nenad Medvidovic",
            "AffiliationsString": "University of Southern California, USA",
            "Authors": [
                "Gholamreza Safi @ University of Southern California, USA",
                "Arman Shahbazian @ University of Southern California, USA",
                "William G. J. Halfond @ University of Southern California, USA",
                "Nenad Medvidovic @ University of Southern California, USA"
            ],
            "Affiliations": [
                "University of Southern California, USA",
                "University of Southern California, USA",
                "University of Southern California, USA",
                "University of Southern California, USA"
            ],
            "Abstract": "Event-based interaction is an attractive paradigm because its use can lead to highly flexible and adaptable systems. One problem in this paradigm is that events are sent, received, and processed nondeterministically, due to the systems’ reliance on implicit invocation and implicit concurrency. This nondeterminism can lead to event anomalies, which occur when an event-based system receives multiple events that lead to the write of a shared field or memory location. Event anomalies can lead to unreliable, error-prone, and hard to debug behavior in an event-based system. To detect these anomalies, this paper presents a new static analysis technique, DEvA, for automatically detecting event anomalies. DEvA has been evaluated on a set of open-source event-based systems against a state-of-the-art technique for detecting data races in multithreaded systems, and a recent technique for solving a similar problem with event processing in Android applications. DEvA exhibited high precision with respect to manually constructed ground truths, and was able to locate event anomalies that had not been detected by the existing solutions.",
            "Award": ""
        },
        {
            "Title": "Improving Model-Based Test Generation by Model Decomposition",
            "Type": "Full Paper",
            "Key": "fse15main-mainid123-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPaolo+Arcaini%2C+Angelo+Gargantini%2C+and+Elvinia+Riccobene+%22Improving+Model-Based+Test+Generation+by+Model+Decomposition%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786837",
            "PersonsString": "Paolo Arcaini, Angelo Gargantini, and Elvinia Riccobene",
            "AffiliationsString": "Charles University in Prague, Czech Republic; University of Bergamo, Italy; University of Milan, Italy",
            "Authors": [
                "Paolo Arcaini @ Charles University in Prague, Czech Republic",
                "Angelo Gargantini @ University of Bergamo, Italy",
                "Elvinia Riccobene @ University of Milan, Italy"
            ],
            "Affiliations": [
                "Charles University in Prague, Czech Republic",
                "University of Bergamo, Italy",
                "University of Milan, Italy"
            ],
            "Abstract": "One of the well-known techniques for model-based test generation exploits the capability of model checkers to return counterexamples upon property violations. However, this approach is not always optimal in practice due to the required time and memory, or even not feasible due to the state explosion problem of model checking. A way to mitigate these limitations consists in decomposing a system model into suitable subsystem models separately analyzable. In this paper, we show a technique to decompose a system model into subsystems by exploiting the model variables dependency, and then we propose a test generation approach which builds tests for the single subsystems and combines them later in order to obtain tests for the system as a whole. Such approach mitigates the exponential increase of the test generation time and memory consumption, and, compared with the same model-based test generation technique applied to the whole system, shows to be more efficient. We prove that, although not complete, the approach is sound.",
            "Award": ""
        },
        {
            "Title": "Modeling Readability to Improve Unit Tests",
            "Type": "Full Paper",
            "Key": "fse15main-mainid128-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DErmira+Daka%2C+Jos%C3%A9+Campos%2C+Gordon+Fraser%2C+Jonathan+Dorn%2C+and+Westley+Weimer+%22Modeling+Readability+to+Improve+Unit+Tests%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786838",
            "PersonsString": "Ermira Daka, José Campos, Gordon Fraser, Jonathan Dorn, and Westley Weimer",
            "AffiliationsString": "University of Sheffield, UK; University of Virginia, USA",
            "Authors": [
                "Ermira Daka @ University of Sheffield, UK",
                "José Campos @ University of Sheffield, UK",
                "Gordon Fraser @ University of Sheffield, UK",
                "Jonathan Dorn @ University of Virginia, USA",
                "Westley Weimer @ University of Virginia, USA"
            ],
            "Affiliations": [
                "University of Sheffield, UK",
                "University of Sheffield, UK",
                "University of Sheffield, UK",
                "University of Virginia, USA",
                "University of Virginia, USA"
            ],
            "Abstract": "Writing good unit tests can be tedious and error prone, but even once they are written, the job is not done: Developers need to reason about unit tests throughout software development and evolution, in order to diagnose test failures, maintain the tests, and to understand code written by other developers. Unreadable tests are more difficult to maintain and lose some of their value to developers. To overcome this problem, we propose a domain-specific model of unit test readability based on human judgements, and use this model to augment automated unit test generation. The resulting approach can automatically generate test suites with both high coverage and also improved readability. In human studies users prefer our improved tests and are able to answer maintenance questions about them 14% more quickly at the same level of accuracy.",
            "Award": ""
        },
        {
            "Title": "Effective and Precise Dynamic Detection of Hidden Races for Java Programs",
            "Type": "Full Paper",
            "Key": "fse15main-mainid129-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYan+Cai+and+Lingwei+Cao+%22Effective+and+Precise+Dynamic+Detection+of+Hidden+Races+for+Java+Programs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786839",
            "PersonsString": "Yan Cai and Lingwei Cao",
            "AffiliationsString": "Institute of Software at Chinese Academy of Sciences, China",
            "Authors": [
                "Yan Cai @ Institute of Software at Chinese Academy of Sciences, China",
                "Lingwei Cao @ Institute of Software at Chinese Academy of Sciences, China"
            ],
            "Affiliations": [
                "Institute of Software at Chinese Academy of Sciences, China",
                "Institute of Software at Chinese Academy of Sciences, China"
            ],
            "Abstract": "Happens-before relation is widely used to detect data races dynami-cally. However, it could easily hide many data races as it is inter-leaving sensitive. Existing techniques based on randomized sched-uling are ineffective on detecting these hidden races. In this paper, we propose DrFinder, an effective and precise dynamic technique to detect hidden races. Given an execution, DrFinder firstly analyz-es the lock acquisitions in it and collects a set of &quot;may-trigger&quot; relations. Each may-trigger relation consists of a method and a type of a Java object. It indicates that, during execution, the method may directly or indirectly acquire a lock of the type. In the subsequent executions of the same program, DrFinder actively schedules the execution according to the set of collected may-trigger relations. It aims to reverse the set of happens-before relation that may exist in the previous executions so as to expose those hidden races. To effectively detect hidden races in each execution, DrFinder also collects a new set of may-trigger relation during its scheduling, which is used in its next scheduling. Our experiment on a suite of real-world Java multithreaded programs shows that DrFinder is effective to detect 89 new data races in 10 runs. Many of these races could not be detected by existing techniques (i.e., FastTrack, ConTest, and PCT) even in 100 runs.",
            "Award": ""
        },
        {
            "Title": "Finding Schedule-Sensitive Branches",
            "Type": "Full Paper",
            "Key": "fse15main-mainid138-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJeff+Huang+and+Lawrence+Rauchwerger+%22Finding+Schedule-Sensitive+Branches%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786840",
            "PersonsString": "Jeff Huang and Lawrence Rauchwerger",
            "AffiliationsString": "Texas A&M University, USA",
            "Authors": [
                "Jeff Huang @ Texas A&M University, USA",
                "Lawrence Rauchwerger @ Texas A&M University, USA"
            ],
            "Affiliations": [
                "Texas A&M University, USA",
                "Texas A&M University, USA"
            ],
            "Abstract": "This paper presents an automated, precise technique, TAME, for identifying schedule-sensitive branches (SSBs) in concurrent programs, i.e., branches whose decision may vary depending on the actual scheduling of concurrent threads. The technique consists of 1) tracing events at fine-grained level; 2) deriving the constraints for each branch; and 3) invoking an SMT solver to find possible SSB, by trying to solve the negated branch condition. To handle the infeasibly huge number of computations that would be generated by the fine-grained tracing, TAME leverages concolic execution and implements several sound approximations to delimit the number of traces to analyse, yet without sacrificing precision. In addition, TAME implements a novel distributed trace partition approach distributing the analysis into smaller chunks. Evaluation on both popular benchmarks and real applications shows that TAME is effective in finding SSBs and has good scalability. TAME found a total of 34 SSBs, among which 17 are related to concurrency errors, and 9 are ad hoc synchronizations.",
            "Award": ""
        },
        {
            "Title": "Assertion Guided Symbolic Execution of Multithreaded Programs",
            "Type": "Full Paper",
            "Key": "fse15main-mainid163-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DShengjian+Guo%2C+Markus+Kusano%2C+Chao+Wang%2C+Zijiang+Yang%2C+and+Aarti+Gupta+%22Assertion+Guided+Symbolic+Execution+of+Multithreaded+Programs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786841",
            "PersonsString": "Shengjian Guo, Markus Kusano, Chao Wang, Zijiang Yang, and Aarti Gupta",
            "AffiliationsString": "Virginia Tech, USA; Western Michigan University, USA; Princeton University, USA",
            "Authors": [
                "Shengjian Guo @ Virginia Tech, USA",
                "Markus Kusano @ Virginia Tech, USA",
                "Chao Wang @ Virginia Tech, USA",
                "Zijiang Yang @ Western Michigan University, USA",
                "Aarti Gupta @ Princeton University, USA"
            ],
            "Affiliations": [
                "Virginia Tech, USA",
                "Virginia Tech, USA",
                "Virginia Tech, USA",
                "Western Michigan University, USA",
                "Princeton University, USA"
            ],
            "Abstract": "Symbolic execution is a powerful technique for systematic testing of sequential and multithreaded programs. However, its application is limited by the high cost of covering all feasible intra-thread paths and inter-thread interleavings. We propose a new assertion guided pruning framework that identifies executions guaranteed not to lead to an error and removes them during symbolic execution. By summarizing the reasons why previously explored executions cannot reach an error and using the information to prune redundant executions in the future, we can soundly reduce the search space. We also use static concurrent program slicing and heuristic minimization of symbolic constraints to further reduce the computational overhead. We have implemented our method in the Cloud9 symbolic execution tool and evaluated it on a large set of multithreaded C/C++ programs. Our experiments show that the new method can reduce the overall computational cost significantly.",
            "Award": ""
        },
        {
            "Title": "Symbolic Execution of Programs with Heap Inputs",
            "Type": "Full Paper",
            "Key": "fse15main-mainid165-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPietro+Braione%2C+Giovanni+Denaro%2C+and+Mauro+Pezz%C3%A8+%22Symbolic+Execution+of+Programs+with+Heap+Inputs%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786842",
            "PersonsString": "Pietro Braione, Giovanni Denaro, and Mauro Pezzè",
            "AffiliationsString": "University of Milano-Bicocca, Italy",
            "Authors": [
                "Pietro Braione @ University of Milano-Bicocca, Italy",
                "Giovanni Denaro @ University of Milano-Bicocca, Italy",
                "Mauro Pezzè @ University of Milano-Bicocca, Italy"
            ],
            "Affiliations": [
                "University of Milano-Bicocca, Italy",
                "University of Milano-Bicocca, Italy",
                "University of Milano-Bicocca, Italy"
            ],
            "Abstract": "Symbolic analysis is a core component of many automatic test generation and program verication approaches. To verify complex software systems, test and analysis techniques shall deal with the many aspects of the target systems at different granularity levels. In particular, testing software programs that make extensive use of heap data structures at unit and integration levels requires generating suitable input data structures in the heap. This is a main challenge for symbolic testing and analysis techniques that work well when dealing with numeric inputs, but do not satisfactorily cope with heap data structures yet. In this paper we propose a language HEX to specify invariants of partially initialized data structures, and a decision procedure that supports the incremental evaluation of structural properties in HEX. Used in combination with the symbolic execution of heap manipulating programs, HEX prevents the exploration of invalid states, thus improving the eefficiency of program testing and analysis, and avoiding false alarms that negatively impact on verication activities. The experimental data conrm that HEX is an effective and efficient solution to the problem of testing and analyzing heap manipulating programs, and outperforms the alternative approaches that have been proposed so far.",
            "Award": ""
        },
        {
            "Title": "When, How, and Why Developers (Do Not) Test in Their IDEs",
            "Type": "Full Paper",
            "Key": "fse15main-mainid167-p",
            "URL": "http%3A%2F%2Fwww.st.ewi.tudelft.nl%2F%7Embeller%2Fpublications%2F2015_beller_gousios_panichella_zaidman_when_how_and_why_developers_do_not_test_in_their_ides.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786843",
            "PersonsString": "Moritz Beller, Georgios Gousios, Annibale Panichella, and Andy Zaidman",
            "AffiliationsString": "Delft University of Technology, Netherlands; Radboud University Nijmegen, Netherlands",
            "Authors": [
                "Moritz Beller @ Delft University of Technology, Netherlands",
                "Georgios Gousios @ Radboud University Nijmegen, Netherlands",
                "Annibale Panichella @ Delft University of Technology, Netherlands",
                "Andy Zaidman @ Delft University of Technology, Netherlands"
            ],
            "Affiliations": [
                "Delft University of Technology, Netherlands",
                "Radboud University Nijmegen, Netherlands",
                "Delft University of Technology, Netherlands",
                "Delft University of Technology, Netherlands"
            ],
            "Abstract": "The research community in Software Engineering and Software Testing in particular builds many of its contributions on a set of mutually shared expectations. Despite the fact that they form the basis of many publications as well as open-source and commercial testing applications, these common expectations and beliefs are rarely ever questioned. For example, Frederic Brooks’ statement that testing takes half of the development time seems to have manifested itself within the community since he first made it in the “Mythical Man Month” in 1975. With this paper, we report on the surprising results of a large-scale field study with 416 software engineers whose development activity we closely monitored over the course of five months, resulting in over 13 years of recorded work time in their integrated development environments (IDEs). Our findings question several commonly shared assumptions and beliefs about testing and might be contributing factors to the observed bug proneness of software in practice: the majority of developers in our study does not test; developers rarely run their tests in the IDE; Test-Driven Development (TDD) is not widely practiced; and, last but not least, software developers only spend a quarter of their work time engineering tests, whereas they think they test half of their time.",
            "Award": ""
        },
        {
            "Title": "Turning Programs against Each Other: High Coverage Fuzz-Testing using Binary-Code Mutation and Dynamic Slicing",
            "Type": "Full Paper",
            "Key": "fse15main-mainid174-p",
            "URL": "http%3A%2F%2Fwww.ida.liu.se%2F%7Eulfka17%2Fpapers%2FFSE2015.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786844",
            "PersonsString": "Ulf Kargén and Nahid Shahmehri",
            "AffiliationsString": "Linköping University, Sweden",
            "Authors": [
                "Ulf Kargén @ Linköping University, Sweden",
                "Nahid Shahmehri @ Linköping University, Sweden"
            ],
            "Affiliations": [
                "Linköping University, Sweden",
                "Linköping University, Sweden"
            ],
            "Abstract": "Mutation-based fuzzing is a popular and widely employed black-box testing technique for finding security and robustness bugs in software. It owes much of its success to its simplicity; a well-formed seed input is mutated, e.g. through random bit-flipping, to produce test inputs. While reducing the need for human effort, and enabling security testing even of closed-source programs with undocumented input formats, the simplicity of mutation-based fuzzing comes at the cost of poor code coverage. Often millions of iterations are needed, and the results are highly dependent on configuration parameters and the choice of seed inputs. In this paper we propose a novel method for automated generation of high-coverage test cases for robustness testing. Our method is based on the observation that, even for closed-source programs with proprietary input formats, an implementation that can generate well-formed inputs to the program is typically available. By systematically mutating the program code of such generating programs, we leverage information about the input format encoded in the generating program to produce high-coverage test inputs, capable of reaching deep states in the program under test. Our method works entirely at the machine-code level, enabling use-cases similar to traditional black-box fuzzing. We have implemented the method in our tool MutaGen, and evaluated it on 7 popular Linux programs. We found that, for most programs, our method improves code coverage by one order of magnitude or more, compared to two well-known mutation-based fuzzers. We also found a total of 8 unique bugs.",
            "Award": ""
        },
        {
            "Title": "Performance-Influence Models for Highly Configurable Systems",
            "Type": "Full Paper",
            "Key": "fse15main-mainid179-p",
            "URL": "http%3A%2F%2Fwww.infosun.fim.uni-passau.de%2Fcl%2Fpublications%2Fdocs%2FSGA%2B15.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.infosun.fim.uni-passau.de%2Fspl%2Fprojects%2Fsplconqueror%2Fesecfse2015.php",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786845",
            "PersonsString": "Norbert Siegmund, Alexander Grebhahn, Sven Apel, and Christian Kästner",
            "AffiliationsString": "University of Passau, Germany; Carnegie Mellon University, USA",
            "Authors": [
                "Norbert Siegmund @ University of Passau, Germany",
                "Alexander Grebhahn @ University of Passau, Germany",
                "Sven Apel @ University of Passau, Germany",
                "Christian Kästner @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "University of Passau, Germany",
                "University of Passau, Germany",
                "University of Passau, Germany",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Almost every complex software system today is configurable. While configurability has many benefits, it challenges performance prediction, optimization, and debugging. Often, the influences of individual configuration options on performance are unknown. Worse, configuration options may interact, giving rise to a configuration space of possibly exponential size. Addressing this challenge, we propose an approach that derives a performance-influence model for a given configurable system, describing all relevant influences of configuration options and their interactions. Our approach combines machine-learning and sampling heuristics in a novel way. It improves over standard techniques in that it (1) represents influences of options and their interactions explicitly (which eases debugging), (2) smoothly integrates binary and numeric configuration options for the first time, (3) incorporates domain knowledge, if available (which eases learning and increases accuracy), (4) considers complex constraints among options, and (5) systematically reduces the solution space to a tractable size. A series of experiments demonstrates the feasibility of our approach in terms of the accuracy of the models learned as well as the accuracy of the performance predictions one can make with them.",
            "Award": ""
        },
        {
            "Title": "On the Use of Delta Debugging to Reduce Recordings and Facilitate Debugging of Web Applications",
            "Type": "Full Paper",
            "Key": "fse15main-mainid190-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMouna+Hammoudi%2C+Brian+Burg%2C+Gigon+Bae%2C+and+Gregg+Rothermel+%22On+the+Use+of+Delta+Debugging+to+Reduce+Recordings+and+Facilitate+Debugging+of+Web+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786846",
            "PersonsString": "Mouna Hammoudi, Brian Burg, Gigon Bae, and Gregg Rothermel",
            "AffiliationsString": "University of Nebraska-Lincoln, USA; University of Washington, USA",
            "Authors": [
                "Mouna Hammoudi @ University of Nebraska-Lincoln, USA",
                "Brian Burg @ University of Washington, USA",
                "Gigon Bae @ University of Nebraska-Lincoln, USA",
                "Gregg Rothermel @ University of Nebraska-Lincoln, USA"
            ],
            "Affiliations": [
                "University of Nebraska-Lincoln, USA",
                "University of Washington, USA",
                "University of Nebraska-Lincoln, USA",
                "University of Nebraska-Lincoln, USA"
            ],
            "Abstract": "Recording the sequence of events that lead to a failure of a web application can be an effective aid for debugging. Nevertheless, a recording of an event sequence may include many events that are not related to a failure, and this may render debugging more difficult. To address this problem, we have adapted Delta Debugging to function on recordings of web applications, in a manner that lets it identify and discard portions of those recordings that do not influence the occurrence of a failure. The resulting recording reduction technique enables developers to locate and correct faults based on reduced recordings, potentially reducing the amount of time and effort required to locate faults. We present the results of three empirical studies that show that (1) recording reduction can achieve significant reductions in recording size and replay time on actual web applications obtained from developer forums, (2) reduced recordings do in fact help programmers locate faults significantly more efficiently as, and no less effectively than non-reduced recordings, and (3) recording reduction produces even greater reductions on larger, more complex applications.",
            "Award": ""
        },
        {
            "Title": "Optimizing Energy Consumption of GUIs in Android Apps: A Multi-objective Approach",
            "Type": "Full Paper",
            "Key": "fse15main-mainid194-p",
            "URL": "http%3A%2F%2Fwww.cs.wm.edu%2F%7Edenys%2Fpubs%2FFSE15-GEMMA-CRC.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.cs.wm.edu%2Fsemeru%2Fdata%2FGEMMA%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786847",
            "PersonsString": "Mario Linares-Vásquez, Gabriele Bavota, Carlos Eduardo Bernal Cárdenas, Rocco Oliveto, Massimiliano Di Penta, and Denys Poshyvanyk",
            "AffiliationsString": "College of William and Mary, USA; Free University of Bolzano, Italy; University of Molise, Italy; University of Sannio, Italy",
            "Authors": [
                "Mario Linares-Vásquez @ College of William and Mary, USA",
                "Gabriele Bavota @ Free University of Bolzano, Italy",
                "Carlos Eduardo Bernal Cárdenas @ College of William and Mary, USA",
                "Rocco Oliveto @ University of Molise, Italy",
                "Massimiliano Di Penta @ University of Sannio, Italy",
                "Denys Poshyvanyk @ College of William and Mary, USA"
            ],
            "Affiliations": [
                "College of William and Mary, USA",
                "Free University of Bolzano, Italy",
                "College of William and Mary, USA",
                "University of Molise, Italy",
                "University of Sannio, Italy",
                "College of William and Mary, USA"
            ],
            "Abstract": "The wide diffusion of mobile devices has motivated research towards optimizing energy consumption of software systems— including apps—targeting such devices. Besides efforts aimed at dealing with various kinds of energy bugs, the adoption of Organic Light-Emitting Diode (OLED) screens has motivated research towards reducing energy consumption by choosing an appropriate color palette. Whilst past research in this area aimed at optimizing energy while keeping an acceptable level of contrast, this paper proposes an approach, named GEMMA (Gui Energy Multi-objective optiMization for Android apps), for generating color palettes using a multi- objective optimization technique, which produces color solutions optimizing energy consumption and contrast while using consistent colors with respect to the original color palette. An empirical evaluation that we performed on 25 Android apps demonstrates not only significant improvements in terms of the three different objectives, but also confirmed that in most cases users still perceived the choices of colors as attractive. Finally, for several apps we interviewed the original developers, who in some cases expressed the intent to adopt the proposed choice of color palette, whereas in other cases pointed out directions for future improvements",
            "Award": ""
        },
        {
            "Title": "Measure It? Manage It? Ignore It? Software Practitioners and Technical Debt",
            "Type": "Full Paper",
            "Key": "fse15main-mainid195-p",
            "URL": "https%3A%2F%2Ffink08.files.wordpress.com%2F2005%2F03%2Ffse15.pdf",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fgithub.com%2Fneilernst%2Ftd-survey",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786848",
            "PersonsString": "Neil A. Ernst, Stephany Bellomo, Ipek Ozkaya, Robert L. Nord, and Ian Gorton",
            "AffiliationsString": "SEI, USA",
            "Authors": [
                "Neil A. Ernst @ SEI, USA",
                "Stephany Bellomo @ SEI, USA",
                "Ipek Ozkaya @ SEI, USA",
                "Robert L. Nord @ SEI, USA",
                "Ian Gorton @ SEI, USA"
            ],
            "Affiliations": [
                "SEI, USA",
                "SEI, USA",
                "SEI, USA",
                "SEI, USA",
                "SEI, USA"
            ],
            "Abstract": "The technical debt metaphor is widely used to encapsulate numerous software quality problems. The metaphor is attractive to practitioners as it communicates to both technical and nontechnical audiences that if quality problems are not addressed, things may get worse. However, it is unclear whether there are practices that move this metaphor beyond a mere communication mechanism. Existing studies of technical debt have largely focused on code metrics and small surveys of developers. In this paper, we report on our survey of 1,831 participants, primarily software engineers and architects working in long-lived, software-intensive projects from three large organizations, and follow-up interviews of seven software engineers. We analyzed our data using both nonparametric statistics and qualitative text analysis. We found that architectural decisions are the most important source of technical debt. Furthermore, while respondents believe the metaphor is itself important for communication, existing tools are not currently helpful in managing the details. We use our results to motivate a technical debt timeline to focus management and tooling approaches.",
            "Award": ""
        },
        {
            "Title": "Suggesting Accurate Method and Class Names",
            "Type": "Full Paper",
            "Key": "fse15main-mainid204-p",
            "URL": "http%3A%2F%2Fgroups.inf.ed.ac.uk%2Fcup%2Fnaturalize%2Fpaper.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fgroups.inf.ed.ac.uk%2Fcup%2Fnaturalize%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786849",
            "PersonsString": "Miltiadis Allamanis, Earl T. Barr, Christian Bird, and Charles Sutton",
            "AffiliationsString": "University of Edinburgh, UK; University College London, UK; Microsoft Research, USA",
            "Authors": [
                "Miltiadis Allamanis @ University of Edinburgh, UK",
                "Earl T. Barr @ University College London, UK",
                "Christian Bird @ Microsoft Research, USA",
                "Charles Sutton @ University of Edinburgh, UK"
            ],
            "Affiliations": [
                "University of Edinburgh, UK",
                "University College London, UK",
                "Microsoft Research, USA",
                "University of Edinburgh, UK"
            ],
            "Abstract": "Descriptive names are a vital part of readable, and hence maintainable, code. Recent progress on automatically suggesting names for local variables tantalizes with the prospect of replicating that success with method and class names. However, suggesting names for methods and classes is much more difficult. This is because good method and class names need to be functionally descriptive, but suggesting such names requires that the model goes beyond local context. We introduce a neural probabilistic language model for source code that is specifically designed for the method naming problem. Our model learns which names are semantically similar by assigning them to locations, called embeddings, in a high-dimensional continuous space, in such a way that names with similar embeddings tend to be used in similar contexts. These embeddings seem to contain semantic information about tokens, even though they are learned only from statistical co-occurrences of tokens. Furthermore, we introduce a variant of our model that is, to our knowledge, the first that can propose neologisms, names that have not appeared in the training corpus. We obtain state of the art results on the method, class, and even the simpler variable naming tasks. More broadly, the continuous embeddings that are learned by our model have the potential for wide application within software engineering.",
            "Award": ""
        },
        {
            "Title": "Quality and Productivity Outcomes Relating to Continuous Integration in GitHub",
            "Type": "Full Paper",
            "Key": "fse15main-mainid209-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DBogdan+Vasilescu%2C+Yu+Yue%2C+Huaimin+Wang%2C+Premkumar+Devanbu%2C+and+Vladimir+Filkov+%22Quality+and+Productivity+Outcomes+Relating+to+Continuous+Integration+in+GitHub%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786850",
            "PersonsString": "Bogdan Vasilescu, Yu Yue, Huaimin Wang, Premkumar Devanbu, and Vladimir Filkov",
            "AffiliationsString": "University of California at Davis, USA; National University of Defense Technology, China",
            "Authors": [
                "Bogdan Vasilescu @ University of California at Davis, USA",
                "Yu Yue @ National University of Defense Technology, China",
                "Huaimin Wang @ National University of Defense Technology, China",
                "Premkumar Devanbu @ University of California at Davis, USA",
                "Vladimir Filkov @ University of California at Davis, USA"
            ],
            "Affiliations": [
                "University of California at Davis, USA",
                "National University of Defense Technology, China",
                "National University of Defense Technology, China",
                "University of California at Davis, USA",
                "University of California at Davis, USA"
            ],
            "Abstract": "Software processes comprise many steps; coding is followed by building, integration testing, system testing, deployment, operations, among others. Software process integration and automation have been areas of key concern in software engineering, ever since the pioneering work of Osterweil; market pressures for Agility, and open, decentralized, software development have provided additional pressures for progress in this area. But do these innovations actually help projects? Given the numerous confounding factors that can influence project performance, it can be a challenge to discern the effects of process integration and automation. Software project ecosystems such as GitHub provide a new opportunity in this regard: one can readily find large numbers of projects in various stages of process integration and automation, and gather data on various influencing factors as well as productivity and quality outcomes. In this paper we use large, historical data on process metrics and outcomes in GitHub projects to discern the effects of one specific innovation in process automation: continuous integration. Our main finding is that continuous integration improves the productivity of project teams, who can integrate more outside contributions, without an observable diminishment in code quality.",
            "Award": ""
        },
        {
            "Title": "A User-Guided Approach to Program Analysis",
            "Type": "Full Paper",
            "Key": "fse15main-mainid210-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRavi+Mangal%2C+Xin+Zhang%2C+Aditya+V.+Nori%2C+and+Mayur+Naik+%22A+User-Guided+Approach+to+Program+Analysis%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786851",
            "PersonsString": "Ravi Mangal, Xin Zhang, Aditya V. Nori, and Mayur Naik",
            "AffiliationsString": "Georgia Tech, USA; Microsoft Research, UK",
            "Authors": [
                "Ravi Mangal @ Georgia Tech, USA",
                "Xin Zhang @ Georgia Tech, USA",
                "Aditya V. Nori @ Microsoft Research, UK",
                "Mayur Naik @ Georgia Tech, USA"
            ],
            "Affiliations": [
                "Georgia Tech, USA",
                "Georgia Tech, USA",
                "Microsoft Research, UK",
                "Georgia Tech, USA"
            ],
            "Abstract": "Program analysis tools often produce undesirable output due to various approximations. We present an approach and a system EUGENE that allows user feedback to guide such approximations towards producing the desired output. We formulate the problem of user-guided program analysis in terms of solving a combination of hard rules and soft rules: hard rules capture soundness while soft rules capture degrees of approximations and preferences of users. Our technique solves the rules using an off-the-shelf solver in a manner that is sound (satisfies all hard rules), optimal (maximally satisfies soft rules), and scales to real-world analyses and programs. We evaluate EUGENE on two different analyses with labeled output on a suite of seven Java programs of size 131–198 KLOC. We also report upon a user study involving nine users who employ EUGENE to guide an information-flow analysis on three Java micro-benchmarks. In our experiments, EUGENE significantly reduces misclassified reports upon providing limited amounts of feedback.",
            "Award": ""
        },
        {
            "Title": "Hey, You Have Given Me Too Many Knobs!: Understanding and Dealing with Over-Designed Configuration in System Software",
            "Type": "Full Paper",
            "Key": "fse15main-mainid212-p",
            "URL": "http%3A%2F%2Fcseweb.ucsd.edu%2F%7Etixu%2Fpapers%2Ffse15.pdf",
            "URLvideo": "https%3A%2F%2Fgithub.com%2Ftianyin%2Fconfiguration_datasets",
            "URLinfo": "https%3A%2F%2Fgithub.com%2Ftianyin%2Fconfiguration_datasets",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786852",
            "PersonsString": "Tianyin Xu, Long Jin, Xuepeng Fan, Yuanyuan Zhou, Shankar Pasupathy, and Rukma Talwadker",
            "AffiliationsString": "University of California at San Diego, USA; NetApp, USA",
            "Authors": [
                "Tianyin Xu @ University of California at San Diego, USA",
                "Long Jin @ University of California at San Diego, USA",
                "Xuepeng Fan @ University of California at San Diego, USA",
                "Yuanyuan Zhou @ University of California at San Diego, USA",
                "Shankar Pasupathy @ NetApp, USA",
                "Rukma Talwadker @ NetApp, USA"
            ],
            "Affiliations": [
                "University of California at San Diego, USA",
                "University of California at San Diego, USA",
                "University of California at San Diego, USA",
                "University of California at San Diego, USA",
                "NetApp, USA",
                "NetApp, USA"
            ],
            "Abstract": "Configuration problems are not only prevalent, but also severely impair the reliability of today&#039;s system software. One fundamental reason is the ever-increasing complexity of configuration, reflected by the large number of configuration parameters (&quot;knobs&quot;). With hundreds of knobs, configuring system software to ensure high reliability and performance becomes a daunting, error-prone task. This paper makes a first step in understanding a fundamental question of configuration design: &quot;do users really need so many knobs?&quot; To provide the quantitatively answer, we study the configuration settings of real-world users, including thousands of customers of a commercial storage system (Storage-A), and hundreds of users of two widely-used open-source system software projects. Our study reveals a series of interesting findings to motivate software architects and developers to be more cautious and disciplined in configuration design. Motivated by these findings, we provide a few concrete, practical guidelines which can significantly reduce the configuration space. Take Storage-A as an example, the guidelines can remove 51.9% of its parameters and simplify 19.7% of the remaining ones with little impact on existing users. Also, we study the existing configuration navigation methods in the context of &quot;too many knobs&quot; to understand their effectiveness in dealing with the over-designed configuration, and to provide practices for building navigation support in system software.",
            "Award": ""
        },
        {
            "Title": "Proactive Self-Adaptation under Uncertainty: A Probabilistic Model Checking Approach",
            "Type": "Full Paper",
            "Key": "fse15main-mainid213-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DGabriel+A.+Moreno%2C+Javier+C%C3%A1mara+Moreno%2C+David+Garlan%2C+and+Bradley+Schmerl+%22Proactive+Self-Adaptation+under+Uncertainty%3A+A+Probabilistic+Model+Checking+Approach%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786853",
            "PersonsString": "Gabriel A. Moreno, Javier Cámara Moreno, David Garlan, and Bradley Schmerl",
            "AffiliationsString": "SEI, USA; Carnegie Mellon University, USA",
            "Authors": [
                "Gabriel A. Moreno @ SEI, USA",
                "Javier Cámara Moreno @ Carnegie Mellon University, USA",
                "David Garlan @ Carnegie Mellon University, USA",
                "Bradley Schmerl @ Carnegie Mellon University, USA"
            ],
            "Affiliations": [
                "SEI, USA",
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Self-adaptive systems tend to be reactive and myopic, adapting in response to changes without anticipating what the subsequent adaptation needs will be. Adapting reactively can result in inefficiencies due to the system performing a suboptimal sequence of adaptations. Furthermore, when adaptations have latency, and take some time to produce their effect, they have to be started with sufficient lead time so that they complete by the time their effect is needed. Proactive latency-aware adaptation addresses these issues by making adaptation decisions with a look-ahead horizon and taking adaptation latency into account. In this paper we present an approach for proactive latency-aware adaptation under uncertainty that uses probabilistic model checking for adaptation decisions. The key idea is to use a formal model of the adaptive system in which the adaptation decision is left underspecified through nondeterminism, and have the model checker resolve the nondeterministic choices so that the accumulated utility over the horizon is maximized. The adaptation decision is optimal over the horizon, and takes into account the inherent uncertainty of the environment predictions needed for looking ahead. Our results show that the decision based on a look-ahead horizon, and the factoring of both tactic latency and environment uncertainty, considerably improve the effectiveness of adaptation decisions.",
            "Award": ""
        },
        {
            "Title": "Developer Onboarding in GitHub: The Role of Prior Social Links and Language Experience",
            "Type": "Full Paper",
            "Key": "fse15main-mainid215-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DCasey+Casalnuovo%2C+Bogdan+Vasilescu%2C+Premkumar+Devanbu%2C+and+Vladimir+Filkov+%22Developer+Onboarding+in+GitHub%3A+The+Role+of+Prior+Social+Links+and+Language+Experience%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786854",
            "PersonsString": "Casey Casalnuovo, Bogdan Vasilescu, Premkumar Devanbu, and Vladimir Filkov",
            "AffiliationsString": "University of California at Davis, USA",
            "Authors": [
                "Casey Casalnuovo @ University of California at Davis, USA",
                "Bogdan Vasilescu @ University of California at Davis, USA",
                "Premkumar Devanbu @ University of California at Davis, USA",
                "Vladimir Filkov @ University of California at Davis, USA"
            ],
            "Affiliations": [
                "University of California at Davis, USA",
                "University of California at Davis, USA",
                "University of California at Davis, USA",
                "University of California at Davis, USA"
            ],
            "Abstract": "The team aspects of software engineering have been a subject of great interest since early work by Fred Brooks and others: how well do people work together in teams? why do people join teams? what happens if teams are distributed? Recently, the emergence of project ecosystems such as GitHub have created an entirely new, higher level of organization. GitHub supports numerous teams; they share a common technical platform (for work activities) and a common social platform (via following, commenting, etc). We explore the GitHub evidence for socialization as a precursor to joining a project, and how the technical factors of past experience and social factors of past connections to team members of a project affect productivity both initially and in the long run. We find developers preferentially join projects in GitHub where they have pre-existing relationships; furthermore, we find that the presence of past social connections combined with prior experience in languages dominant in the project leads to higher productivity both initially and cumulatively. Interestingly, we also find that stronger social connections are associated with slightly less productivity initially, but slightly more productivity in the long run.",
            "Award": ""
        },
        {
            "Title": "How Developers Search for Code: A Case Study",
            "Type": "Full Paper",
            "Key": "fse15main-mainid218-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DCaitlin+Sadowski%2C+Kathryn+Stolee%2C+and+Sebastian+Elbaum+%22How+Developers+Search+for+Code%3A+A+Case+Study%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786855",
            "PersonsString": "Caitlin Sadowski, Kathryn Stolee, and Sebastian Elbaum",
            "AffiliationsString": "Google, USA; Iowa State University, USA; University of Nebraska-Lincoln, USA",
            "Authors": [
                "Caitlin Sadowski @ Google, USA",
                "Kathryn Stolee @ Iowa State University, USA",
                "Sebastian Elbaum @ University of Nebraska-Lincoln, USA"
            ],
            "Affiliations": [
                "Google, USA",
                "Iowa State University, USA",
                "University of Nebraska-Lincoln, USA"
            ],
            "Abstract": "With the advent of large code repositories and sophisticated search capabilities, code search is increasingly becoming a key software development activity. In this work we shed some light into how developers search for code through a case study performed at Google, using a combination of survey and log-analysis methodologies. Our study provides insights into what developers are doing and trying to learn when per- forming a search, search scope, query properties, and what a search session under different contexts usually entails. Our results indicate that programmers search for code very frequently, conducting an average of five search sessions with 12 total queries each workday. The search queries are often targeted at a particular code location and programmers are typically looking for code with which they are somewhat familiar. Further, programmers are generally seeking answers to questions about how to use an API, what code does, why something is failing, or where code is located.",
            "Award": ""
        },
        {
            "Title": "Auto-completing Bug Reports for Android Applications",
            "Type": "Full Paper",
            "Key": "fse15main-mainid224-p",
            "URL": "http%3A%2F%2Fwww.cs.wm.edu%2F%7Edenys%2Fpubs%2FFSE15-FUSION-CRC.pdf",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D82JGj2uxnxk",
            "URLinfo": "http%3A%2F%2Fwww.fusion-android.com",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786857",
            "PersonsString": "Kevin Moran, Mario Linares Vásquez, Carlos Eduardo Bernal Cárdenas, and Denys Poshyvanyk",
            "AffiliationsString": "College of William and Mary, USA",
            "Authors": [
                "Kevin Moran @ College of William and Mary, USA",
                "Mario Linares Vásquez @ College of William and Mary, USA",
                "Carlos Eduardo Bernal Cárdenas @ College of William and Mary, USA",
                "Denys Poshyvanyk @ College of William and Mary, USA"
            ],
            "Affiliations": [
                "College of William and Mary, USA",
                "College of William and Mary, USA",
                "College of William and Mary, USA",
                "College of William and Mary, USA"
            ],
            "Abstract": "The modern software development landscape has seen a shift in focus toward mobile applications as tablets and smart-phones near ubiquitous adoption. Due to this trend, the complexity of these “apps” has been increasing, making development and maintenance challenging. Additionally, current bug tracking systems are not able to effectively support construction of reports with actionable information that directly lead to a bug’s resolution. To address the need for an improved reporting system, we introduce a novel solution, called FUSION, that helps users auto-complete reproduction steps in bug reports for mobile apps. FUSION links user-provided information to program artifacts extracted through static and dynamic analysis performed before testing or release. The approach that FUSION employs is generalizable to other current mobile software platforms, and constitutes a new method by which off-device bug reporting can be conducted for mobile software projects. We evaluated FUSION by conducting a study that quantitatively and qualitatively measured the user experience of the system for both reporting and reproducing bugs, as well as the quality of the bug reports it produces. In a study involving 28 participants we applied FUSION to support the maintenance tasks of reporting and reproducing defects on 15 real-world bugs found in 14 open source Android apps. Our results demonstrate that FUSION allows for more reliable reproduction of bugs from reports compared to traditional bug tracking systems by aiding users in reporting more detailed application-specific information.",
            "Award": ""
        },
        {
            "Title": "Assertions Are Strongly Correlated with Test Suite Effectiveness",
            "Type": "Full Paper",
            "Key": "fse15main-mainid226-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYucheng+Zhang+and+Ali+Mesbah+%22Assertions+Are+Strongly+Correlated+with+Test+Suite+Effectiveness%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786858",
            "PersonsString": "Yucheng Zhang and Ali Mesbah",
            "AffiliationsString": "University of British Columbia, Canada",
            "Authors": [
                "Yucheng Zhang @ University of British Columbia, Canada",
                "Ali Mesbah @ University of British Columbia, Canada"
            ],
            "Affiliations": [
                "University of British Columbia, Canada",
                "University of British Columbia, Canada"
            ],
            "Abstract": "Code coverage is a popular test adequacy criterion in practice. Code coverage, however, remains controversial as there is a lack of coherent empirical evidence for its relation with test suite effectiveness. More recently, test suite size has been shown to be highly correlated with effectiveness. However, previous studies treat test methods as the smallest unit of interest, and ignore potential factors influencing this relationship. We propose to go beyond test suite size, by investigating test assertions inside test methods. We empirically evaluate the relationship between a test suite’s effectiveness and the (1) number of assertions, (2) assertion coverage, and (3) different types of assertions. We compose 6,700 test suites in total, using 24,000 assertions of five real-world Java projects. We find that the number of assertions in a test suite strongly correlates with its effectiveness, and this factor directly influences the relationship between test suite size and effectiveness. Our results also indicate that assertion coverage is strongly correlated with effectiveness and different types of assertions can influence the effectiveness of their containing test suites.",
            "Award": ""
        },
        {
            "Title": "Query-Based Configuration of Text Retrieval Solutions for Software Engineering Tasks",
            "Type": "Full Paper",
            "Key": "fse15main-mainid227-p",
            "URL": "http%3A%2F%2Fwww.utdallas.edu%2F%7Elmorenoc%2Fresearch%2Fpubs%2Ffse2015-quest.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.utdallas.edu%2F%7Elmorenoc%2Fresearch%2Ffse2015-quest%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786859",
            "PersonsString": "Laura Moreno, Gabriele Bavota, Sonia Haiduc, Massimiliano Di Penta, Rocco Oliveto, Barbara Russo, and Andrian Marcus",
            "AffiliationsString": "University of Texas at Dallas, USA; Free University of Bolzano, Italy; Florida State University, USA; University of Sannio, Italy; University of Molise, Italy",
            "Authors": [
                "Laura Moreno @ University of Texas at Dallas, USA",
                "Gabriele Bavota @ Free University of Bolzano, Italy",
                "Sonia Haiduc @ Florida State University, USA",
                "Massimiliano Di Penta @ University of Sannio, Italy",
                "Rocco Oliveto @ University of Molise, Italy",
                "Barbara Russo @ Free University of Bolzano, Italy",
                "Andrian Marcus @ University of Texas at Dallas, USA"
            ],
            "Affiliations": [
                "University of Texas at Dallas, USA",
                "Free University of Bolzano, Italy",
                "Florida State University, USA",
                "University of Sannio, Italy",
                "University of Molise, Italy",
                "Free University of Bolzano, Italy",
                "University of Texas at Dallas, USA"
            ],
            "Abstract": "Text Retrieval (TR) approaches have been used to leverage the textual information contained in software artifacts to address a multitude of software engineering (SE) tasks. However, TR approaches need to be configured properly in order to lead to good results. Current approaches for automatic TR configuration in SE configure a single TR approach and then use it for all possible queries. In this paper, we show that such a configuration strategy leads to suboptimal results, and propose QUEST, the first approach bringing TR configuration selection to the query level. QUEST recommends the best TR configuration for a given query, based on a supervised learning approach that determines the TR configuration that performs the best for each query according to its properties. We evaluated QUEST in the context of feature and bug localization, using a data set with more than 1,000 queries. We found that QUEST is able to recommend one of the top three TR configurations for a query with a 69% accuracy, on average. We compared the results obtained with the configurations recommended by QUEST for every query with those obtained using a single TR configuration for all queries in a system and in the entire data set. We found that using QUEST we obtain better results than with any of the considered TR configurations.",
            "Award": ""
        },
        {
            "Title": "MemInsight: Platform-Independent Memory Debugging for JavaScript",
            "Type": "Full Paper",
            "Key": "fse15main-mainid229-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSimon+Jensen%2C+Manu+Sridharan%2C+Koushik+Sen%2C+and+Satish+Chandra+%22MemInsight%3A+Platform-Independent+Memory+Debugging+for+JavaScript%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786860",
            "PersonsString": "Simon Jensen, Manu Sridharan, Koushik Sen, and Satish Chandra",
            "AffiliationsString": "Snowflake Computing, USA; Samsung Research, USA; University of California at Berkeley, USA",
            "Authors": [
                "Simon Jensen @ Snowflake Computing, USA",
                "Manu Sridharan @ Samsung Research, USA",
                "Koushik Sen @ University of California at Berkeley, USA",
                "Satish Chandra @ Samsung Research, USA"
            ],
            "Affiliations": [
                "Snowflake Computing, USA",
                "Samsung Research, USA",
                "University of California at Berkeley, USA",
                "Samsung Research, USA"
            ],
            "Abstract": "JavaScript programs often suffer from memory issues that can either hurt performance or eventually cause memory exhaustion. While existing snapshot-based profiling tools can be helpful, the information provided is limited to the coarse granularity at which snapshots can be taken. We present MemInsight, a tool that provides detailed, time-varying analysis of the memory behavior of JavaScript applications, including web applications. MemInsight is platform independent and runs on unmodified JavaScript engines. It employs tuned source-code instrumentation to generate a trace of memory allocations and accesses, and it leverages modern browser features to track precise information for DOM (document object model) objects. It also computes exact object lifetimes without any garbage collector assistance, and exposes this information in an easily-consumable manner for further analysis. We describe several client analyses built into MemInsight, including detection of possible memory leaks and opportunities for stack allocation and object inlining. An experimental evaluation showed that with no modifications to the runtime, MemInsight was able to expose memory issues in several real-world applications.",
            "Award": ""
        },
        {
            "Title": "Systematic Testing of Asynchronous Reactive Systems",
            "Type": "Full Paper",
            "Key": "fse15main-mainid230-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAnkush+Desai%2C+Shaz+Qadeer%2C+and+Sanjit+A.+Seshia+%22Systematic+Testing+of+Asynchronous+Reactive+Systems%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.eecs.berkeley.edu%2F%7Eankush%2Fsystesting.html",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786861",
            "PersonsString": "Ankush Desai, Shaz Qadeer, and Sanjit A. Seshia",
            "AffiliationsString": "University of California at Berkeley, USA; Microsoft Research, USA",
            "Authors": [
                "Ankush Desai @ University of California at Berkeley, USA",
                "Shaz Qadeer @ Microsoft Research, USA",
                "Sanjit A. Seshia @ University of California at Berkeley, USA"
            ],
            "Affiliations": [
                "University of California at Berkeley, USA",
                "Microsoft Research, USA",
                "University of California at Berkeley, USA"
            ],
            "Abstract": "We introduce the concept of a delaying explorer with the goal of performing prioritized exploration of the behaviors of an asynchronous reactive program. A delaying explorer stratifies the search space using a custom strategy, and a delay operation that allows deviation from that strategy. We show that prioritized search with a delaying explorer performs significantly better than existing prioritization techniques. We also demonstrate empirically the need for writing different delaying explorers for scalable systematic testing and hence, present a flexible delaying explorer interface. We introduce two new techniques to improve the scalability of search based on delaying explorers. First, we present an algorithm for stratified exhaustive search and use efficient state caching to avoid redundant exploration of schedules. We provide soundness and termination guarantees for our algorithm. Second, for the cases where the state of the system cannot be captured or there are resource constraints, we present an algorithm to randomly sample any execution from the stratified search space. This algorithm guarantees that any such execution that requires $d$ delay operations is sampled with probability at least $1/L^d$, where $L$ is the maximum number of program steps. We have implemented our algorithms and evaluated them on a collection of real-world fault-tolerant distributed protocols.",
            "Award": ""
        },
        {
            "Title": "Test Report Prioritization to Assist Crowdsourced Testing",
            "Type": "Full Paper",
            "Key": "fse15main-mainid241-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYang+Feng%2C+Zhenyu+Chen%2C+James+A.+Jones%2C+Chunrong+Fang%2C+and+Baowen+Xu+%22Test+Report+Prioritization+to+Assist+Crowdsourced+Testing%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786862",
            "PersonsString": "Yang Feng, Zhenyu Chen, James A. Jones, Chunrong Fang, and Baowen Xu",
            "AffiliationsString": "University of California at Irvine, USA; Nanjing University, China",
            "Authors": [
                "Yang Feng @ University of California at Irvine, USA",
                "Zhenyu Chen @ Nanjing University, China",
                "James A. Jones @ University of California at Irvine, USA",
                "Chunrong Fang @ Nanjing University, China",
                "Baowen Xu @ Nanjing University, China"
            ],
            "Affiliations": [
                "University of California at Irvine, USA",
                "Nanjing University, China",
                "University of California at Irvine, USA",
                "Nanjing University, China",
                "Nanjing University, China"
            ],
            "Abstract": "In crowdsourced testing, users can be incentivized to perform testing tasks and report their results, and because crowdsourced workers are often paid per task, there is a financial incentive to complete tasks quickly rather than well. These reports of the crowdsourced testing tasks are called &quot;test reports&quot; and are composed of simple natural language and screenshots. Back at the software-development organization, developers must manually inspect the submitted test reports to judge their value for revealing faults. Due to the nature of crowdsourced work, the number of test reports are often difficult to comprehensively inspect and process. In order to help with this daunting task, we created the first technique of its kind, to the best of our knowledge, to prioritize test reports for manual inspection. Our technique utilizes two key strategies: (1) a diversity strategy to help developers inspect a wide variety of test reports and to avoid duplicates and wasted effort on falsely classified faulty behavior, and (2) a risk strategy to help developers identify test reports that may be more likely to be fault-revealing based on past observations. Together, these strategies form our DivRisk strategy to prioritize test reports in crowd- sourced testing. Three industrial projects of crowdsourced testing have been used to evaluate the effectiveness of test report prioritization methods. The results of the empirical study show that: (1) DivRisk can significantly outperform random prioritization; (2) DivRisk can approximate the best theoretical result for a real-world industrial mobile application. In addition, we provide some practical guidelines of test report prioritization for crowdsourced testing based on the empirical study and our experiences.",
            "Award": ""
        },
        {
            "Title": "Automatically Computing Path Complexity of Programs",
            "Type": "Full Paper",
            "Key": "fse15main-mainid246-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLucas+Bang%2C+Abdulbaki+Aydin%2C+and+Tevfik+Bultan+%22Automatically+Computing+Path+Complexity+of+Programs%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.cs.ucsb.edu%2F%7Evlab%2FPAC%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786863",
            "PersonsString": "Lucas Bang, Abdulbaki Aydin, and Tevfik Bultan",
            "AffiliationsString": "University of California at Santa Barbara, USA",
            "Authors": [
                "Lucas Bang @ University of California at Santa Barbara, USA",
                "Abdulbaki Aydin @ University of California at Santa Barbara, USA",
                "Tevfik Bultan @ University of California at Santa Barbara, USA"
            ],
            "Affiliations": [
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA"
            ],
            "Abstract": "Recent automated software testing techniques concentrate on achieving path coverage. We present a complexity measure that provides an upper bound for the number of paths in a program, and hence, can be used for assessing the difficulty of achieving path coverage for a given method. We define the path complexity of a program as a function that takes a depth bound as input and returns the number of paths in the control flow graph that are within that bound. We show how to automatically compute the path complexity function in closed form, and the asymptotic path complexity which identifies the dominant term in the path complexity function. Our results demonstrate that path complexity can be computed efficiently, and it is a better complexity measure for path coverage compared to cyclomatic complexity and NPATH complexity.",
            "Award": ""
        },
        {
            "Title": "Tracing Software Developers&#039; Eyes and Interactions for Change Tasks",
            "Type": "Full Paper",
            "Key": "fse15main-mainid247-p",
            "URL": "http%3A%2F%2Fwww.ifi.uzh.ch%2Fseal%2Fpeople%2Fkevic%2Fresearchprojects%2Ftaskcontext%2FFSE2015.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.csis.ysu.edu%2F%7Ebsharif%2FitraceMylyn%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786864",
            "PersonsString": "Katja Kevic, Braden M. Walters, Timothy R. Shaffer, Bonita Sharif, David C. Shepherd, and Thomas Fritz",
            "AffiliationsString": "University of Zurich, Switzerland; Youngstown State University, USA; ABB, USA",
            "Authors": [
                "Katja Kevic @ University of Zurich, Switzerland",
                "Braden M. Walters @ Youngstown State University, USA",
                "Timothy R. Shaffer @ Youngstown State University, USA",
                "Bonita Sharif @ Youngstown State University, USA",
                "David C. Shepherd @ ABB, USA",
                "Thomas Fritz @ University of Zurich, Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "Youngstown State University, USA",
                "Youngstown State University, USA",
                "Youngstown State University, USA",
                "ABB, USA",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "What are software developers doing during a change task? While an answer to this question opens countless opportunities to support developers in their work, only little is known about developers&#039; detailed navigation behavior for realistic change tasks. Most empirical studies on developers performing change tasks are limited to very small code snippets or are limited by the granularity or the detail of the data collected for the study. In our research, we try to overcome these limitations by combining user interaction monitoring with very fine granular eye-tracking data that is automatically linked to the underlying source code entities in the IDE. In a study with 12 professional and 10 student developers working on three change tasks from an open source system, we used our approach to investigate the detailed navigation of developers for realistic change tasks. The results of our study show, amongst others, that the eye tracking data does indeed capture different aspects than user interaction data and that developers focus on only small parts of methods that are often related by data flow. We discuss our findings and their implications for better developer tool support.",
            "Award": ""
        },
        {
            "Title": "Hidden Truths in Dead Software Paths",
            "Type": "Full Paper",
            "Key": "fse15main-mainid249-p",
            "URL": "http%3A%2F%2Fwww.thewhitespace.de%2Fpublications%2Fehmg15-deadpath.pdf",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.opal-project.de%2Ftools%2Fbugpicker%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786865",
            "PersonsString": "Michael Eichberg, Ben Hermann, Mira Mezini, and Leonid Glanz",
            "AffiliationsString": "TU Darmstadt, Germany",
            "Authors": [
                "Michael Eichberg @ TU Darmstadt, Germany",
                "Ben Hermann @ TU Darmstadt, Germany",
                "Mira Mezini @ TU Darmstadt, Germany",
                "Leonid Glanz @ TU Darmstadt, Germany"
            ],
            "Affiliations": [
                "TU Darmstadt, Germany",
                "TU Darmstadt, Germany",
                "TU Darmstadt, Germany",
                "TU Darmstadt, Germany"
            ],
            "Abstract": "Approaches and techniques for statically finding a multitude of issues in source code have been developed in the past. A core property of these approaches is that they are usually targeted towards finding only a very specific kind of issue and that the effort to develop such an analysis is significant. This strictly limits the number of kinds of issues that can be detected. In this paper, we discuss a generic approach based on the detection of infeasible paths in code that can discover a wide range of code smells ranging from useless code that hinders comprehension to real bugs. Code issues are identified by calculating the difference between the control-flow graph that contains all technically possible edges and the corresponding graph recorded while performing a more precise analysis using abstract interpretation. We have evaluated the approach using the Java Development Kit as well as the Qualitas Corpus (a curated collection of over 100 Java Applications) and were able to find thousands of issues across a wide range of categories.",
            "Award": ""
        },
        {
            "Title": "A Method to Identify and Correct Problematic Software Activity Data: Exploiting Capacity Constraints and Data Redundancies",
            "Type": "Full Paper",
            "Key": "fse15main-mainid250-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DQimu+Zheng%2C+Audris+Mockus%2C+and+Minghui+Zhou+%22A+Method+to+Identify+and+Correct+Problematic+Software+Activity+Data%3A+Exploiting+Capacity+Constraints+and+Data+Redundancies%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786866",
            "PersonsString": "Qimu Zheng, Audris Mockus, and Minghui Zhou",
            "AffiliationsString": "Peking University, China; University of Tennessee, USA",
            "Authors": [
                "Qimu Zheng @ Peking University, China",
                "Audris Mockus @ University of Tennessee, USA",
                "Minghui Zhou @ Peking University, China"
            ],
            "Affiliations": [
                "Peking University, China",
                "University of Tennessee, USA",
                "Peking University, China"
            ],
            "Abstract": "Mining software repositories to understand and improve software development is a common approach in research and practice. The operational data obtained from these repositories often do not faithfully represent the intended aspects of software development and, therefore, may jeopardize the conclusions derived from it. We propose an approach to identify problematic values based on the constraints of software development and to correct such values using data redundancies. We investigate the approach using issue and commit data of Mozilla project. In particular, we identified problematic data in four types of events and found the fraction of problematic values to exceed 10% and rapidly rising. We found the corrected values to be 50% closer to the most accurate estimate of task completion time. Finally, we found that the models of time until fix changed substantially when data were corrected, with the corrected data providing a 20% better fit. We discuss how the approach may be generalized to other types of operational data to increase fidelity of software measurement in practice and in research.",
            "Award": ""
        },
        {
            "Title": "Witness Validation and Stepwise Testification across Software Verifiers",
            "Type": "Full Paper",
            "Key": "fse15main-mainid253-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDirk+Beyer%2C+Matthias+Dangl%2C+Daniel+Dietsch%2C+Matthias+Heizmann%2C+and+Andreas+Stahlbauer+%22Witness+Validation+and+Stepwise+Testification+across+Software+Verifiers%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786867",
            "PersonsString": "Dirk Beyer, Matthias Dangl, Daniel Dietsch, Matthias Heizmann, and Andreas Stahlbauer",
            "AffiliationsString": "University of Passau, Germany; University of Freiburg, Germany",
            "Authors": [
                "Dirk Beyer @ University of Passau, Germany",
                "Matthias Dangl @ University of Passau, Germany",
                "Daniel Dietsch @ University of Freiburg, Germany",
                "Matthias Heizmann @ University of Freiburg, Germany",
                "Andreas Stahlbauer @ University of Passau, Germany"
            ],
            "Affiliations": [
                "University of Passau, Germany",
                "University of Passau, Germany",
                "University of Freiburg, Germany",
                "University of Freiburg, Germany",
                "University of Passau, Germany"
            ],
            "Abstract": "It is commonly understood that a verification tool should provide a counterexample to witness a specification violation. Until recently, software verifiers dumped error witnesses in proprietary formats, which are often neither human- nor machine-readable, and an exchange of witnesses between different verifiers was impossible. To close this gap in software-verification technology, we have defined an exchange format for error witnesses that is easy to write and read by verification tools (for further processing, e.g., witness validation) and that is easy to convert into visualizations that conveniently let the developers inspect the error path. To eliminate manual inspection of false alarms, we develop the notion of stepwise testification: step 1: If a verifier finds a problematic program path, it does not only output the negative verification result, but additionally constructs a witness for this path; step 2: a second verifier re-verifies that the witness indeed violates the specification. This process can have more than two steps, each reducing the state space around the error path, making it easier to validate the witness in a later step. An obvious application for testification is the setting where we have two verifiers: one that is efficient but imprecise and another one that is precise but expensive. We have implemented the technique of error-witness-driven program analysis in two state-of-the-art verification tools, CPAchecker and Ultimate Automizer, and show by experimental evaluation that the approach is applicable to a large set of verification tasks.",
            "Award": ""
        },
        {
            "Title": "P3: Partitioned Path Profiling",
            "Type": "Full Paper",
            "Key": "fse15main-mainid255-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMohammed+Afraz%2C+Diptikalyan+Saha%2C+and+Aditya+Kanade+%22P3%3A+Partitioned+Path+Profiling%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786868",
            "PersonsString": "Mohammed Afraz, Diptikalyan Saha, and Aditya Kanade",
            "AffiliationsString": "Indian Institute of Science, India; IBM Research, India",
            "Authors": [
                "Mohammed Afraz @ Indian Institute of Science, India",
                "Diptikalyan Saha @ IBM Research, India",
                "Aditya Kanade @ Indian Institute of Science, India"
            ],
            "Affiliations": [
                "Indian Institute of Science, India",
                "IBM Research, India",
                "Indian Institute of Science, India"
            ],
            "Abstract": "Acyclic path profile is an abstraction of dynamic control flow paths of procedures and has been found to be useful in a wide spectrum of activities. Unfortunately, the runtime overhead of obtaining such a profile can be high, limiting its use in practice. In this paper, we present partitioned path profiling (P3) which runs K copies of the program in parallel, each with the same input but on a separate core, and collects the profile only for a subset of intra-procedural paths in each copy, thereby, distributing the overhead of profiling. P3 identifies “profitable” procedures and assigns disjoint subsets of paths of a profitable procedure to different copies for profiling. To obtain exact execution frequencies of a subset of paths, we design a new algorithm, called PSPP. All paths of an unprofitable procedure are assigned to the same copy. P3 uses the classic Ball-Larus algorithm for profiling unprofitable procedures. Further, P3 attempts to evenly distribute the profiling overhead across the copies. To the best of our knowledge, P3 is the first algorithm for parallel path profiling. We have applied P3 to profile several programs in the SPEC 2006 benchmark. Compared to sequential profiling, P3 substantially reduced the runtime overhead on these programs averaged across all benchmarks. The reduction was 23%, 43% and 56% on average for 2, 4 and 8 cores respectively. P3 also performed better than a coarse-grained approach that treats all procedures as unprofitable and distributes them across available cores. For 2 cores, the profiling overhead of P3 was on average 5% less compared to the coarse-grained approach across these programs. For 4 and 8 cores, it was respectively 18% and 25% less.",
            "Award": ""
        },
        {
            "Title": "Users Beware: Preference Inconsistencies Ahead",
            "Type": "Full Paper",
            "Key": "fse15main-mainid261-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DFarnaz+Behrang%2C+Myra+B.+Cohen%2C+and+Alessandro+Orso+%22Users+Beware%3A+Preference+Inconsistencies+Ahead%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786869",
            "PersonsString": "Farnaz Behrang, Myra B. Cohen, and Alessandro Orso",
            "AffiliationsString": "Georgia Tech, USA; University of Nebraska-Lincoln, USA",
            "Authors": [
                "Farnaz Behrang @ Georgia Tech, USA",
                "Myra B. Cohen @ University of Nebraska-Lincoln, USA",
                "Alessandro Orso @ Georgia Tech, USA"
            ],
            "Affiliations": [
                "Georgia Tech, USA",
                "University of Nebraska-Lincoln, USA",
                "Georgia Tech, USA"
            ],
            "Abstract": "The structure of preferences for modern highly-configurable software systems has become extremely complex, usually consisting of multiple layers of access that go from the user interface down to the lowest levels of the source code. This complexity can lead to inconsistencies between layers, especially during software evolution. For example, there may be preferences that users can change through the GUI, but that have no effect on the actual behavior of the system because the related source code is not present or has been removed going from one version to the next. These inconsistencies may result in unexpected program behaviors, which range in severity from mild annoyances to more critical security or performance problems. To address this problem, we present SCIC (Software Configuration Inconsistency Checker), a static analysis technique that can automatically detect these kinds of inconsistencies. Unlike other configuration analysis tools, SCIC can handle software that (1) is written in multiple programming languages and (2) has a complex preference structure. In an empirical evaluation that we performed on 10 years worth of versions of both the widely used Mozilla Core and Firefox, SCIC was able to find 40 real inconsistencies (some determined as severe), whose lifetime spanned multiple versions, and whose detection required the analysis of code written in multiple languages.",
            "Award": ""
        },
        {
            "Title": "Impact of Developer Turnover on Quality in Open-Source Software",
            "Type": "Full Paper",
            "Key": "fse15main-mainid265-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMatthieu+Foucault%2C+Marc+Palyart%2C+Xavier+Blanc%2C+Gail+C.+Murphy%2C+and+Jean-R%C3%A9my+Falleri+%22Impact+of+Developer+Turnover+on+Quality+in+Open-Source+Software%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fse.labri.fr%2Fa%2FFSE15-foucault%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786870",
            "PersonsString": "Matthieu Foucault, Marc Palyart, Xavier Blanc, Gail C. Murphy, and Jean-Rémy Falleri",
            "AffiliationsString": "University of Bordeaux, France; University of British Columbia, Canada; Bordeaux INP, France",
            "Authors": [
                "Matthieu Foucault @ University of Bordeaux, France",
                "Marc Palyart @ University of British Columbia, Canada",
                "Xavier Blanc @ University of Bordeaux, France",
                "Gail C. Murphy @ University of British Columbia, Canada",
                "Jean-Rémy Falleri @ Bordeaux INP, France"
            ],
            "Affiliations": [
                "University of Bordeaux, France",
                "University of British Columbia, Canada",
                "University of Bordeaux, France",
                "University of British Columbia, Canada",
                "Bordeaux INP, France"
            ],
            "Abstract": "Turnover is the phenomenon of continuous influx and retreat of human resources in a team. Despite being well-studied in many settings, turnover has not been characterized for open-source software projects. We study the source code repositories of five open-source projects to characterize patterns of turnover and to determine the effects of turnover on software quality. We define the base concepts of both external and internal turnover, which are the mobility of developers in and out of a project, and the mobility of developers inside a project, respectively. We provide a qualitative analysis of turnover patterns. We also found, in a quantitative analysis, that the activity of external newcomers negatively impact software quality.",
            "Award": ""
        },
        {
            "Title": "Clone-Based and Interactive Recommendation for Modifying Pasted Code",
            "Type": "Full Paper",
            "Key": "fse15main-mainid266-p",
            "URL": "http%3A%2F%2Fwww.se.fudan.edu.cn%2Fpaper%2Fourpapers%2F240.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786871",
            "PersonsString": "Yun Lin, Xin Peng, Zhenchang Xing, Diwen Zheng, and Wenyun Zhao",
            "AffiliationsString": "Fudan University, China; Nanyang Technological University, Singapore",
            "Authors": [
                "Yun Lin @ Fudan University, China",
                "Xin Peng @ Fudan University, China",
                "Zhenchang Xing @ Nanyang Technological University, Singapore",
                "Diwen Zheng @ Fudan University, China",
                "Wenyun Zhao @ Fudan University, China"
            ],
            "Affiliations": [
                "Fudan University, China",
                "Fudan University, China",
                "Nanyang Technological University, Singapore",
                "Fudan University, China",
                "Fudan University, China"
            ],
            "Abstract": "Developers often need to modify pasted code when programming with copy-and-paste practice. Some modifications on pasted code could involve lots of editing efforts, and any missing or wrong edit could incur bugs. In this paper, we propose a clone-based and interactive approach to recommending where and how to modify the pasted code. In our approach, we regard clones of the pasted code as the results of historical copy-and-paste operations and their differences as historical modifications on the same piece of code. Our approach first retrieves clones of the pasted code from a clone repository and detects syntactically complete differences among them. Then our approach transfers each clone difference into a modification slot on the pasted code, suggests options for each slot, and further mines modifying regulations from the clone differences. Based on the mined modifying regulations, our approach dynamically updates the suggested options and their ranking in each slot according to developer&#039;s modifications on the pasted code. We implement a proof-of-concept tool CCDemon based on our approach and evaluate its effectiveness based on code clones detected from five open source projects. The results show that our approach can identify 96.9% of the to-be-modified positions in pasted code and suggest 75.0% of the required modifications. Our human study further confirms that CCDemon can help developers to accomplish their modifications of pasted code more efficiently.",
            "Award": ""
        },
        {
            "Title": "Cross-Language Program Slicing for Dynamic Web Applications",
            "Type": "Full Paper",
            "Key": "fse15main-mainid267-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DHung+Viet+Nguyen%2C+Christian+K%C3%A4stner%2C+and+Tien+N.+Nguyen+%22Cross-Language+Program+Slicing+for+Dynamic+Web+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786872",
            "PersonsString": "Hung Viet Nguyen, Christian Kästner, and Tien N. Nguyen",
            "AffiliationsString": "Iowa State University, USA; Carnegie Mellon University, USA",
            "Authors": [
                "Hung Viet Nguyen @ Iowa State University, USA",
                "Christian Kästner @ Carnegie Mellon University, USA",
                "Tien N. Nguyen @ Iowa State University, USA"
            ],
            "Affiliations": [
                "Iowa State University, USA",
                "Carnegie Mellon University, USA",
                "Iowa State University, USA"
            ],
            "Abstract": "During software maintenance, program slicing is a useful technique to assist developers in understanding the impact of their changes. While different program-slicing techniques have been proposed for traditional software systems, program slicing for dynamic web applications is challenging since the client-side code is generated from the server-side code and data entities are referenced across different languages and are often embedded in string literals in the server-side program. To address those challenges, we introduce WebSlice, an approach to compute program slices across different languages for web applications. We first identify data-flow dependencies among data entities for PHP code based on symbolic execution. We also compute SQL queries and a conditional DOM that represents client-code variations and construct the data flows for embedded languages: SQL, HTML, and JavaScript. Next, we connect the data flows across different languages and across PHP pages. Finally, we compute a program slice for a given entity based on the established data flows. Running WebSlice on five real-world, open-source PHP systems, we found that, out of 40,670 program slices, 10% cross languages, 38% cross files, and 13% cross string fragments, demonstrating the potential benefit of tool support for cross-language program slicing in dynamic web applications.",
            "Award": ""
        },
        {
            "Title": "CLAPP: Characterizing Loops in Android Applications",
            "Type": "Full Paper",
            "Key": "fse15main-mainid268-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYanick+Fratantonio%2C+Aravind+Machiry%2C+Antonio+Bianchi%2C+Christopher+Kruegel%2C+and+Giovanni+Vigna+%22CLAPP%3A+Characterizing+Loops+in+Android+Applications%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fcs.ucsb.edu%2F%7Eyanick%2Fclapp%2F",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786873",
            "PersonsString": "Yanick Fratantonio, Aravind Machiry, Antonio Bianchi, Christopher Kruegel, and Giovanni Vigna",
            "AffiliationsString": "University of California at Santa Barbara, USA",
            "Authors": [
                "Yanick Fratantonio @ University of California at Santa Barbara, USA",
                "Aravind Machiry @ University of California at Santa Barbara, USA",
                "Antonio Bianchi @ University of California at Santa Barbara, USA",
                "Christopher Kruegel @ University of California at Santa Barbara, USA",
                "Giovanni Vigna @ University of California at Santa Barbara, USA"
            ],
            "Affiliations": [
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA"
            ],
            "Abstract": "When performing program analysis, loops are one of the most important aspects that needs to be taken into account. In the past, many approaches have been proposed to analyze loops to perform different tasks, ranging from compiler optimizations to Worst-Case Execution Time (WCET) analysis. While these approaches are powerful, they focus on tackling very specific categories of loops and known loop patterns, such as the ones for which the number of iterations can be statically determined. In this work, we developed a static analysis framework to characterize and analyze generic loops, without relying on techniques based on pattern matching. For this work, we focus on the Android platform, and we implemented a prototype, called CLAPP, that we used to perform the first large-scale empirical study of the usage of loops in Android applications. In particular, we used our tool to analyze a total of 4,110,510 loops found in 11,823 Android applications. As part of our evaluation, we provide the detailed results of our empirical study, we show how our analysis was able to determine that the execution of 63.28% of the loops is bounded, and we discuss several interesting insights related to the performance issues and security aspects associated with loops.",
            "Award": ""
        },
        {
            "Title": "Synthesizing Tests for Detecting Atomicity Violations",
            "Type": "Full Paper",
            "Key": "fse15main-mainid270-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMalavika+Samak+and+Murali+Krishna+Ramanathan+%22Synthesizing+Tests+for+Detecting+Atomicity+Violations%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786874",
            "PersonsString": "Malavika Samak and Murali Krishna Ramanathan",
            "AffiliationsString": "Indian Institute of Science, India",
            "Authors": [
                "Malavika Samak @ Indian Institute of Science, India",
                "Murali Krishna Ramanathan @ Indian Institute of Science, India"
            ],
            "Affiliations": [
                "Indian Institute of Science, India",
                "Indian Institute of Science, India"
            ],
            "Abstract": "Using thread-safe libraries can help programmers avoid the complexities of multithreading. However, designing libraries that guarantee thread-safety can be challenging. Detecting and eliminating atomicity violations when methods in the libraries are invoked concurrently is vital in building reliable client applications that use the libraries. While there are dynamic analyses to detect atomicity violations, these techniques are critically dependent on effective multithreaded tests. Unfortunately, designing such tests is non-trivial. In this paper, we design a novel and scalable approach for synthesizing multithreaded tests that help detect atomicity violations. The input to the approach is the implementation of the library and a sequential seed testsuite that invokes every method in the library with random parameters. We analyze the execution of the sequential tests, generate variable lock dependencies and construct a set of three accesses which when interleaved suitably in a multithreaded execution can cause an atomicity violation. Subsequently, we identify pairs of method invocations that correspond to these accesses and invoke them concurrently from distinct threads with appropriate objects to help expose atomicity violations. We have incorporated these ideas in our tool, named Intruder, and applied it on multiple open-source Java multithreaded libraries. Intruder is able to synthesize 40 multithreaded tests across nine classes in less than two minutes to detect 79 harmful atomicity violations, including previously unknown violations in thread-safe classes. We also demonstrate the effectiveness of Intruder by comparing the results with other approaches designed for synthesizing multithreaded tests.",
            "Award": ""
        },
        {
            "Title": "Mimic: Computing Models for Opaque Code",
            "Type": "Full Paper",
            "Key": "fse15main-mainid273-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DStefan+Heule%2C+Manu+Sridharan%2C+and+Satish+Chandra+%22Mimic%3A+Computing+Models+for+Opaque+Code%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786875",
            "PersonsString": "Stefan Heule, Manu Sridharan, and Satish Chandra",
            "AffiliationsString": "Stanford University, USA; Samsung Research, USA",
            "Authors": [
                "Stefan Heule @ Stanford University, USA",
                "Manu Sridharan @ Samsung Research, USA",
                "Satish Chandra @ Samsung Research, USA"
            ],
            "Affiliations": [
                "Stanford University, USA",
                "Samsung Research, USA",
                "Samsung Research, USA"
            ],
            "Abstract": "Opaque code, which is executable but whose source is unavailable or hard to process, can be problematic in a number of scenarios, such as program analysis. Manual construction of models is often used to handle opaque code, but this process is tedious and error-prone. (In this paper, we use model to mean a representation of a piece of code suitable for program analysis.) We present a novel technique for automatic generation of models for opaque code, based on program synthesis. The technique intercepts memory accesses from the opaque code to client objects, and uses this information to construct partial execution traces. Then, it performs a heuristic search inspired by Markov Chain Monte Carlo techniques to discover an executable code model whose behavior matches the opaque code. Native execution, parallelization, and a carefully-designed fitness function are leveraged to increase the effectiveness of the search. We have implemented our technique in a tool Mimic for discovering models of opaque JavaScript functions, and used Mimic to synthesize correct models for a variety of array-manipulating routines.",
            "Award": ""
        },
        {
            "Title": "Rule-Based Extraction of Goal-Use Case Models from Text",
            "Type": "Full Paper",
            "Key": "fse15main-mainid274-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTuong+Huan+Nguyen%2C+John+Grundy%2C+and+Mohamed+Almorsy+%22Rule-Based+Extraction+of+Goal-Use+Case+Models+from+Text%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fwww.ict.swin.edu.au%2Fpersonal%2Fhuannguyen%2Fguitar.html",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786876",
            "PersonsString": "Tuong Huan Nguyen, John Grundy, and Mohamed Almorsy",
            "AffiliationsString": "Swinburne University of Technology, Australia",
            "Authors": [
                "Tuong Huan Nguyen @ Swinburne University of Technology, Australia",
                "John Grundy @ Swinburne University of Technology, Australia",
                "Mohamed Almorsy @ Swinburne University of Technology, Australia"
            ],
            "Affiliations": [
                "Swinburne University of Technology, Australia",
                "Swinburne University of Technology, Australia",
                "Swinburne University of Technology, Australia"
            ],
            "Abstract": "Goal and use case modeling has been recognized as a key approach for understanding and analyzing requirements. However, in practice, goals and use cases are often buried among other content in requirements specifications documents and written in unstructured styles. It is thus a time-consuming and error-prone process to identify such goals and use cases. In addition, having them embedded in natural language documents greatly limits the possibility of formally analyzing the requirements for problems. To address these issues, we have developed a novel rule-based approach to automatically extract goal and use case models from natural language requirements documents. Our approach is able to automatically categorize goals and ensure they are properly specified. We also provide automated semantic parameterization of artifact textual specifications to promote further analysis on the extracted goal-use case models. Our approach achieves 85% precision and 82% recall rates on average for model extraction and 88% accuracy for the automated parameterization.",
            "Award": ""
        },
        {
            "Title": "Clotho:Saving Programs from Malformed Strings and Incorrect String-Handling",
            "Type": "Full Paper",
            "Key": "fse15main-mainid281-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAritra+Dhar%2C+Rahul+Purandare%2C+Mohan+Dhawan%2C+and+Suresh+Rangaswamy+%22Clotho%3ASaving+Programs+from+Malformed+Strings+and+Incorrect+String-Handling%22",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fgithub.com%2Faritradhar%2FCLOTHO",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786877",
            "PersonsString": "Aritra Dhar, Rahul Purandare, Mohan Dhawan, and Suresh Rangaswamy",
            "AffiliationsString": "Xerox Research Center, India; IIIT Delhi, India; IBM Research, India",
            "Authors": [
                "Aritra Dhar @ Xerox Research Center, India",
                "Rahul Purandare @ IIIT Delhi, India",
                "Mohan Dhawan @ IBM Research, India",
                "Suresh Rangaswamy @ IIIT Delhi, India"
            ],
            "Affiliations": [
                "Xerox Research Center, India",
                "IIIT Delhi, India",
                "IBM Research, India",
                "IIIT Delhi, India"
            ],
            "Abstract": "Software is susceptible to malformed data originating from untrusted sources. Occasionally the programming logic or constructs used are inappropriate to handle the varied constraints imposed by legal and well-formed data. Consequently, softwares may produce unexpected results or even crash. In this paper, we present CLOTHO, a novel hybrid approach that saves such softwares from crashing when failures originate from malformed strings or inappropriate handling of strings. CLOTHO statically analyses a program to identify statements that are vulnerable to failures related to associated string data. CLOTHO then generates patches that are likely to satisfy constraints on the data, and in case of failures produces program behavior which would be close to the expected. The precision of the patches is improved with the help of a dynamic analysis. We have implemented CLOTHO for the JAVA String API, and our evaluation based on several popular open-source libraries shows that CLOTHO generates patches that are semantically similar to the actual patches generated by the programmers in the later versions. Additionally, these patches are activated only when a failure is detected, and thus CLOTHO incurs no runtime overhead during normal execution, and negligible overhead in case of failures.",
            "Award": ""
        },
        {
            "Title": "Comparing and Combining Test-Suite Reduction and Regression Test Selection",
            "Type": "Full Paper",
            "Key": "fse15main-mainid288-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAugust+Shi%2C+Tifany+Yung%2C+Alex+Gyori%2C+and+Darko+Marinov+%22Comparing+and+Combining+Test-Suite+Reduction+and+Regression+Test+Selection%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786878",
            "PersonsString": "August Shi, Tifany Yung, Alex Gyori, and Darko Marinov",
            "AffiliationsString": "University of Illinois at Urbana-Champaign, USA",
            "Authors": [
                "August Shi @ University of Illinois at Urbana-Champaign, USA",
                "Tifany Yung @ University of Illinois at Urbana-Champaign, USA",
                "Alex Gyori @ University of Illinois at Urbana-Champaign, USA",
                "Darko Marinov @ University of Illinois at Urbana-Champaign, USA"
            ],
            "Affiliations": [
                "University of Illinois at Urbana-Champaign, USA",
                "University of Illinois at Urbana-Champaign, USA",
                "University of Illinois at Urbana-Champaign, USA",
                "University of Illinois at Urbana-Champaign, USA"
            ],
            "Abstract": "Regression testing is widely used to check that changes made to software do not break existing functionality, but regression test suites grow, and running them fully can become costly. Researchers have proposed test-suite reduction and regression test selection as two approaches to reduce this cost by not running some of the tests from the test suite. However, previous research has not empirically evaluated how the two approaches compare to each other, and how well a combination of these approaches performs. We present the first extensive study that compares test-suite reduction and regression test selection approaches individually, and also evaluates a combination of the two approaches. We also propose a new criterion to measure the quality of tests with respect to software changes. Our experiments on 4,793 commits from 17 open-source projects show that regression test selection runs on average fewer tests (by 40.15pp) than test-suite reduction. However, test-suite reduction can have a high loss in fault-detection capability with respect to the changes, whereas a (safe) regression test selection has no loss. The experiments also show that a combination of the two approaches runs even fewer tests (on average 5.34pp) than regression test selection, but these tests still have a loss in fault-detection capability with respect to the changes.",
            "Award": ""
        },
        {
            "Title": "String Analysis for Java and Android Applications",
            "Type": "Full Paper",
            "Key": "fse15main-mainid292-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDing+Li%2C+Yingjun+Lyu%2C+Mian+Wan%2C+and+William+G.+J.+Halfond+%22String+Analysis+for+Java+and+Android+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786879",
            "PersonsString": "Ding Li, Yingjun Lyu, Mian Wan, and William G. J. Halfond",
            "AffiliationsString": "University of Southern California, USA",
            "Authors": [
                "Ding Li @ University of Southern California, USA",
                "Yingjun Lyu @ University of Southern California, USA",
                "Mian Wan @ University of Southern California, USA",
                "William G. J. Halfond @ University of Southern California, USA"
            ],
            "Affiliations": [
                "University of Southern California, USA",
                "University of Southern California, USA",
                "University of Southern California, USA",
                "University of Southern California, USA"
            ],
            "Abstract": "String analysis is critical for many verification techniques. However, accurately modeling string variables is a challeng- ing problem. Current approaches are generally customized for certain problem domains or have critical limitations in handling loops, providing context-sensitive inter-procedural analysis, and performing efficient analysis on complicated apps. To address these limitations, we propose a general framework, Violist, for string analysis that allows researchers to more flexibly choose how they will address each of these challenges by separating the representation and interpreta- tion of string operations. In our evaluation, we show that our approach can achieve high accuracy on both Java and Android apps in a reasonable amount of time. We also com- pared our approach with a popular and widely used string analyzer and found that our approach has higher precision and shorter execution time while maintaining the same level of recall.",
            "Award": ""
        },
        {
            "Title": "Information Retrieval and Spectrum Based Bug Localization: Better Together",
            "Type": "Full Paper",
            "Key": "fse15main-mainid300-p",
            "URL": "https%3A%2F%2Fsites.google.com%2Fsite%2Flebuitienduy%2Ffse2015.pdf%3Fattredirects%3D0%26d%3D1",
            "URLvideo": "",
            "URLinfo": "",
            "DOI": "http%3A%2F%2Fdx.doi.org%2F10.1145%2F2786805.2786880",
            "PersonsString": "Tien-Duy B. Le, Richard J. Oentaryo, and David Lo",
            "AffiliationsString": "Singapore Management University, Singapore",
            "Authors": [
                "Tien-Duy B. Le @ Singapore Management University, Singapore",
                "Richard J. Oentaryo @ Singapore Management University, Singapore",
                "David Lo @ Singapore Management University, Singapore"
            ],
            "Affiliations": [
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore"
            ],
            "Abstract": "Debugging often takes much effort and resources. To help developers debug, numerous information retrieval (IR)-based and spectrum-based bug localization techniques have been proposed. IR-based techniques process textual information in bug reports, while spectrum-based techniques process program spectra (i.e., a record of which program elements are executed for each test case). Both eventually generate a ranked list of program elements that are likely to contain the bug. However, these techniques only consider one source of information, either bug reports or program spectra, which is not optimal. To deal with the limitation of existing techniques, in this work, we propose a new multi-modal technique that considers both bug reports and program spectra to localize bugs. Our approach adaptively creates a bug-specific model to map a particular bug to its possible location, and introduces a novel idea of suspicious words that are highly associated to a bug. We evaluate our approach on 157 real bugs from four software systems, and compare it with a state-of-the-art IR-based bug localization method, a state-of-the-art spectrum-based bug localization method, and three state-of-the-art multi-modal feature location methods that are adapted for bug localization. Experiments show that our approach can outperform the baselines by at least 47.62%, 31.48%, 27.78%, and 28.80% in terms of number of bugs successfully localized when a developer inspects 1, 5, and 10 program elements (i.e., Top 1, Top 5, and Top 10), and Mean Average Precision (MAP) respectively.",
            "Award": ""
        }
    ],
    "Sessions": [
        {
            "Id": "eexuiph4Hu",
            "Title": "Research Papers",
            "ShortTitle": "Research Papers",
            "Type": "Research Papers",
            "ShortType": "Research Papers",
            "Key": "2015-09-02 08:00 Research Papers",
            "Day": "2015-09-02",
            "Time": "08:00 - 18:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "FSE15MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "fse15main-mainid8-p",
                "fse15main-mainid18-p",
                "fse15main-mainid24-p",
                "fse15main-mainid34-p",
                "fse15main-mainid35-p",
                "fse15main-mainid37-p",
                "fse15main-mainid46-p",
                "fse15main-mainid54-p",
                "fse15main-mainid56-p",
                "fse15main-mainid59-p",
                "fse15main-mainid62-p",
                "fse15main-mainid64-p",
                "fse15main-mainid65-p",
                "fse15main-mainid70-p",
                "fse15main-mainid72-p",
                "fse15main-mainid73-p",
                "fse15main-mainid74-p",
                "fse15main-mainid75-p",
                "fse15main-mainid76-p",
                "fse15main-mainid82-p",
                "fse15main-mainid84-p",
                "fse15main-mainid88-p",
                "fse15main-mainid91-p",
                "fse15main-mainid92-p",
                "fse15main-mainid93-p",
                "fse15main-mainid94-p",
                "fse15main-mainid95-p",
                "fse15main-mainid97-p",
                "fse15main-mainid104-p",
                "fse15main-mainid108-p",
                "fse15main-mainid122-p",
                "fse15main-mainid123-p",
                "fse15main-mainid128-p",
                "fse15main-mainid129-p",
                "fse15main-mainid138-p",
                "fse15main-mainid163-p",
                "fse15main-mainid165-p",
                "fse15main-mainid167-p",
                "fse15main-mainid174-p",
                "fse15main-mainid179-p",
                "fse15main-mainid190-p",
                "fse15main-mainid194-p",
                "fse15main-mainid195-p",
                "fse15main-mainid204-p",
                "fse15main-mainid209-p",
                "fse15main-mainid210-p",
                "fse15main-mainid212-p",
                "fse15main-mainid213-p",
                "fse15main-mainid215-p",
                "fse15main-mainid218-p",
                "fse15main-mainid224-p",
                "fse15main-mainid226-p",
                "fse15main-mainid227-p",
                "fse15main-mainid229-p",
                "fse15main-mainid230-p",
                "fse15main-mainid241-p",
                "fse15main-mainid246-p",
                "fse15main-mainid247-p",
                "fse15main-mainid249-p",
                "fse15main-mainid250-p",
                "fse15main-mainid253-p",
                "fse15main-mainid255-p",
                "fse15main-mainid261-p",
                "fse15main-mainid265-p",
                "fse15main-mainid266-p",
                "fse15main-mainid267-p",
                "fse15main-mainid268-p",
                "fse15main-mainid270-p",
                "fse15main-mainid273-p",
                "fse15main-mainid274-p",
                "fse15main-mainid281-p",
                "fse15main-mainid288-p",
                "fse15main-mainid292-p",
                "fse15main-mainid300-p"
            ]
        }
    ],
    "People": [
        {
            "Name": "Mohammed Afraz",
            "Affiliation": "Indian Institute of Science, India",
            "Key": "Mohammed Afraz @ Indian Institute of Science, India",
            "Id": "619497c0eb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Miltiadis Allamanis",
            "Affiliation": "University of Edinburgh, UK",
            "Key": "Miltiadis Allamanis @ University of Edinburgh, UK",
            "Id": "ba2dd90fa2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohamed Almorsy",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Mohamed Almorsy @ Swinburne University of Technology, Australia",
            "Id": "3b8efa6691",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sven Apel",
            "Affiliation": "University of Passau, Germany",
            "Key": "Sven Apel @ University of Passau, Germany",
            "Id": "d2a7f9f3ef",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Paolo Arcaini",
            "Affiliation": "Charles University in Prague, Czech Republic",
            "Key": "Paolo Arcaini @ Charles University in Prague, Czech Republic",
            "Id": "e498c99b03",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andrea Arcuri",
            "Affiliation": "Scienta, Norway / University of Luxembourg, Luxembourg",
            "Key": "Andrea Arcuri @ Scienta, Norway / University of Luxembourg, Luxembourg",
            "Id": "fe5f44ab46",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Abdulbaki Aydin",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Abdulbaki Aydin @ University of California at Santa Barbara, USA",
            "Id": "11b95003b3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gigon Bae",
            "Affiliation": "University of Nebraska-Lincoln, USA",
            "Key": "Gigon Bae @ University of Nebraska-Lincoln, USA",
            "Id": "9b0ecf6d05",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lucas Bang",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Lucas Bang @ University of California at Santa Barbara, USA",
            "Id": "cf1ac5a4a0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Earl T. Barr",
            "Affiliation": "University College London, UK",
            "Key": "Earl T. Barr @ University College London, UK",
            "Id": "1b132df096",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gabriele Bavota",
            "Affiliation": "Free University of Bolzano, Italy",
            "Key": "Gabriele Bavota @ Free University of Bolzano, Italy",
            "Id": "bd712b825f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Farnaz Behrang",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Farnaz Behrang @ Georgia Tech, USA",
            "Id": "facffdbd28",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jonathan Bell",
            "Affiliation": "Columbia University, USA",
            "Key": "Jonathan Bell @ Columbia University, USA",
            "Id": "9ca4bedb7f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Moritz Beller",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Moritz Beller @ Delft University of Technology, Netherlands",
            "Id": "5b615d3d89",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stephany Bellomo",
            "Affiliation": "SEI, USA",
            "Key": "Stephany Bellomo @ SEI, USA",
            "Id": "bc8fc95ccb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Dirk Beyer",
            "Affiliation": "University of Passau, Germany",
            "Key": "Dirk Beyer @ University of Passau, Germany",
            "Id": "0ea1c00b9e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Antonio Bianchi",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Antonio Bianchi @ University of California at Santa Barbara, USA",
            "Id": "7b9563b189",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christian Bird",
            "Affiliation": "Microsoft Research, USA",
            "Key": "Christian Bird @ Microsoft Research, USA",
            "Id": "32cd19efae",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xavier Blanc",
            "Affiliation": "University of Bordeaux, France",
            "Key": "Xavier Blanc @ University of Bordeaux, France",
            "Id": "dc066dc352",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mateus Borges",
            "Affiliation": "Federal University of Pernambuco, Brazil",
            "Key": "Mateus Borges @ Federal University of Pernambuco, Brazil",
            "Id": "2b4f17b23a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Pietro Braione",
            "Affiliation": "University of Milano-Bicocca, Italy",
            "Key": "Pietro Braione @ University of Milano-Bicocca, Italy",
            "Id": "e7455e7b42",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lionel C. Briand",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Lionel C. Briand @ University of Luxembourg, Luxembourg",
            "Id": "a7933979fa",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Thomas Bruckmann",
            "Affiliation": "Delphi Automotive Systems, Luxembourg",
            "Key": "Thomas Bruckmann @ Delphi Automotive Systems, Luxembourg",
            "Id": "018e83b86c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Brumley",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "David Brumley @ Carnegie Mellon University, USA",
            "Id": "070cacf457",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yuriy Brun",
            "Affiliation": "University of Massachusetts, USA",
            "Key": "Yuriy Brun @ University of Massachusetts, USA",
            "Id": "d69a4bd327",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Enrico Budianto",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Enrico Budianto @ National University of Singapore, Singapore",
            "Id": "a2d7e5606e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tevfik Bultan",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Tevfik Bultan @ University of California at Santa Barbara, USA",
            "Id": "c3faceff86",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Brian Burg",
            "Affiliation": "University of Washington, USA",
            "Key": "Brian Burg @ University of Washington, USA",
            "Id": "810a6c52bb",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yan Cai",
            "Affiliation": "Institute of Software at Chinese Academy of Sciences, China",
            "Key": "Yan Cai @ Institute of Software at Chinese Academy of Sciences, China",
            "Id": "3836bfe26b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "José Campos",
            "Affiliation": "University of Sheffield, UK",
            "Key": "José Campos @ University of Sheffield, UK",
            "Id": "542c7a85d3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lingwei Cao",
            "Affiliation": "Institute of Software at Chinese Academy of Sciences, China",
            "Key": "Lingwei Cao @ Institute of Software at Chinese Academy of Sciences, China",
            "Id": "a2f46bd5bd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Carlos Eduardo Bernal Cárdenas",
            "Affiliation": "College of William and Mary, USA",
            "Key": "Carlos Eduardo Bernal Cárdenas @ College of William and Mary, USA",
            "Id": "b1f1742eb2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Casey Casalnuovo",
            "Affiliation": "University of California at Davis, USA",
            "Key": "Casey Casalnuovo @ University of California at Davis, USA",
            "Id": "ac81acb27b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Satish Chandra",
            "Affiliation": "Samsung Research, USA",
            "Key": "Satish Chandra @ Samsung Research, USA",
            "Id": "86435d37f6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fuxiang Chen",
            "Affiliation": "Hong Kong University of Science and Technology, China",
            "Key": "Fuxiang Chen @ Hong Kong University of Science and Technology, China",
            "Id": "24cbcae994",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yuting Chen",
            "Affiliation": "Shanghai Jiao Tong University, China",
            "Key": "Yuting Chen @ Shanghai Jiao Tong University, China",
            "Id": "588afbfcb6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhenyu Chen",
            "Affiliation": "Nanjing University, China",
            "Key": "Zhenyu Chen @ Nanjing University, China",
            "Id": "f61c507746",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Wontae Choi",
            "Affiliation": "University of California at Berkeley, USA",
            "Key": "Wontae Choi @ University of California at Berkeley, USA",
            "Id": "4f03947137",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bill Chu",
            "Affiliation": "University of North Carolina at Charlotte, USA",
            "Key": "Bill Chu @ University of North Carolina at Charlotte, USA",
            "Id": "a410d220d9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jürgen Cito",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Jürgen Cito @ University of Zurich, Switzerland",
            "Id": "576f8f5e20",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Myra B. Cohen",
            "Affiliation": "University of Nebraska-Lincoln, USA",
            "Key": "Myra B. Cohen @ University of Nebraska-Lincoln, USA",
            "Id": "305362f567",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ermira Daka",
            "Affiliation": "University of Sheffield, UK",
            "Key": "Ermira Daka @ University of Sheffield, UK",
            "Id": "757107fa46",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marcelo D'Amorim",
            "Affiliation": "Federal University of Pernambuco, Brazil",
            "Key": "Marcelo D'Amorim @ Federal University of Pernambuco, Brazil",
            "Id": "133c16f4af",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hung Dang",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Hung Dang @ National University of Singapore, Singapore",
            "Id": "032edb7153",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Matthias Dangl",
            "Affiliation": "University of Passau, Germany",
            "Key": "Matthias Dangl @ University of Passau, Germany",
            "Id": "31aadb3a1c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohan Dattatreya",
            "Affiliation": "Electric Cloud, USA",
            "Key": "Mohan Dattatreya @ Electric Cloud, USA",
            "Id": "f4a3bd0977",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Giovanni Denaro",
            "Affiliation": "University of Milano-Bicocca, Italy",
            "Key": "Giovanni Denaro @ University of Milano-Bicocca, Italy",
            "Id": "63eea21302",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ankush Desai",
            "Affiliation": "University of California at Berkeley, USA",
            "Key": "Ankush Desai @ University of California at Berkeley, USA",
            "Id": "6a76fc7425",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Premkumar Devanbu",
            "Affiliation": "University of California at Davis, USA",
            "Key": "Premkumar Devanbu @ University of California at Davis, USA",
            "Id": "f74fb14697",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aritra Dhar",
            "Affiliation": "Xerox Research Center, India",
            "Key": "Aritra Dhar @ Xerox Research Center, India",
            "Id": "cefa40f7f2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mohan Dhawan",
            "Affiliation": "IBM Research, India",
            "Key": "Mohan Dhawan @ IBM Research, India",
            "Id": "14455a662d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Daniel Dietsch",
            "Affiliation": "University of Freiburg, Germany",
            "Key": "Daniel Dietsch @ University of Freiburg, Germany",
            "Id": "1bd0bf9eba",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Massimiliano Di Penta",
            "Affiliation": "University of Sannio, Italy",
            "Key": "Massimiliano Di Penta @ University of Sannio, Italy",
            "Id": "d3bc4f92a1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xiwei Dong",
            "Affiliation": "Wuhan University, China",
            "Key": "Xiwei Dong @ Wuhan University, China",
            "Id": "2fe60fa812",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jonathan Dorn",
            "Affiliation": "University of Virginia, USA",
            "Key": "Jonathan Dorn @ University of Virginia, USA",
            "Id": "dcca05d2db",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Eichberg",
            "Affiliation": "TU Darmstadt, Germany",
            "Key": "Michael Eichberg @ TU Darmstadt, Germany",
            "Id": "0ae24a6111",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sebastian Elbaum",
            "Affiliation": "University of Nebraska-Lincoln, USA",
            "Key": "Sebastian Elbaum @ University of Nebraska-Lincoln, USA",
            "Id": "6d1b38cc6c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Neil A. Ernst",
            "Affiliation": "SEI, USA",
            "Key": "Neil A. Ernst @ SEI, USA",
            "Id": "144ef3a906",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hadi Esmaeilzadeh",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Hadi Esmaeilzadeh @ Georgia Tech, USA",
            "Id": "bd7e4c6b56",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jean-Rémy Falleri",
            "Affiliation": "Bordeaux INP, France",
            "Key": "Jean-Rémy Falleri @ Bordeaux INP, France",
            "Id": "7294cac8fd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xuepeng Fan",
            "Affiliation": "University of California at San Diego, USA",
            "Key": "Xuepeng Fan @ University of California at San Diego, USA",
            "Id": "ead0473532",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chunrong Fang",
            "Affiliation": "Nanjing University, China",
            "Key": "Chunrong Fang @ Nanjing University, China",
            "Id": "f011ea2302",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yang Feng",
            "Affiliation": "University of California at Irvine, USA",
            "Key": "Yang Feng @ University of California at Irvine, USA",
            "Id": "4b6590d7bd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fernando Figueira Filho",
            "Affiliation": "Federal University of Rio Grande do Norte, Brazil",
            "Key": "Fernando Figueira Filho @ Federal University of Rio Grande do Norte, Brazil",
            "Id": "df6cd313c7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Antonio Filieri",
            "Affiliation": "University of Stuttgart, Germany",
            "Key": "Antonio Filieri @ University of Stuttgart, Germany",
            "Id": "dd0736404a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Vladimir Filkov",
            "Affiliation": "University of California at Davis, USA",
            "Key": "Vladimir Filkov @ University of California at Davis, USA",
            "Id": "d5d549c982",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Matthieu Foucault",
            "Affiliation": "University of Bordeaux, France",
            "Key": "Matthieu Foucault @ University of Bordeaux, France",
            "Id": "ac961fbee7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gordon Fraser",
            "Affiliation": "University of Sheffield, UK",
            "Key": "Gordon Fraser @ University of Sheffield, UK",
            "Id": "6773c90dc3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yanick Fratantonio",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Yanick Fratantonio @ University of California at Santa Barbara, USA",
            "Id": "85dce664de",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Thomas Fritz",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Thomas Fritz @ University of Zurich, Switzerland",
            "Id": "acbe1b73ad",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yangchun Fu",
            "Affiliation": "University of Texas at Dallas, USA",
            "Key": "Yangchun Fu @ University of Texas at Dallas, USA",
            "Id": "ed7f64df40",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Juan Pablo Galeotti",
            "Affiliation": "Saarland University, Germany",
            "Key": "Juan Pablo Galeotti @ Saarland University, Germany",
            "Id": "52bddb265b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Harald C. Gall",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Harald C. Gall @ University of Zurich, Switzerland",
            "Id": "18cc7eed78",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Angelo Gargantini",
            "Affiliation": "University of Bergamo, Italy",
            "Key": "Angelo Gargantini @ University of Bergamo, Italy",
            "Id": "e6ac731bae",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Garlan",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "David Garlan @ Carnegie Mellon University, USA",
            "Id": "4c4179303b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Leonid Glanz",
            "Affiliation": "TU Darmstadt, Germany",
            "Key": "Leonid Glanz @ TU Darmstadt, Germany",
            "Id": "503cdc42d4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Liang Gong",
            "Affiliation": "University of California at Berkeley, USA",
            "Key": "Liang Gong @ University of California at Berkeley, USA",
            "Id": "9e180c6201",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ian Gorton",
            "Affiliation": "SEI, USA",
            "Key": "Ian Gorton @ SEI, USA",
            "Id": "a6cb125993",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Georgios Gousios",
            "Affiliation": "Radboud University Nijmegen, Netherlands",
            "Key": "Georgios Gousios @ Radboud University Nijmegen, Netherlands",
            "Id": "17ec50c677",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alexander Grebhahn",
            "Affiliation": "University of Passau, Germany",
            "Key": "Alexander Grebhahn @ University of Passau, Germany",
            "Id": "6f6c135c24",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "John Grundy",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "John Grundy @ Swinburne University of Technology, Australia",
            "Id": "62e2882729",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rui Gu",
            "Affiliation": "Columbia University, USA",
            "Key": "Rui Gu @ Columbia University, USA",
            "Id": "d106e23e09",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shengjian Guo",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Shengjian Guo @ Virginia Tech, USA",
            "Id": "d102484269",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aarti Gupta",
            "Affiliation": "Princeton University, USA",
            "Key": "Aarti Gupta @ Princeton University, USA",
            "Id": "7cbedfcff8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alex Gyori",
            "Affiliation": "University of Illinois at Urbana-Champaign, USA",
            "Key": "Alex Gyori @ University of Illinois at Urbana-Champaign, USA",
            "Id": "f438131ca8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sonia Haiduc",
            "Affiliation": "Florida State University, USA",
            "Key": "Sonia Haiduc @ Florida State University, USA",
            "Id": "3d3ae0d642",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "William G. J. Halfond",
            "Affiliation": "University of Southern California, USA",
            "Key": "William G. J. Halfond @ University of Southern California, USA",
            "Id": "a51ce25fff",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mouna Hammoudi",
            "Affiliation": "University of Nebraska-Lincoln, USA",
            "Key": "Mouna Hammoudi @ University of Nebraska-Lincoln, USA",
            "Id": "cd53301802",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "William Harris",
            "Affiliation": "Georgia Tech, USA",
            "Key": "William Harris @ Georgia Tech, USA",
            "Id": "c50dc60a42",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ahmed E. Hassan",
            "Affiliation": "Queen's University, Canada",
            "Key": "Ahmed E. Hassan @ Queen's University, Canada",
            "Id": "b8aa3f3ff7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Matthias Heizmann",
            "Affiliation": "University of Freiburg, Germany",
            "Key": "Matthias Heizmann @ University of Freiburg, Germany",
            "Id": "9a2317806d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ben Hermann",
            "Affiliation": "TU Darmstadt, Germany",
            "Key": "Ben Hermann @ TU Darmstadt, Germany",
            "Id": "638a45f6c7",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Stefan Heule",
            "Affiliation": "Stanford University, USA",
            "Key": "Stefan Heule @ Stanford University, USA",
            "Id": "470cec10fe",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Henry Hoffmann",
            "Affiliation": "University of Chicago, USA",
            "Key": "Henry Hoffmann @ University of Chicago, USA",
            "Id": "d09e13227d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jeff Huang",
            "Affiliation": "Texas A&M University, USA",
            "Key": "Jeff Huang @ Texas A&M University, USA",
            "Id": "d8fc3f65c8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Matthias Jarke",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Matthias Jarke @ RWTH Aachen University, Germany",
            "Id": "7bae8d8ee0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Simon Jensen",
            "Affiliation": "Snowflake Computing, USA",
            "Key": "Simon Jensen @ Snowflake Computing, USA",
            "Id": "ccb6fefa9a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Guoliang Jin",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Guoliang Jin @ North Carolina State University, USA",
            "Id": "c9b4eee32b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Long Jin",
            "Affiliation": "University of California at San Diego, USA",
            "Key": "Long Jin @ University of California at San Diego, USA",
            "Id": "397e0157d3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xiaoyuan Jing",
            "Affiliation": "Wuhan University, China",
            "Key": "Xiaoyuan Jing @ Wuhan University, China",
            "Id": "aea27bead5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Brittany Johnson",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Brittany Johnson @ North Carolina State University, USA",
            "Id": "2ff3ef7848",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "James A. Jones",
            "Affiliation": "University of California at Irvine, USA",
            "Key": "James A. Jones @ University of California at Irvine, USA",
            "Id": "fd0239a9ea",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christian Kästner",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Christian Kästner @ Carnegie Mellon University, USA",
            "Id": "ab06dc5f51",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gail Kaiser",
            "Affiliation": "Columbia University, USA",
            "Key": "Gail Kaiser @ Columbia University, USA",
            "Id": "e5635dc4c8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yasutaka Kamei",
            "Affiliation": "Kyushu University, Japan",
            "Key": "Yasutaka Kamei @ Kyushu University, Japan",
            "Id": "a9116cc4f1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aditya Kanade",
            "Affiliation": "Indian Institute of Science, India",
            "Key": "Aditya Kanade @ Indian Institute of Science, India",
            "Id": "e93c0fcbe6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ulf Kargén",
            "Affiliation": "Linköping University, Sweden",
            "Key": "Ulf Kargén @ Linköping University, Sweden",
            "Id": "f1affe6104",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rezwana Karim",
            "Affiliation": "Rutgers University, USA",
            "Key": "Rezwana Karim @ Rutgers University, USA",
            "Id": "f96f5ec2df",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Katja Kevic",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Katja Kevic @ University of Zurich, Switzerland",
            "Id": "55aa0711d0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sunghun Kim",
            "Affiliation": "Hong Kong University of Science and Technology, China",
            "Key": "Sunghun Kim @ Hong Kong University of Science and Technology, China",
            "Id": "7cb84e284c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christopher Kruegel",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Christopher Kruegel @ University of California at Santa Barbara, USA",
            "Id": "993eb995a8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Uirá Kulesza",
            "Affiliation": "Federal University of Rio Grande do Norte, Brazil",
            "Key": "Uirá Kulesza @ Federal University of Rio Grande do Norte, Brazil",
            "Id": "2123752e4f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Markus Kusano",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Markus Kusano @ Virginia Tech, USA",
            "Id": "91b8da8249",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tien-Duy B. Le",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Tien-Duy B. Le @ Singapore Management University, Singapore",
            "Id": "a2aca22750",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Claire Le Goues",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Claire Le Goues @ Carnegie Mellon University, USA",
            "Id": "e58c851432",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Philipp Leitner",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Philipp Leitner @ University of Zurich, Switzerland",
            "Id": "e795b2d79d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ding Li",
            "Affiliation": "University of Southern California, USA",
            "Key": "Ding Li @ University of Southern California, USA",
            "Id": "b19b2f39c3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shang-Wei Lin",
            "Affiliation": "Singapore University of Technology and Design, Singapore",
            "Key": "Shang-Wei Lin @ Singapore University of Technology and Design, Singapore",
            "Id": "27f6896e90",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yun Lin",
            "Affiliation": "Fudan University, China",
            "Key": "Yun Lin @ Fudan University, China",
            "Id": "e31a38f610",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhiqiang Lin",
            "Affiliation": "University of Texas at Dallas, USA",
            "Key": "Zhiqiang Lin @ University of Texas at Dallas, USA",
            "Id": "3a92f65f23",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mario Linares-Vásquez",
            "Affiliation": "College of William and Mary, USA",
            "Key": "Mario Linares-Vásquez @ College of William and Mary, USA",
            "Id": "a68fca8437",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Heather Richter Lipford",
            "Affiliation": "University of North Carolina at Charlotte, USA",
            "Key": "Heather Richter Lipford @ University of North Carolina at Charlotte, USA",
            "Id": "eda7ac2b8f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yang Liu",
            "Affiliation": "Nanyang Technological University, Singapore",
            "Key": "Yang Liu @ Nanyang Technological University, Singapore",
            "Id": "1e161b15f8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Benjamin Livshits",
            "Affiliation": "Microsoft Research, USA",
            "Key": "Benjamin Livshits @ Microsoft Research, USA",
            "Id": "14b5c5cb30",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David Lo",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "David Lo @ Singapore Management University, Singapore",
            "Id": "c76da467d6",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fan Long",
            "Affiliation": "Massachusetts Institute of Technology, USA",
            "Key": "Fan Long @ Massachusetts Institute of Technology, USA",
            "Id": "f568e57b75",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shan Lu",
            "Affiliation": "University of Chicago, USA",
            "Key": "Shan Lu @ University of Chicago, USA",
            "Id": "8ba95c45c5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yingjun Lyu",
            "Affiliation": "University of Southern California, USA",
            "Key": "Yingjun Lyu @ University of Southern California, USA",
            "Id": "e166efbb36",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aravind Machiry",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Aravind Machiry @ University of California at Santa Barbara, USA",
            "Id": "e47d00a9d5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martina Maggio",
            "Affiliation": "Lund University, Sweden",
            "Key": "Martina Maggio @ Lund University, Sweden",
            "Id": "a0b6cdc255",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ravi Mangal",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Ravi Mangal @ Georgia Tech, USA",
            "Id": "81b653e022",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shahar Maoz",
            "Affiliation": "Tel Aviv University, Israel",
            "Key": "Shahar Maoz @ Tel Aviv University, Israel",
            "Id": "4897b04930",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andrian Marcus",
            "Affiliation": "University of Texas at Dallas, USA",
            "Key": "Andrian Marcus @ University of Texas at Dallas, USA",
            "Id": "efde0ede86",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Darko Marinov",
            "Affiliation": "University of Illinois at Urbana-Champaign, USA",
            "Key": "Darko Marinov @ University of Illinois at Urbana-Champaign, USA",
            "Id": "42f8151d6a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Reza Matinnejad",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Reza Matinnejad @ University of Luxembourg, Luxembourg",
            "Id": "b6ad1dfc96",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chris Mayhorn",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Chris Mayhorn @ North Carolina State University, USA",
            "Id": "b947a012df",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shane McIntosh",
            "Affiliation": "McGill University, Canada",
            "Key": "Shane McIntosh @ McGill University, Canada",
            "Id": "48d42f91b0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nenad Medvidovic",
            "Affiliation": "University of Southern California, USA",
            "Key": "Nenad Medvidovic @ University of Southern California, USA",
            "Id": "94bf22b69a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Eric Melski",
            "Affiliation": "Electric Cloud, USA",
            "Key": "Eric Melski @ Electric Cloud, USA",
            "Id": "044a225f46",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ali Mesbah",
            "Affiliation": "University of British Columbia, Canada",
            "Key": "Ali Mesbah @ University of British Columbia, Canada",
            "Id": "af25c350f0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bertrand Meyer",
            "Affiliation": "ETH Zurich, Switzerland",
            "Key": "Bertrand Meyer @ ETH Zurich, Switzerland",
            "Id": "d04f8f019e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mira Mezini",
            "Affiliation": "TU Darmstadt, Germany",
            "Key": "Mira Mezini @ TU Darmstadt, Germany",
            "Id": "0c6d3a3d8a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Audris Mockus",
            "Affiliation": "University of Tennessee, USA",
            "Key": "Audris Mockus @ University of Tennessee, USA",
            "Id": "96ddc0544d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kevin Moran",
            "Affiliation": "College of William and Mary, USA",
            "Key": "Kevin Moran @ College of William and Mary, USA",
            "Id": "a6e6d9a528",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gabriel A. Moreno",
            "Affiliation": "SEI, USA",
            "Key": "Gabriel A. Moreno @ SEI, USA",
            "Id": "faf7c1a549",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Javier Cámara Moreno",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Javier Cámara Moreno @ Carnegie Mellon University, USA",
            "Id": "ea6d327092",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Laura Moreno",
            "Affiliation": "University of Texas at Dallas, USA",
            "Key": "Laura Moreno @ University of Texas at Dallas, USA",
            "Id": "b2b8e6ace2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gail C. Murphy",
            "Affiliation": "University of British Columbia, Canada",
            "Key": "Gail C. Murphy @ University of British Columbia, Canada",
            "Id": "1a7aa2ee08",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Emerson Murphy-Hill",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Emerson Murphy-Hill @ North Carolina State University, USA",
            "Id": "481759418b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Erdal Mutlu",
            "Affiliation": "Koç University, Turkey",
            "Key": "Erdal Mutlu @ Koç University, Turkey",
            "Id": "307b13c063",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Meiyappan Nagappan",
            "Affiliation": "Rochester Institute of Technology, USA",
            "Key": "Meiyappan Nagappan @ Rochester Institute of Technology, USA",
            "Id": "96f914faea",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nachiappan Nagappan",
            "Affiliation": "Microsoft Research, USA",
            "Key": "Nachiappan Nagappan @ Microsoft Research, USA",
            "Id": "da10cfd150",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mayur Naik",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Mayur Naik @ Georgia Tech, USA",
            "Id": "775a94b44b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jaechang Nam",
            "Affiliation": "Hong Kong University of Science and Technology, China",
            "Key": "Jaechang Nam @ Hong Kong University of Science and Technology, China",
            "Id": "b80978fc60",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sebastian Nanz",
            "Affiliation": "ETH Zurich, Switzerland",
            "Key": "Sebastian Nanz @ ETH Zurich, Switzerland",
            "Id": "4cf5f53a2c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "George Necula",
            "Affiliation": "University of California at Berkeley, USA",
            "Key": "George Necula @ University of California at Berkeley, USA",
            "Id": "d242676a8e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shiva Nejati",
            "Affiliation": "University of Luxembourg, Luxembourg",
            "Key": "Shiva Nejati @ University of Luxembourg, Luxembourg",
            "Id": "ec6a1a73c9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hung Viet Nguyen",
            "Affiliation": "Iowa State University, USA",
            "Key": "Hung Viet Nguyen @ Iowa State University, USA",
            "Id": "d0b0a0fde3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tien N. Nguyen",
            "Affiliation": "Iowa State University, USA",
            "Key": "Tien N. Nguyen @ Iowa State University, USA",
            "Id": "174b3462f4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tuong Huan Nguyen",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Tuong Huan Nguyen @ Swinburne University of Technology, Australia",
            "Id": "3867d87325",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Robert L. Nord",
            "Affiliation": "SEI, USA",
            "Key": "Robert L. Nord @ SEI, USA",
            "Id": "6e984ab8f4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Aditya V. Nori",
            "Affiliation": "Microsoft Research, UK",
            "Key": "Aditya V. Nori @ Microsoft Research, UK",
            "Id": "750bc0bae4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Richard J. Oentaryo",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Richard J. Oentaryo @ Singapore Management University, Singapore",
            "Id": "04c2dabf55",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rocco Oliveto",
            "Affiliation": "University of Molise, Italy",
            "Key": "Rocco Oliveto @ University of Molise, Italy",
            "Id": "b119469c75",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Alessandro Orso",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Alessandro Orso @ Georgia Tech, USA",
            "Id": "8d64bd1adf",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Ipek Ozkaya",
            "Affiliation": "SEI, USA",
            "Key": "Ipek Ozkaya @ SEI, USA",
            "Id": "6bca38b492",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Marc Palyart",
            "Affiliation": "University of British Columbia, Canada",
            "Key": "Marc Palyart @ University of British Columbia, Canada",
            "Id": "c3544690e5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Annibale Panichella",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Annibale Panichella @ Delft University of Technology, Netherlands",
            "Id": "835be8545b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Inian Parameshwaran",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Inian Parameshwaran @ National University of Singapore, Singapore",
            "Id": "3d4ffaf231",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jongse Park",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Jongse Park @ Georgia Tech, USA",
            "Id": "94061f9b83",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Corina S. Păsăreanu",
            "Affiliation": "Carnegie Mellon University, USA / NASA Ames Research Center, USA",
            "Key": "Corina S. Păsăreanu @ Carnegie Mellon University, USA / NASA Ames Research Center, USA",
            "Id": "fb2367ade1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shankar Pasupathy",
            "Affiliation": "NetApp, USA",
            "Key": "Shankar Pasupathy @ NetApp, USA",
            "Id": "65add8306d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xin Peng",
            "Affiliation": "Fudan University, China",
            "Key": "Xin Peng @ Fudan University, China",
            "Id": "822e10ae4a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mauro Pezzè",
            "Affiliation": "University of Milano-Bicocca, Italy",
            "Key": "Mauro Pezzè @ University of Milano-Bicocca, Italy",
            "Id": "33be073188",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Denys Poshyvanyk",
            "Affiliation": "College of William and Mary, USA",
            "Key": "Denys Poshyvanyk @ College of William and Mary, USA",
            "Id": "7be5b43df0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Pradel",
            "Affiliation": "TU Darmstadt, Germany",
            "Key": "Michael Pradel @ TU Darmstadt, Germany",
            "Id": "6d5dc6fa96",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christian R. Prause",
            "Affiliation": "DLR, Germany",
            "Key": "Christian R. Prause @ DLR, Germany",
            "Id": "3edaa879ef",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rahul Purandare",
            "Affiliation": "IIIT Delhi, India",
            "Key": "Rahul Purandare @ IIIT Delhi, India",
            "Id": "5d6eb93242",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shaz Qadeer",
            "Affiliation": "Microsoft Research, USA",
            "Key": "Shaz Qadeer @ Microsoft Research, USA",
            "Id": "75d00e4de0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fumin Qi",
            "Affiliation": "Wuhan University, China",
            "Key": "Fumin Qi @ Wuhan University, China",
            "Id": "015fb4bc62",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shengchao Qin",
            "Affiliation": "Teesside University, UK",
            "Key": "Shengchao Qin @ Teesside University, UK",
            "Id": "e082c6fe04",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Murali Krishna Ramanathan",
            "Affiliation": "Indian Institute of Science, India",
            "Key": "Murali Krishna Ramanathan @ Indian Institute of Science, India",
            "Id": "5584f97f17",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Suresh Rangaswamy",
            "Affiliation": "IIIT Delhi, India",
            "Key": "Suresh Rangaswamy @ IIIT Delhi, India",
            "Id": "2ae20bb006",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Lawrence Rauchwerger",
            "Affiliation": "Texas A&M University, USA",
            "Key": "Lawrence Rauchwerger @ Texas A&M University, USA",
            "Id": "49e46bc8d9",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Michael Reif",
            "Affiliation": "TU Darmstadt, Germany",
            "Key": "Michael Reif @ TU Darmstadt, Germany",
            "Id": "06419d014f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Elvinia Riccobene",
            "Affiliation": "University of Milan, Italy",
            "Key": "Elvinia Riccobene @ University of Milan, Italy",
            "Id": "b9a20f9b24",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Martin Rinard",
            "Affiliation": "Massachusetts Institute of Technology, USA",
            "Key": "Martin Rinard @ Massachusetts Institute of Technology, USA",
            "Id": "19f6157c90",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jan Oliver Ringert",
            "Affiliation": "Tel Aviv University, Israel",
            "Key": "Jan Oliver Ringert @ Tel Aviv University, Israel",
            "Id": "42b84d3d85",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Romain Robbes",
            "Affiliation": "University of Chile, Chile",
            "Key": "Romain Robbes @ University of Chile, Chile",
            "Id": "5e68ba6262",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gregg Rothermel",
            "Affiliation": "University of Nebraska-Lincoln, USA",
            "Key": "Gregg Rothermel @ University of Nebraska-Lincoln, USA",
            "Id": "1a6579005f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Barbara Russo",
            "Affiliation": "Free University of Bolzano, Italy",
            "Key": "Barbara Russo @ Free University of Bolzano, Italy",
            "Id": "9097c8d369",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Atul Sadhu",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Atul Sadhu @ National University of Singapore, Singapore",
            "Id": "dfc05717ba",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Caitlin Sadowski",
            "Affiliation": "Google, USA",
            "Key": "Caitlin Sadowski @ Google, USA",
            "Id": "61b1cebc25",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Gholamreza Safi",
            "Affiliation": "University of Southern California, USA",
            "Key": "Gholamreza Safi @ University of Southern California, USA",
            "Id": "8ea1b3ffd4",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Diptikalyan Saha",
            "Affiliation": "IBM Research, India",
            "Key": "Diptikalyan Saha @ IBM Research, India",
            "Id": "2af16266b5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Malavika Samak",
            "Affiliation": "Indian Institute of Science, India",
            "Key": "Malavika Samak @ Indian Institute of Science, India",
            "Id": "075cee41d1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Prateek Saxena",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Prateek Saxena @ National University of Singapore, Singapore",
            "Id": "0a0ae5381a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bradley Schmerl",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Bradley Schmerl @ Carnegie Mellon University, USA",
            "Id": "0c3c44e662",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Koushik Sen",
            "Affiliation": "University of California at Berkeley, USA",
            "Key": "Koushik Sen @ University of California at Berkeley, USA",
            "Id": "1adefc9a60",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Sanjit A. Seshia",
            "Affiliation": "University of California at Berkeley, USA",
            "Key": "Sanjit A. Seshia @ University of California at Berkeley, USA",
            "Id": "8482c42511",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Timothy R. Shaffer",
            "Affiliation": "Youngstown State University, USA",
            "Key": "Timothy R. Shaffer @ Youngstown State University, USA",
            "Id": "3191d0cbc5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Arman Shahbazian",
            "Affiliation": "University of Southern California, USA",
            "Key": "Arman Shahbazian @ University of Southern California, USA",
            "Id": "815ea07eed",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nahid Shahmehri",
            "Affiliation": "Linköping University, Sweden",
            "Key": "Nahid Shahmehri @ Linköping University, Sweden",
            "Id": "86ef332619",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bonita Sharif",
            "Affiliation": "Youngstown State University, USA",
            "Key": "Bonita Sharif @ Youngstown State University, USA",
            "Id": "6836fb0504",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "David C. Shepherd",
            "Affiliation": "ABB, USA",
            "Key": "David C. Shepherd @ ABB, USA",
            "Id": "523879c079",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "August Shi",
            "Affiliation": "University of Illinois at Urbana-Champaign, USA",
            "Key": "August Shi @ University of Illinois at Urbana-Champaign, USA",
            "Id": "69c59e2d1e",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Shweta Shinde",
            "Affiliation": "National University of Singapore, Singapore",
            "Key": "Shweta Shinde @ National University of Singapore, Singapore",
            "Id": "c5a482c71c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Norbert Siegmund",
            "Affiliation": "University of Passau, Germany",
            "Key": "Norbert Siegmund @ University of Passau, Germany",
            "Id": "90b8da6c1f",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Nishant Sinha",
            "Affiliation": "IBM Research, India",
            "Key": "Nishant Sinha @ IBM Research, India",
            "Id": "3d43a2baa0",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Edward K. Smith",
            "Affiliation": "University of Massachusetts at Amherst, USA",
            "Key": "Edward K. Smith @ University of Massachusetts at Amherst, USA",
            "Id": "927222d743",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Justin Smith",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Justin Smith @ North Carolina State University, USA",
            "Id": "17837682dd",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Linhai Song",
            "Affiliation": "University of Wisconsin-Madison, USA",
            "Key": "Linhai Song @ University of Wisconsin-Madison, USA",
            "Id": "7f57a43d4a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Manu Sridharan",
            "Affiliation": "Samsung Research, USA",
            "Key": "Manu Sridharan @ Samsung Research, USA",
            "Id": "33db1291bc",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andreas Stahlbauer",
            "Affiliation": "University of Passau, Germany",
            "Key": "Andreas Stahlbauer @ University of Passau, Germany",
            "Id": "0868026148",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Kathryn Stolee",
            "Affiliation": "Iowa State University, USA",
            "Key": "Kathryn Stolee @ Iowa State University, USA",
            "Id": "8b0e9d7672",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhendong Su",
            "Affiliation": "University of California at Davis, USA",
            "Key": "Zhendong Su @ University of California at Davis, USA",
            "Id": "0f765a0139",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jun Sun",
            "Affiliation": "Singapore University of Technology and Design, Singapore",
            "Key": "Jun Sun @ Singapore University of Technology and Design, Singapore",
            "Id": "db65254787",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Charles Sutton",
            "Affiliation": "University of Edinburgh, UK",
            "Key": "Charles Sutton @ University of Edinburgh, UK",
            "Id": "5879dc70ed",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Rukma Talwadker",
            "Affiliation": "NetApp, USA",
            "Key": "Rukma Talwadker @ NetApp, USA",
            "Id": "f206a03745",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Éric Tanter",
            "Affiliation": "University of Chile, Chile",
            "Key": "Éric Tanter @ University of Chile, Chile",
            "Id": "80bf64cd99",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Serdar Tasiran",
            "Affiliation": "Koç University, Turkey",
            "Key": "Serdar Tasiran @ Koç University, Turkey",
            "Id": "a5e5a89c30",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Christoph Treude",
            "Affiliation": "Federal University of Rio Grande do Norte, Brazil",
            "Key": "Christoph Treude @ Federal University of Rio Grande do Norte, Brazil",
            "Id": "ee2f742543",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Bogdan Vasilescu",
            "Affiliation": "University of California at Davis, USA",
            "Key": "Bogdan Vasilescu @ University of California at Davis, USA",
            "Id": "51fa14dbbe",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mario Linares Vásquez",
            "Affiliation": "College of William and Mary, USA",
            "Key": "Mario Linares Vásquez @ College of William and Mary, USA",
            "Id": "f804cfda53",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Giovanni Vigna",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Giovanni Vigna @ University of California at Santa Barbara, USA",
            "Id": "5b47eca983",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Braden M. Walters",
            "Affiliation": "Youngstown State University, USA",
            "Key": "Braden M. Walters @ Youngstown State University, USA",
            "Id": "92d1e9f4fe",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Mian Wan",
            "Affiliation": "University of Southern California, USA",
            "Key": "Mian Wan @ University of Southern California, USA",
            "Id": "00fe0f6912",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Chao Wang",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Chao Wang @ Virginia Tech, USA",
            "Id": "13bfb1daa3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Huaimin Wang",
            "Affiliation": "National University of Defense Technology, China",
            "Key": "Huaimin Wang @ National University of Defense Technology, China",
            "Id": "d10f5f34a2",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Westley Weimer",
            "Affiliation": "University of Virginia, USA",
            "Key": "Westley Weimer @ University of Virginia, USA",
            "Id": "62857d2235",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Allaire Welk",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Allaire Welk @ North Carolina State University, USA",
            "Id": "439e1e4d3b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Scott West",
            "Affiliation": "Google, Switzerland",
            "Key": "Scott West @ Google, Switzerland",
            "Id": "81e6329c4c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Jim Witschey",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Jim Witschey @ North Carolina State University, USA",
            "Id": "6042f98e17",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Fei Wu",
            "Affiliation": "Wuhan University, China",
            "Key": "Fei Wu @ Wuhan University, China",
            "Id": "42268e735b",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Hao Xiao",
            "Affiliation": "Nanyang Technological University, Singapore",
            "Key": "Hao Xiao @ Nanyang Technological University, Singapore",
            "Id": "a582df41f1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zhenchang Xing",
            "Affiliation": "Nanyang Technological University, Singapore",
            "Key": "Zhenchang Xing @ Nanyang Technological University, Singapore",
            "Id": "d01327844c",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Baowen Xu",
            "Affiliation": "Nanjing University, China",
            "Key": "Baowen Xu @ Nanjing University, China",
            "Id": "ba5a057321",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tianyin Xu",
            "Affiliation": "University of California at San Diego, USA",
            "Key": "Tianyin Xu @ University of California at San Diego, USA",
            "Id": "579903a7c1",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Zijiang Yang",
            "Affiliation": "Western Michigan University, USA",
            "Key": "Zijiang Yang @ Western Michigan University, USA",
            "Id": "868b09bee8",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yu Yue",
            "Affiliation": "National University of Defense Technology, China",
            "Key": "Yu Yue @ National University of Defense Technology, China",
            "Id": "98e51bc3ec",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Tifany Yung",
            "Affiliation": "University of Illinois at Urbana-Champaign, USA",
            "Key": "Tifany Yung @ University of Illinois at Urbana-Champaign, USA",
            "Id": "de82cfbbb5",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Andy Zaidman",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Andy Zaidman @ Delft University of Technology, Netherlands",
            "Id": "252d01ab59",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Xin Zhang",
            "Affiliation": "Georgia Tech, USA",
            "Key": "Xin Zhang @ Georgia Tech, USA",
            "Id": "adced20b48",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yucheng Zhang",
            "Affiliation": "University of British Columbia, Canada",
            "Key": "Yucheng Zhang @ University of British Columbia, Canada",
            "Id": "c4314e81df",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Wenyun Zhao",
            "Affiliation": "Fudan University, China",
            "Key": "Wenyun Zhao @ Fudan University, China",
            "Id": "648b81dcad",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Diwen Zheng",
            "Affiliation": "Fudan University, China",
            "Key": "Diwen Zheng @ Fudan University, China",
            "Id": "c635f46eb3",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Qimu Zheng",
            "Affiliation": "Peking University, China",
            "Key": "Qimu Zheng @ Peking University, China",
            "Id": "3734b70b0a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Minghui Zhou",
            "Affiliation": "Peking University, China",
            "Key": "Minghui Zhou @ Peking University, China",
            "Id": "5396b29196",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Yuanyuan Zhou",
            "Affiliation": "University of California at San Diego, USA",
            "Key": "Yuanyuan Zhou @ University of California at San Diego, USA",
            "Id": "35079f7c8d",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Linjie Zhu",
            "Affiliation": "University of Wisconsin-Madison, USA",
            "Key": "Linjie Zhu @ University of Wisconsin-Madison, USA",
            "Id": "72817298ef",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Olga Zielinska",
            "Affiliation": "North Carolina State University, USA",
            "Key": "Olga Zielinska @ North Carolina State University, USA",
            "Id": "96576a7a1a",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        },
        {
            "Name": "Thomas Zimmermann",
            "Affiliation": "Microsoft Research, USA",
            "Key": "Thomas Zimmermann @ Microsoft Research, USA",
            "Id": "68eee09b14",
            "Bio": "",
            "URL": "",
            "URLphoto": "",
            "URLmsa": "",
            "URLgs": ""
        }
    ]
}
 
