{
    "DataRevision": 1487831380,
    "Preliminary": "false",
    "Event": "3DUI 2017",
    "Name": "3DUI 2017",
    "NameFull": "2017 IEEE Symposium on 3D User Interfaces (3DUI)",
    "Description": "",
    "Date": "March 18-19, 2017",
    "DateStart": "2017-03-18",
    "DateEnd": "2017-03-19",
    "Location": "Los Angeles, CA, USA",
    "Sponsors": "",
    "URL": "http://3dui.org/",
    "MultiTrack": "false",
    "UseMiniPage": "true",
    "NewPagePerDay": "false",
    "TableLayout": "false",
    "NumOfParallelTracks": 1,
    "HorizontalAlign": "false",
    "Organization": {
        "General Chairs": [
        ],
        "PC Chairs": [
                "Maud Marchal",
                "Robert J. Teather",
                "Bruce Thomas"
        ]
    },
    "SocialFeeds": [
    ],
    "VenueInfo": {
        "Name": "",
        "GPS": {
            "Latitude": 0,
            "Longitude": 0
        }
    },
    "InfoPage": {
        "xaml": "foo",
        "Elements": [
            {
                "XamlName": "ConferenceCenterMap",
                "Type": "Map",
                "GPS": {
                    "Latitude": 0,
                    "Longitude": 0
                },
                "MapLabel": ""
            },
            {
                "XamlName": "LicenseButton",
                "Type": "WebLink",
                "URL": "http://research.microsoft.com/en-US/projects/confapp/terms.aspx"
            },
            {
                "XamlName": "PrivacyButton",
                "Type": "WebLink",
                "URL": "http://privacy.microsoft.com/en-us/default.msp"
            }
        ]
    },
    "SessionPriorities": [
        "Award",
        "Invited Talk",
        "Other"
    ],
    "Items": [
        {
            "Title": "Message from the Chairs",
            "Type": "Frontmatter",
            "Track": "Frontmatter",
            "Key": "tdui17foreword-fm001-p",
            "URL": "",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Maud Marchal, Robert J. Teather, and Bruce Thomas",
            "AffiliationsString": "IRISA, France; Carleton University, Canada; University of South Australia, Australia",
            "Authors": [
                "Maud Marchal @ IRISA, France",
                "Robert J. Teather @ Carleton University, Canada",
                "Bruce Thomas @ University of South Australia, Australia"
            ],
            "Affiliations": [
                "IRISA, France",
                "Carleton University, Canada",
                "University of South Australia, Australia"
            ],
            "Abstract": "",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Pano: Design and Evaluation of a 360° Through-the-Lens Technique",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-162-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDamien+Clergeaud+and+Pascal+Guitton+%22Pano%3A+Design+and+Evaluation+of+a+360%C2%B0+Through-the-Lens+Technique%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Damien Clergeaud and Pascal Guitton",
            "AffiliationsString": "Inria, France; University of Bordeaux, France",
            "Authors": [
                "Damien Clergeaud @ Inria, France",
                "Pascal Guitton @ University of Bordeaux, France"
            ],
            "Affiliations": [
                "Inria, France",
                "University of Bordeaux, France"
            ],
            "Abstract": "Virtual Reality experiments have enabled immersed users to perform virtual tasks in a Virtual Environment (VE). Before beginning a task, however, users must locate and select the different objects they will need in the VE. This first step is important and affects global performance in the virtual task. If a user takes too long to locate and select an object, the duration of the task is increased. Moreover, both the comfort and global efficiency of users deteriorate as search and selection time increase. We have developed Pano, a technique which reduces this time by increasing the user’s “natural” field of view. More precisely, we provide a 360° panoramic virtual image which is displayed on a specific window, called the PanoWindow. Thanks to the PanoWindow, users can perceive and interact with the part of the Virtual Environment (VE) that is behind them without any additional head or body movement. In this paper, we present two user studies with 30 and 21 participants in different VEs. For the first study, participants were invited to perform object-finding tasks with and without Pano. The second study involved position-estimating tasks in order to know if the PanoWindow image enables users to build an accurate representation of the environment. First, the results show that Pano both reduces task duration and improves user comfort. Second, they demonstrate that good object-localization accuracy can be achieved using Pano.",
            "Award": "",
            "Keywords": "3D interaction;  Virtual Reality;  Selection task;  Awareness;  User Study"
        },
        {
            "Title": "Towards Efficient Spatial Compression in Self-Overlapping Virtual Environments",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-191-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKhrystyna+Vasylevska+and+Hannes+Kaufmann+%22Towards+Efficient+Spatial+Compression+in+Self-Overlapping+Virtual+Environments%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Khrystyna Vasylevska and Hannes Kaufmann",
            "AffiliationsString": "Vienna University of Technology, Austria",
            "Authors": [
                "Khrystyna Vasylevska @ Vienna University of Technology, Austria",
                "Hannes Kaufmann @ Vienna University of Technology, Austria"
            ],
            "Affiliations": [
                "Vienna University of Technology, Austria",
                "Vienna University of Technology, Austria"
            ],
            "Abstract": "Space available for any virtual reality experience is often strictly limited and abridges the virtual world to a size of a room. To extend the amount of virtual space accessible by walking within the same real workspace the methods of spatial compression were proposed. Scene manipulation with a controlled spatial overlap has been shown to be an efficient method. However, in order to apply space compression effectively for a dynamic, scalable and robust 3D user interface, it is important to study how the human perceives different layouts with overlapping spaces. In this paper, we explore the influence of the properties of the layout used on human spatial perception in a physically impossible spatial arrangement. Our first reported study focuses on the following parameters of the path within a simple self-overlapping layout: number of turns, relative door positions, sequences of counter- and clockwise turns, symmetry and asymmetry of the path used. In addition, in the second study we explore the effect of path smoothing by substituting the right-angled corridors by smooth curves. Our studies show that usage of the smooth curved corridors is more beneficial for spatial compression than the conventional right-angled approach.",
            "Award": "",
            "Keywords": "Perception;  user study;  virtual reality"
        },
        {
            "Title": "Increasing Optical Tracking Workspace of VR Applications using Controlled Cameras",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-212-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DGuillaume+Cortes%2C+Eric+Marchand%2C+J%C3%A9r%C3%B4me+Ardouin%2C+and+Anatole+L%C3%A9cuyer+%22Increasing+Optical+Tracking+Workspace+of+VR+Applications+using+Controlled+Cameras%22",
            "URLvideo": "https%3A%2F%2Ffilesender.renater.fr%2F%3Fs%3Ddownload%26token%3D3fc9b55d-9203-94a8-f1f9-388f3c59959e",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Guillaume Cortes, Eric Marchand, Jérôme Ardouin, and Anatole Lécuyer",
            "AffiliationsString": "Realyz, France; University of Rennes 1, France; Inria, France",
            "Authors": [
                "Guillaume Cortes @ Realyz, France",
                "Eric Marchand @ University of Rennes 1, France",
                "Jérôme Ardouin @ n.n., n.n.",
                "Anatole Lécuyer @ Inria, France"
            ],
            "Affiliations": [
                "Realyz, France",
                "University of Rennes 1, France",
                "n.n., n.n.",
                "Inria, France"
            ],
            "Abstract": "We propose an approach to greatly increase the tracking workspace of VR applications without adding new sensors. Our approach relies on controlled cameras able to follow the tracked markers all around the VR workspace providing 6DoF tracking data. We designed the proof-of-concept of such approach based on two consumer-grade cameras and a pan-tilt head. The resulting tracking workspace could be greatly increased depending on the actuators’ range of motion. The accuracy error and jitter were found to be rather limited during camera motion (resp. 0.3cm and 0.02cm). Therefore, whenever the final VR application does not require a perfect tracking accuracy over the entire workspace, we recommend using our approach in order to enlarge the tracking workspace.",
            "Award": "",
            "Keywords": "Optical tracking;  workspace;  controlled camera;  virtual reality"
        },
        {
            "Title": "An Arm-Mounted Inertial Controller for 6DOF Input: Design and Evaluation",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-118-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DThomas+Young%2C+Robert+Teather%2C+and+Scott+MacKenzie+%22An+Arm-Mounted+Inertial+Controller+for+6DOF+Input%3A+Design+and+Evaluation%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Thomas Young, Robert Teather, and Scott MacKenzie",
            "AffiliationsString": "York University, Canada; Carleton University, Canada",
            "Authors": [
                "Thomas Young @ York University, Canada",
                "Robert Teather @ Carleton University, Canada",
                "Scott MacKenzie @ York University, Canada"
            ],
            "Affiliations": [
                "York University, Canada",
                "Carleton University, Canada",
                "York University, Canada"
            ],
            "Abstract": "We designed a low-cost arm-mounted wearable 3D input device that uses inertial measurement units as an alternative to existing tracking systems requiring fixed frames of reference. The device employs inertial sensors to derive a 3D cursor position through natural arm movement. We also explore three methods of indicating selection with the device, one entirely software based (dwell), one using a twist gesture, and one relying on buttons. To address the paucity of research reporting human performance metrics across comparable interfaces, we quantify the performance of this new device through a point selection experiment and compare results from a similar study.",
            "Award": "",
            "Keywords": "User interfaces; human-centered computing; pointing devices"
        },
        {
            "Title": "Exploring Natural Eye-Gaze-Based Interaction for Immersive Virtual Reality",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-121-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DThammathip+Piumsomboon%2C+Gun+Lee%2C+Robert+Lindeman%2C+and+Mark+Billinghurst+%22Exploring+Natural+Eye-Gaze-Based+Interaction+for+Immersive+Virtual+Reality%22",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2FEpCGqxkmBKE",
            "URLinfo": "http%3A%2F%2Fwww.empathiccomputing.org%2F",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Thammathip Piumsomboon, Gun Lee, Robert Lindeman, and Mark Billinghurst",
            "AffiliationsString": "University of South Australia, Australia; HIT Lab, New Zealand",
            "Authors": [
                "Thammathip Piumsomboon @ University of South Australia, Australia",
                "Gun Lee @ University of South Australia, Australia",
                "Robert Lindeman @ HIT Lab, New Zealand",
                "Mark Billinghurst @ University of South Australia, Australia"
            ],
            "Affiliations": [
                "University of South Australia, Australia",
                "University of South Australia, Australia",
                "HIT Lab, New Zealand",
                "University of South Australia, Australia"
            ],
            "Abstract": "Eye tracking technology in a head-mounted display has undergone rapid advancement in recent years, making it possible for researchers to explore new interaction techniques using natural eye movements. This paper explores three novel eye-gaze-based interaction techniques: (1) Duo-Reticles, eye-gaze selection based on eye-gaze and inertial reticles, (2) Radial Pursuit, cluttered-object selection that takes advantage of smooth pursuit, and (3) Nod and Roll, head-gesture-based interaction based on the vestibulo-ocular reflex. In an initial user study, we compare each technique against a baseline condition in a scenario that demonstrates its strengths and weaknesses.",
            "Award": "",
            "Keywords": "eye tracking;  virtual reality;  interaction techniques"
        },
        {
            "Title": "A Reliable Non-verbal Vocal Input Metaphor for Clicking",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-133-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDaniel+Zielasko%2C+Neha+Neha%2C+Benjamin+Weyers%2C+and+Torsten+W.+Kuhlen+%22A+Reliable+Non-verbal+Vocal+Input+Metaphor+for+Clicking%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Daniel Zielasko, Neha Neha, Benjamin Weyers, and Torsten W. Kuhlen",
            "AffiliationsString": "RWTH Aachen University, Germany",
            "Authors": [
                "Daniel Zielasko @ RWTH Aachen University, Germany",
                "Neha Neha @ RWTH Aachen University, Germany",
                "Benjamin Weyers @ RWTH Aachen University, Germany",
                "Torsten W. Kuhlen @ RWTH Aachen University, Germany"
            ],
            "Affiliations": [
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany"
            ],
            "Abstract": "While experiencing an immersive virtual environment a suitable trigger metaphor is often needed, e.g. for the interaction with objects out of physical reach or system control. The BlowClick approach [Zielasko2015] that is based on non-verbal vocal input has been proven to be a valuable trigger technique in previous work. However, its original detection method is vulnerable to false positives and, thus, is limited in its potential use. Therefore, we extended the existing approach by adding machine learning methods to reliably classify blowing events. We found a support vector machine with Gaussian kernel performing the best with at least the same latency and more precision than before. Furthermore, we added acoustic feedback to the NVVI trigger, which increases the user’s confidence and whose absence was also stated as a limitation of the previous work. With this extended technique, we repeated the conducted Fitts’ law experiment with 33 participants and could confirm that it is possible to use NVVI as a reliable trigger as part of a hands-free point-andclick interface. Furthermore, we tested reaction times to measure the trigger’s performance without the influence of pointing and calculated device throughputs to ensure comparability.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Specimen Box: A Tangible Interaction Technique for World-Fixed Virtual Reality Displays",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-176-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDavid+Zielinski%2C+Derek+Nankivil%2C+and+Regis+Kopper+%22Specimen+Box%3A+A+Tangible+Interaction+Technique+for+World-Fixed+Virtual+Reality+Displays%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "David Zielinski, Derek Nankivil, and Regis Kopper",
            "AffiliationsString": "Duke University, USA",
            "Authors": [
                "David Zielinski @ Duke University, USA",
                "Derek Nankivil @ Duke University, USA",
                "Regis Kopper @ Duke University, USA"
            ],
            "Affiliations": [
                "Duke University, USA",
                "Duke University, USA",
                "Duke University, USA"
            ],
            "Abstract": "Object selection and manipulation in world-fixed displays such as CAVE-type systems are typically achieved with tracked input devices, which lack the tangibility of real-world interactions. Conversely, due to the visual blockage of the real world, head-mounted displays allow the use of many types of real world objects that can convey realistic haptic feedback. To bridge this gap, we propose Specimen Box, an interaction technique that allows users to naturally hold a plausible physical object while manipulating virtual content inside it. This virtual content is rendered based on the tracked position of the box in relation to the user&#039;s point of view. Specimen Box provides the weight and tactile feel of an actual object and does not occlude rendered objects in the scene. The end result is that the user sees the virtual content as if it exists inside the clear physical box. We hypothesize that the effect of holding a physical box, which is a valid part of the overall scenario, would improve user performance and experience. To verify this hypothesis, we conducted a user study which involved a cognitively loaded inspection task requiring extensive manipulation of the box. We compared Specimen Box to Grab-and-Twirl, a naturalistic bimanual manipulation technique that closely mimics the mechanics of our proposed technique. Results show that in our specific task, performance was significantly faster and rotation rate was significantly lower with Specimen Box. Further, performance of the control technique was positively affected by experience with Specimen Box.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "The Effects of Presentation Method and Simulation Fidelity on Psychomotor Education in a Bimanual Metrology Training Simulation",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-172-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJeffrey+Bertrand%2C+Ayush+Bhargava%2C+Kapil+Chalil+Madathil%2C+Anand+Gramopadhye%2C+and+Sabarish+V.+Babu+%22The+Effects+of+Presentation+Method+and+Simulation+Fidelity+on+Psychomotor+Education+in+a+Bimanual+Metrology+Training+Simulation%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Jeffrey Bertrand, Ayush Bhargava, Kapil Chalil Madathil, Anand Gramopadhye, and Sabarish V. Babu",
            "AffiliationsString": "Clemson University, USA",
            "Authors": [
                "Jeffrey Bertrand @ Clemson University, USA",
                "Ayush Bhargava @ Clemson University, USA",
                "Kapil Chalil Madathil @ Clemson University, USA",
                "Anand Gramopadhye @ Clemson University, USA",
                "Sabarish V. Babu @ Clemson University, USA"
            ],
            "Affiliations": [
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA"
            ],
            "Abstract": "In this study, we empirically evaluated the effects of presentation method and simulation fidelity on task performance and psychomotor skills acquisition in an immersive bimanual simulation towards precision metrology education. In a 2 x 2 experiment design, we investigated a large-screen immersive display (LSID) with a head-mounted display (HMD), and the presence versus absence of gravity. Advantages of the HMD include interacting with the simulation in a more natural manner as compared to using a large-screen immersive display due to the similarities between the interactions afforded in the virtual compared to the real-world task. Suspending the laws of physics may have an effect on usability and in turn could affect learning outcomes. Our dependent variables consisted of a pre and post cognition questionnaire, quantitative performance measures, perceived workload and system usefulness, and a psychomotor assessment to measure to what extent transfer of learning took place from the virtual to the real world. Results indicate that the HMD condition was preferable to the immersive display in several metrics while the no-gravity condition resulted in users adopting strategies that were not advantageous for task performance.",
            "Award": "",
            "Keywords": "artificial;  augmented;  virtual realities"
        },
        {
            "Title": "Evaluation of Approaching-Strategies of Temporarily Required Virtual Assistants in Immersive Environments",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-136-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAndrea+B%C3%B6nsch%2C+Tom+Vierjahn%2C+and+Torsten+W.+Kuhlen+%22Evaluation+of+Approaching-Strategies+of+Temporarily+Required+Virtual+Assistants+in+Immersive+Environments%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Andrea Bönsch, Tom Vierjahn, and Torsten W. Kuhlen",
            "AffiliationsString": "RWTH Aachen University, Germany",
            "Authors": [
                "Andrea Bönsch @ RWTH Aachen University, Germany",
                "Tom Vierjahn @ RWTH Aachen University, Germany",
                "Torsten W. Kuhlen @ RWTH Aachen University, Germany"
            ],
            "Affiliations": [
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany"
            ],
            "Abstract": "Embodied, virtual agents provide users assistance in agent-based support systems. To this end, two closely linked factors have to be considered for the agents’ behavioral design: their presence time (PT), i.e., the time in which the agents are visible, and the approaching time (AT), i.e., the time span between the user’s calling for an agent and the agent’s actual availability.  This work focuses on human-like assistants that are embedded in immersive scenes but that are required only temporarily. To the best of our knowledge, guidelines for a suitable trade-off between PT and AT of these assistants do not yet exist. We address this gap by presenting the results of a controlled within-subjects study in a CAVE. While keeping a low PT so that the agent is not perceived as annoying, three strategies affecting the AT, namely fading, walking, and running, are evaluated by 40 subjects. The results indicate no clear preference for either behavior. Instead, the necessity of a better trade-off between a low AT and an agent’s realistic behavior is demonstrated.",
            "Award": "",
            "Keywords": "H.5.2 [User Interfaces]: Evaluation/Methodology— User-Centered Design;  I.3.7 [Computer Graphics]: Three- Dimensional Graphics and Realism—Virtual Reality; "
        },
        {
            "Title": "Comparing Leaning-Based Motion Cueing Interfaces for Virtual Reality Locomotion",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-211-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAlexandra+Kitson%2C+Abraham+M.+Hashemian%2C+Ekaterina+R.+Stepanova%2C+Ernst+Kruijff%2C+and+Bernhard+E.+Riecke+%22Comparing+Leaning-Based+Motion+Cueing+Interfaces+for+Virtual+Reality+Locomotion%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Alexandra Kitson, Abraham M. Hashemian, Ekaterina R. Stepanova, Ernst Kruijff, and Bernhard E. Riecke",
            "AffiliationsString": "Simon Fraser University, Canada; Bonn-Rhein-Sieg University of Applied Sciences, Germany",
            "Authors": [
                "Alexandra Kitson @ Simon Fraser University, Canada",
                "Abraham M. Hashemian @ Simon Fraser University, Canada",
                "Ekaterina R. Stepanova @ Simon Fraser University, Canada",
                "Ernst Kruijff @ Bonn-Rhein-Sieg University of Applied Sciences, Germany",
                "Bernhard E. Riecke @ Simon Fraser University, Canada"
            ],
            "Affiliations": [
                "Simon Fraser University, Canada",
                "Simon Fraser University, Canada",
                "Simon Fraser University, Canada",
                "Bonn-Rhein-Sieg University of Applied Sciences, Germany",
                "Simon Fraser University, Canada"
            ],
            "Abstract": "In this paper, we describe a user study comparing five different locomotion interfaces for virtual reality locomotion. We compared a standard non-motion cueing interface, Joystick (Xbox), with four motion cueing interfaces, NaviChair (stool with springs), MuvMan (sit/stand active stool), Head-Directed (Oculus Rift DK2), and Swivel Chair (everyday office chair with leaning capability). Each interface had two degrees of freedom to move forward/backward and rotate using velocity (rate) control. The aim of this mixed methods study was to better understand relevant user experience factors and guide the design of future locomotion interfaces. This study employed methods from HCI to provide an understanding of why users behave a certain way while using the interface and to unearth any new issues with the design. Participants were tasked to search for objects in a virtual city while they provided talk-aloud feedback and we logged their behaviour. Subsequently, they completed a post-experimental questionnaire on their experience. We found that the qualitative themes of control, usability, and experience echoed the results of the questionnaire, providing internal validity. The quantitative measures revealed the Joystick to be significantly more comfortable and precise than the motion cueing interfaces. However, the qualitative feedback and interviews showed this was due to the reduced perceived controllability and safety of the motion cueing interfaces. Designers of these interfaces should consider using a backrest if users need to lean backwards and avoid using velocity-control for rotations when using HMDs.",
            "Award": "",
            "Keywords": "Active locomotion;  motion cueing;  natural user interface;  virtual reality;  virtual locomotion"
        },
        {
            "Title": "Evaluating Perceived Distance Measures in Room-Scale Spaces using Consumer-Grade Head Mounted Displays",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-204-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAlex+Peer+and+Kevin+Ponto+%22Evaluating+Perceived+Distance+Measures+in+Room-Scale+Spaces+using+Consumer-Grade+Head+Mounted+Displays%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Alex Peer and Kevin Ponto",
            "AffiliationsString": "University of Wisconsin-Madison, USA",
            "Authors": [
                "Alex Peer @ University of Wisconsin-Madison, USA",
                "Kevin Ponto @ University of Wisconsin-Madison, USA"
            ],
            "Affiliations": [
                "University of Wisconsin-Madison, USA",
                "University of Wisconsin-Madison, USA"
            ],
            "Abstract": "Distance misperception (sometimes, distance compression) in immersive virtual environments is an active area of study, and the recent availability of consumer-grade display and tracking technologies raises new questions. This work explores the plausibility of measuring misperceptions within the small tracking volumes of consumer-grade technology, whether measures practical within this space are directly comparable, and if contemporary displays induce distance misperceptions.",
            "Award": "",
            "Keywords": "I.3.7 [Computing Methodologies]: Graphics Utilities—Virtual reality"
        },
        {
            "Title": "Force and Vibrotactile Integration for 3D User Interaction within Virtual Environments",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-197-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAida+Erfanian%2C+Stanley+Tarng%2C+Yaoping+Hu%2C+J%C3%A9r%C3%A9my+Plouzeau%2C+and+Frederic+Merienne+%22Force+and+Vibrotactile+Integration+for+3D+User+Interaction+within+Virtual+Environments%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Aida Erfanian, Stanley Tarng, Yaoping Hu, Jérémy Plouzeau, and Frederic Merienne",
            "AffiliationsString": "University of Calgary, Canada; LE2I, France",
            "Authors": [
                "Aida Erfanian @ University of Calgary, Canada",
                "Stanley Tarng @ University of Calgary, Canada",
                "Yaoping Hu @ University of Calgary, Canada",
                "Jérémy Plouzeau @ LE2I, France",
                "Frederic Merienne @ LE2I, France"
            ],
            "Affiliations": [
                "University of Calgary, Canada",
                "University of Calgary, Canada",
                "University of Calgary, Canada",
                "LE2I, France",
                "LE2I, France"
            ],
            "Abstract": "Proper integration of sensory cues facilitates 3D user interaction within virtual environments (VEs). Studies on multi-sensory integration of visual and haptic cues revealed that the integration follows maximum likelihood estimation (MLE). Little effort focuses however on integrating force and vibrotactile cues – two sub-categorical cues of the haptic modality. Hence, this paper presents an investigation on MLE’s suitability for integrating these sub-categorical cues. Within a stereoscopic VE, human users performed a 3D interactive task of navigating a flying drone along a high-voltage transmission line in an inaccessible region and identifying defects on the line. The users had to identify defects via individual force or vibrotactile cues, and their combinations in co-located and dislocated settings. The co-located setting provided both cues on the right hand of the users; whereas the dislocated setting delivered the force and vibrotactile cues on the right hand and forearm of the users, respectively. Task performance of the users, such as completion time and accuracy, was assessed under each cue and setting. The presence of the vibrotactile cue promoted a better performance than the force cue alone. This was in agreement with the role of tactile cues in sensing surface properties, herein setting a baseline for using MLE. The task performance under the co-located setting indicated certain degrees of combining those under the individual cues. In contrast, the performance under the dislocated setting was alike that under the individual vibrotactile cue. These observations imply an inconclusiveness of MLE to integrate both cues in a co-located setting for 3D user interaction.",
            "Award": "",
            "Keywords": "3D user interaction;  force and vibrotactile cues;  sensory integration;  maximum likelihood estimation;  user performance"
        },
        {
            "Title": "Vibrotactile Assistance for User Guidance Towards Selection Targets in VR and the Cognitive Resources Involved",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-173-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMarkus+Lange%2C+Oscar+Javier+Ariza+N%C3%BA%C3%B1ez%2C+Gerd+Bruder%2C+and+Frank+Steinicke+%22Vibrotactile+Assistance+for+User+Guidance+Towards+Selection+Targets+in+VR+and+the+Cognitive+Resources+Involved%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Markus Lange, Oscar Javier Ariza Núñez, Gerd Bruder, and Frank Steinicke",
            "AffiliationsString": "University of Würzburg, Germany; University of Hamburg, Germany; University of Central Florida, USA",
            "Authors": [
                "Markus Lange @ University of Würzburg, Germany",
                "Oscar Javier Ariza Núñez @ University of Hamburg, Germany",
                "Gerd Bruder @ University of Central Florida, USA",
                "Frank Steinicke @ University of Hamburg, Germany"
            ],
            "Affiliations": [
                "University of Würzburg, Germany",
                "University of Hamburg, Germany",
                "University of Central Florida, USA",
                "University of Hamburg, Germany"
            ],
            "Abstract": "The selection of objects in virtual reality (VR) located on the periphery and outside the field of view (FOV) requires a visual search by rotations of the HMD, which can reduce the performance of interaction. Our work explores the use of a pair of self-made wireless and wearable devices which once attached to the user’s head provide assistive vibrotactile cues for guidance in order to reduce the time used to turn and locate a target object. We present an experiment based on a dual-tasking method to analyze cognitive demands and performance metrics during a selection task.",
            "Award": "",
            "Keywords": "Vibrotactile feedback;  selection;  cognitive demands"
        },
        {
            "Title": "Spatialized Vibrotactile Feedback Contributes to Goal-Directed Movements in Cluttered Virtual Environments",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-180-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DC%C3%A9phise+Louison%2C+Fabien+Ferlay%2C+and+Daniel+R.+Mestre+%22Spatialized+Vibrotactile+Feedback+Contributes+to+Goal-Directed+Movements+in+Cluttered+Virtual+Environments%22",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2FgWGwNQ6j0Kc",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Céphise Louison, Fabien Ferlay, and Daniel R. Mestre",
            "AffiliationsString": "CEA, France; Institute of Movement Sciences, France",
            "Authors": [
                "Céphise Louison @ CEA, France",
                "Fabien Ferlay @ CEA, France",
                "Daniel R. Mestre @ Institute of Movement Sciences, France"
            ],
            "Affiliations": [
                "CEA, France",
                "CEA, France",
                "Institute of Movement Sciences, France"
            ],
            "Abstract": "In virtual reality (VR), spatial awareness is a dominant research topic. It plays an essential role in the assessment of human operators’ behavior within virtual environments (VE), notably for the evaluation of the feasibility of manual maintenance tasks in cluttered industrial settings. In such contexts, it is decisive to evaluate the spatial and temporal correspondence between the operator’s movement kinematics and that of his/her virtual avatar in the virtual environment. Often, in a cluttered VE, direct kinesthetic (force) feedback is limited or absent. We tested whether vibrotactile (cutaneous) feedback would increase visuo-proprioceptive consistency, spatial awareness, and thus the validity of VR studies, by augmenting the perception of the operator’s contact(s) with virtual objects. We present preliminary experimental results, obtained using a head-mounted display (HMD) during a goal-directed task in a cluttered VE. Data suggest that spatialized vibrotactile feedback contributes to visuo-proprioceptive consistency.",
            "Award": "",
            "Keywords": "Visuo-proprioceptive consistency;  Vibrotactile;  Goal-directed movements;  Cluttered environments"
        },
        {
            "Title": "FlexiFingers: Multi-finger Interaction in VR Combining Passive Haptics and Pseudo-Haptics",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-213-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMerwan+Achibet%2C+Beno%C3%AEt+Le+Gouis%2C+Maud+Marchal%2C+Pierre-Alexandre+L%C3%A9ziart%2C+Fernando+Argelaguet-Sanz%2C+Adrien+Girard%2C+Anatole+L%C3%A9cuyer%2C+and+Hiroyuki+Kajimoto+%22FlexiFingers%3A+Multi-finger+Interaction+in+VR+Combining+Passive+Haptics+and+Pseudo-Haptics%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Merwan Achibet, Benoît Le Gouis, Maud Marchal, Pierre-Alexandre Léziart, Fernando Argelaguet-Sanz, Adrien Girard, Anatole Lécuyer, and Hiroyuki Kajimoto",
            "AffiliationsString": "Inria, France; IRISA, France; ENS, France; University of Electro-Communications, Japan",
            "Authors": [
                "Merwan Achibet @ Inria, France",
                "Benoît Le Gouis @ IRISA, France",
                "Maud Marchal @ IRISA, France",
                "Pierre-Alexandre Léziart @ ENS, France",
                "Fernando Argelaguet-Sanz @ Inria, France",
                "Adrien Girard @ Inria, France",
                "Anatole Lécuyer @ Inria, France",
                "Hiroyuki Kajimoto @ University of Electro-Communications, Japan"
            ],
            "Affiliations": [
                "Inria, France",
                "IRISA, France",
                "IRISA, France",
                "ENS, France",
                "Inria, France",
                "Inria, France",
                "Inria, France",
                "University of Electro-Communications, Japan"
            ],
            "Abstract": "3D interaction in virtual reality often requires to manipulate and feel virtual objects with our fingers. Although existing haptic interfaces can be used for this purpose (e.g. force-feedback exoskeleton gloves), they are still bulky and expensive. In this paper, we introduce a novel multi-finger device called &quot;FlexiFingers&quot; that constrains each digit individually and produces elastic force-feedback. FlexiFingers leverages passive haptics in order to offer a lightweight, modular, and affordable alternative to active devices. Moreover, we combine Flexifingers with a pseudo-haptic approach that simulates different levels of stiffness when interacting with virtual objects. We illustrate how this combination of passive haptics and pseudo-haptics can benefit multi-finger interaction through several use cases related to music learning and medical training. Those examples suggest that our approach could find applications in various domains that require an accessible and portable way of providing haptic feedback to the fingers.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Interpretation of Navigation Information Modulates the Effect of the Waist-Type Hanger Reflex on Walking",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-130-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYuki+Kon%2C+Takuto+Nakamura%2C+and+Hiroyuki+Kajimoto+%22Interpretation+of+Navigation+Information+Modulates+the+Effect+of+the+Waist-Type+Hanger+Reflex+on+Walking%22",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2FgaKdE0by22o",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Yuki Kon, Takuto Nakamura, and Hiroyuki Kajimoto",
            "AffiliationsString": "University of Electro-Communications, Japan",
            "Authors": [
                "Yuki Kon @ University of Electro-Communications, Japan",
                "Takuto Nakamura @ University of Electro-Communications, Japan",
                "Hiroyuki Kajimoto @ University of Electro-Communications, Japan"
            ],
            "Affiliations": [
                "University of Electro-Communications, Japan",
                "University of Electro-Communications, Japan",
                "University of Electro-Communications, Japan"
            ],
            "Abstract": "The Hanger Reflex is a phenomenon in which the head rotates unintentionally when force is applied via a wire hanger placed on the head. This phenomenon is caused by physical pressure on the skin, and the direction of the Hanger Reflex modulated by the direction of skin deformation. A previous study examined the use of the head-, waist-, and ankle-type Hanger Reflex on walking navigation without interpretation of navigation information, and found that the waist-type Hanger Reflex had the strongest effect on walking. However, the existing waist-type Hanger Reflex device is passive; i.e. must be operated by the user, which leads to the necessity of developing a new active type device for use as part of a navigational system. In this paper, we developed a controlled waist-type Hanger Reflex device with four pneumatic actuators. We investigated different interpretations of navigation information on the effect of our device on walking. Our interpretation conditions included “Natural”, in which users did not attempt to interpret the navigation information, “Follow”, and “Resist”, in which they actively followed, or resisted the navigation information, respectively. We confirmed that our waist-type Hanger Reflex device could control the walking path and body direction, depending on user’s interpretation of the navigational information.",
            "Award": "",
            "Keywords": "Hanger Reflex;  Navigation;  Walking;  Pseudo-Force"
        },
        {
            "Title": "Bookshelf and Bird: Enabling Real Walking in Large VR Spaces through Cell-Based Redirection",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-198-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRun+Yu%2C+Wallace+Lages%2C+Mahdi+Nabiyouni%2C+Brandon+Ray%2C+Navyaram+Kondur%2C+Vikram+Chandrashekar%2C+and+Doug+Bowman+%22Bookshelf+and+Bird%3A+Enabling+Real+Walking+in+Large+VR+Spaces+through+Cell-Based+Redirection%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DAS65-h_CvVs",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Run Yu, Wallace Lages, Mahdi Nabiyouni, Brandon Ray, Navyaram Kondur, Vikram Chandrashekar, and Doug Bowman",
            "AffiliationsString": "Virginia Tech, USA",
            "Authors": [
                "Run Yu @ Virginia Tech, USA",
                "Wallace Lages @ Virginia Tech, USA",
                "Mahdi Nabiyouni @ Virginia Tech, USA",
                "Brandon Ray @ Virginia Tech, USA",
                "Navyaram Kondur @ Virginia Tech, USA",
                "Vikram Chandrashekar @ Virginia Tech, USA",
                "Doug Bowman @ Virginia Tech, USA"
            ],
            "Affiliations": [
                "Virginia Tech, USA",
                "Virginia Tech, USA",
                "Virginia Tech, USA",
                "Virginia Tech, USA",
                "Virginia Tech, USA",
                "Virginia Tech, USA",
                "Virginia Tech, USA"
            ],
            "Abstract": "We present two novel redirection techniques to enable real walking in large virtual environments (VEs) using only “room-scale” tracked spaces. The techniques, called Bookshelf and Bird, provide narrative-consistent redirection to keep the user inside the physical space, and require the user to walk to explore the VE. The underlying concept, called cell-based redirection, is to divide the virtual world into discrete cells that have the same size as the physical tracking space. The techniques then can redirect the users without altering the relationship between the user, the physical space, and the virtual cell. In this way, users can always access the entire cell using real walking.",
            "Award": "",
            "Keywords": "Locomotion;  virtual reality;  walking;  redirection"
        },
        {
            "Title": "Optimized Graph Extraction and Locomotion Prediction for Redirected Walking",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-132-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMarkus+Zank+and+Andreas+Kunz+%22Optimized+Graph+Extraction+and+Locomotion+Prediction+for+Redirected+Walking%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Markus Zank and Andreas Kunz",
            "AffiliationsString": "ETH Zurich, Switzerland",
            "Authors": [
                "Markus Zank @ ETH Zurich, Switzerland",
                "Andreas Kunz @ ETH Zurich, Switzerland"
            ],
            "Affiliations": [
                "ETH Zurich, Switzerland",
                "ETH Zurich, Switzerland"
            ],
            "Abstract": "Redirected walking with advanced planners such as MPCRed or FORCE requires both knowledge about the virtual environment - mostly in the form of a skeleton graph representing the virtual environment - and a robust prediction of the user&#039;s actions. This paper presents methods for both parts and evaluates them with a number of test cases.  Since frame rate is crucial for a virtual reality application, the computationally heavy extraction and preprocessing of the skeleton graph is done offline while only parts directly linked to the user&#039;s behavior such as the prediction are done online. The prediction is done using a target-based long-term prediction and the targets are determined automatically and combined with targets predefined by the designer of the virtual environment.  The methods presented here provide a graph that is well suited for planning redirection and allows prediction techniques previously only demonstrated in studies to be applied to large scale virtual environments.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "COMS-VR: Mobile Virtual Reality Entertainment System using Electric Car and Head-Mounted Display",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-149-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRyo+Kodama%2C+Masahiro+Koge%2C+Shun+Taguchi%2C+and+Hiroyuki+Kajimoto+%22COMS-VR%3A+Mobile+Virtual+Reality+Entertainment+System+using+Electric+Car+and+Head-Mounted+Display%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Ryo Kodama, Masahiro Koge, Shun Taguchi, and Hiroyuki Kajimoto",
            "AffiliationsString": "TOYOTA Central R&D Labs, Japan; University of Electro-Communications, Japan",
            "Authors": [
                "Ryo Kodama @ TOYOTA Central R&D Labs, Japan",
                "Masahiro Koge @ University of Electro-Communications, Japan",
                "Shun Taguchi @ TOYOTA Central R&D Labs, Japan",
                "Hiroyuki Kajimoto @ University of Electro-Communications, Japan"
            ],
            "Affiliations": [
                "TOYOTA Central R&D Labs, Japan",
                "University of Electro-Communications, Japan",
                "TOYOTA Central R&D Labs, Japan",
                "University of Electro-Communications, Japan"
            ],
            "Abstract": "We propose a novel virtual reality entertainment system using a car as a motion platform. Motion platforms present a sensation of motion to the user using powerful actuators. Combined with virtual reality content, including surrounding visual, auditory and tactile displays, such systems can provide and immersive experience. However, the space and cost requirements for installation of motion platforms are large. To overcome this issue, we propose to use a car as a motion platform. We developed a prototype system composed of a head mounted display, a one-person electric car and an automatic driving algorithm. We developed and tested immersive content in which users ride on a trolley in a virtual space. All users responded quite positively to the experience.",
            "Award": "",
            "Keywords": "Virtual reality;  entertainment;  head-mounted display;  motion platform;  mobile;  car"
        },
        {
            "Title": "Efficient Approximate Computation of Scene Visibility Based on Navigation Meshes and Applications for Navigation and Scene Analysis",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-137-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSebastian+Freitag%2C+Benjamin+Weyers%2C+and+Torsten+W.+Kuhlen+%22Efficient+Approximate+Computation+of+Scene+Visibility+Based+on+Navigation+Meshes+and+Applications+for+Navigation+and+Scene+Analysis%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Sebastian Freitag, Benjamin Weyers, and Torsten W. Kuhlen",
            "AffiliationsString": "RWTH Aachen University, Germany",
            "Authors": [
                "Sebastian Freitag @ RWTH Aachen University, Germany",
                "Benjamin Weyers @ RWTH Aachen University, Germany",
                "Torsten W. Kuhlen @ RWTH Aachen University, Germany"
            ],
            "Affiliations": [
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany",
                "RWTH Aachen University, Germany"
            ],
            "Abstract": "Scene visibility - the information of which parts of the scene are visible from a certain location—can be used to derive various properties of a virtual environment. For example, it enables the computation of viewpoint quality to determine the informativeness of a viewpoint, helps in constructing virtual tours, and allows to keep track of the objects a user may already have seen. However, computing visibility at runtime may be too computationally expensive for many applications, while sampling the entire scene beforehand introduces a costly precomputation step and may include many samples not needed later on.  Therefore, in this paper, we propose a novel approach to precompute visibility information based on navigation meshes, a polygonal representation of a scene’s navigable areas. We show that with only limited precomputation, high accuracy can be achieved in these areas. Furthermore, we demonstrate the usefulness of the approach by means of several applications, including viewpoint quality computation, landmark and room detection, and exploration assistance. In addition, we present a travel interface based on common visibility that we found to result in less cybersickness in a user study.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Gesture Elicitation for 3D Travel via Multi-touch and Mid-Air Systems for Procedurally Generated Pseudo-Universe",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-214-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DFrancisco+R.+Ortega%2C+Alain+Galvan%2C+Katherine+Tarre%2C+Armando+Barreto%2C+Naphtali+Rishe%2C+Jonathan+Bernal%2C+Ruben+Balcazar%2C+and+Jason-Lee+Thomas+%22Gesture+Elicitation+for+3D+Travel+via+Multi-touch+and+Mid-Air+Systems+for+Procedurally+Generated+Pseudo-Universe%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Francisco R. Ortega, Alain Galvan, Katherine Tarre, Armando Barreto, Naphtali Rishe, Jonathan Bernal, Ruben Balcazar, and Jason-Lee Thomas",
            "AffiliationsString": "Florida International University, USA",
            "Authors": [
                "Francisco R. Ortega @ Florida International University, USA",
                "Alain Galvan @ Florida International University, USA",
                "Katherine Tarre @ Florida International University, USA",
                "Armando Barreto @ Florida International University, USA",
                "Naphtali Rishe @ Florida International University, USA",
                "Jonathan Bernal @ Florida International University, USA",
                "Ruben Balcazar @ Florida International University, USA",
                "Jason-Lee Thomas @ Florida International University, USA"
            ],
            "Affiliations": [
                "Florida International University, USA",
                "Florida International University, USA",
                "Florida International University, USA",
                "Florida International University, USA",
                "Florida International University, USA",
                "Florida International University, USA",
                "Florida International University, USA",
                "Florida International University, USA"
            ],
            "Abstract": "With the introduction of new input devices, a series of questions have been raised in regard to making user interaction more intuitive -- in particular, preferred gestures for different tasks. Our study looks into how to find a gesture set for 3D travel using a multi-touch display and a mid-air device to improve user interaction. We conducted a user study with 30 subjects, concluding that users preferred simple gestures for multi-touch. In addition, we found that multi-touch user legacy carried over mid-Air interaction. Finally, we propose a gesture set for both type of interactions.",
            "Award": "",
            "Keywords": "3D navigation;  Gesture evaluation;  Multi-Touch;  mid-air;  gestures;  travel;  3d travel;  user interafaces;  user study"
        },
        {
            "Title": "Mid-Air Modeling with Boolean Operations in VR",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-182-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDaniel+Mendes%2C+Daniel+Medeiros%2C+Maur%C3%ADcio+Sousa%2C+Ricardo+Ferreira%2C+Alberto+Barbosa+Raposo%2C+Alfredo+Ferreira%2C+and+Joaquim+Jorge+%22Mid-Air+Modeling+with+Boolean+Operations+in+VR%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Daniel Mendes, Daniel Medeiros, Maurício Sousa, Ricardo Ferreira, Alberto Barbosa Raposo, Alfredo Ferreira, and Joaquim Jorge",
            "AffiliationsString": "INESC-ID, Portugal; Técnico Lisboa, Portugal; PUC-Rio, Brazil",
            "Authors": [
                "Daniel Mendes @ INESC-ID, Portugal",
                "Daniel Medeiros @ INESC-ID, Portugal",
                "Maurício Sousa @ INESC-ID, Portugal",
                "Ricardo Ferreira @ Técnico Lisboa, Portugal",
                "Alberto Barbosa Raposo @ PUC-Rio, Brazil",
                "Alfredo Ferreira @ INESC-ID, Portugal",
                "Joaquim Jorge @ INESC-ID, Portugal"
            ],
            "Affiliations": [
                "INESC-ID, Portugal",
                "INESC-ID, Portugal",
                "INESC-ID, Portugal",
                "Técnico Lisboa, Portugal",
                "PUC-Rio, Brazil",
                "INESC-ID, Portugal",
                "INESC-ID, Portugal"
            ],
            "Abstract": "Virtual Reality (VR) is again in the spotlight. However, interactions and modeling operations are still major hurdles to its complete success. To make VR Interaction viable, many have proposed mid-air techniques because of their naturalness and resemblance to physical world operations. Still, natural mid-air metaphors for Constructive Solid Geometry (CSG) are still elusive. This is unfortunate, because CSG is a powerful enabler for more complex modeling tasks, allowing to create complex objects from simple ones via Boolean operations. Moreover, Head-Mounted Displays occlude the real self, and make it difficult for users to be aware of their relationship to the virtual environment. In this paper we propose two new techniques to achieve Boolean operations between two objects in VR. One is based on direct-manipulation via gestures while the other uses menus. We conducted a preliminary evaluation of these techniques. Due to tracking limitations, results allowed no significant conclusions to be drawn. To account for self-representation, we compared full-body avatar against an iconic cursor depiction of users&#039; hands. In this matter, the simplified hands-only representation improved efficiency in CSG modelling tasks.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Spatial and Rotation Invariant 3D Gesture Recognition Based on Sparse Representation",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-215-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DFerran+Argelaguet%2C+M%C3%A9lanie+Ducoffe%2C+Remi+Gribonval%2C+and+Anatole+L%C3%A9cuyer+%22Spatial+and+Rotation+Invariant+3D+Gesture+Recognition+Based+on+Sparse+Representation%22",
            "URLvideo": "https%3A%2F%2Fdl.dropboxusercontent.com%2Fu%2F4225888%2FVideos%2F2017-GestureRecognition.mpg",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Ferran Argelaguet, Mélanie Ducoffe, Remi Gribonval, and Anatole Lécuyer",
            "AffiliationsString": "Inria, France; ENS, France",
            "Authors": [
                "Ferran Argelaguet @ Inria, France",
                "Mélanie Ducoffe @ ENS, France",
                "Remi Gribonval @ Inria, France",
                "Anatole Lécuyer @ Inria, France"
            ],
            "Affiliations": [
                "Inria, France",
                "ENS, France",
                "Inria, France",
                "Inria, France"
            ],
            "Abstract": "Advances in motion tracking technology, especially for commodity hardware, still require robust 3D gesture recognition in order to fully exploit the benefits of natural user interfaces. In this paper, we introduce a novel 3D gesture recognition algorithm based on the sparse representation of 3D human motion. The sparse representation of human motion provides a set of features that can be used to efficiently classify gestures in real-time. Compared to existing gesture recognition systems, sparse representation, the proposed approach enables full spatial and rotation invariance and provides high tolerance to noise. Moreover, the proposed classification scheme takes into account the inter-user variability which increases gesture classification accuracy in user-independent scenarios. We validated our approach with existing motion databases for gestural interaction and performed a user evaluation with naive subjects to show its robustness to arbitrarily defined gestures. The results showed that our classification scheme has high classification accuracy for user-independent scenarios even with users who have different handedness. We believe that sparse representation of human motion will pave the way for a new generation of 3D gesture recognition systems in order to fully open the potential of natural user interfaces.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Classic3D and Single3D: Two Unimanual Techniques for Constrained 3D Manipulations on Tablet PCs",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-110-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSiju+Wu%2C+Aylen+Ricca%2C+Amine+Chellali%2C+and+Samir+Otmane+%22Classic3D+and+Single3D%3A+Two+Unimanual+Techniques+for+Constrained+3D+Manipulations+on+Tablet+PCs%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Siju Wu, Aylen Ricca, Amine Chellali, and Samir Otmane",
            "AffiliationsString": "University of Evry, France",
            "Authors": [
                "Siju Wu @ University of Evry, France",
                "Aylen Ricca @ University of Evry, France",
                "Amine Chellali @ University of Evry, France",
                "Samir Otmane @ University of Evry, France"
            ],
            "Affiliations": [
                "University of Evry, France",
                "University of Evry, France",
                "University of Evry, France",
                "University of Evry, France"
            ],
            "Abstract": "Standard 3D widgets are used for object manipulation in desktop CAD applications but are less suited for use on touchscreens. We propose two 3D constrained manipulation techniques for Tablet PCs. Using finger identification, the dominant hand&#039;s index, middle and ring fingers are mapped with the X, Y and Z axes. Users can then trigger different manipulation tasks using specific chording gestures. A user study to assess usability and efficiency permitted to identify the gestures that are the most suitable for each manipulation task. Some design recommendations for an efficient 3D constrained manipulations technique are presented.",
            "Award": "",
            "Keywords": "Touch-based interaction;  Finger identification;  3D manipulation;  Interaction techniques;  Mobiles devices"
        },
        {
            "Title": "Watchcasting: Freehand 3D Interaction with Off-the-Shelf Smartwatch",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-199-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKrzysztof+Pietroszek%2C+Liudmila+Tahai%2C+James+R.+Wallace%2C+and+Edward+Lank+%22Watchcasting%3A+Freehand+3D+Interaction+with+Off-the-Shelf+Smartwatch%22",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2F5s-jFkaKwoY",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Krzysztof Pietroszek, Liudmila Tahai, James R. Wallace, and Edward Lank",
            "AffiliationsString": "California State University at Monterey Bay, USA; University of Waterloo, Canada",
            "Authors": [
                "Krzysztof Pietroszek @ California State University at Monterey Bay, USA",
                "Liudmila Tahai @ University of Waterloo, Canada",
                "James R. Wallace @ University of Waterloo, Canada",
                "Edward Lank @ University of Waterloo, Canada"
            ],
            "Affiliations": [
                "California State University at Monterey Bay, USA",
                "University of Waterloo, Canada",
                "University of Waterloo, Canada",
                "University of Waterloo, Canada"
            ],
            "Abstract": "We describe a mid-air, watch-based 3D interaction technique called Watchcasting. The technique enables target selection and translation by mapping z-coordinate position to forearm rotation. By replicat- ing a large display 3D selection study, we show that Watchcasting provides comparable performance to smartphone (Smartcasting) and electrical impedance myography (Myopoint) techniques. Our work demonstrates that an off-the-shelf smartwatch is a practical alternative for 3D interaction using specialized devices.",
            "Award": "",
            "Keywords": "3D pointing;  large screens;  3D interaction;  wearables"
        },
        {
            "Title": "Adaptive User Perspective Rendering for Handheld Augmented Reality",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-167-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPeter+Mohr%2C+Markus+Tatzgern%2C+Jens+Grubert%2C+Dieter+Schmalstieg%2C+and+Denis+Kalkofen+%22Adaptive+User+Perspective+Rendering+for+Handheld+Augmented+Reality%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Peter Mohr, Markus Tatzgern, Jens Grubert, Dieter Schmalstieg, and Denis Kalkofen",
            "AffiliationsString": "Graz University of Technology, Austria; Salzburg University of Applied Sciences, Austria; Coburg University, Germany",
            "Authors": [
                "Peter Mohr @ Graz University of Technology, Austria",
                "Markus Tatzgern @ Salzburg University of Applied Sciences, Austria",
                "Jens Grubert @ Coburg University, Germany",
                "Dieter Schmalstieg @ Graz University of Technology, Austria",
                "Denis Kalkofen @ Graz University of Technology, Austria"
            ],
            "Affiliations": [
                "Graz University of Technology, Austria",
                "Salzburg University of Applied Sciences, Austria",
                "Coburg University, Germany",
                "Graz University of Technology, Austria",
                "Graz University of Technology, Austria"
            ],
            "Abstract": "Handheld Augmented Reality commonly implements some variant of magic lens rendering, which turns only a fraction of the user’s real environment into AR while the rest of the environment remains unaffected. Since handheld AR devices are commonly equipped with video see-through capabilities, AR magic lens applications often suffer from spatial distortions, because the AR environment is presented from the perspective of the camera of the mobile device. Recent approaches counteract this distortion based on estimations of the user’s head position, rendering the scene from the user&#039;s perspective. To this end, approaches usually apply face-tracking algorithms on the front camera of the mobile device. However, this demands high computational resources and therefore commonly affects the performance of the application beyond the already high computational load of AR applications. In this paper, we present a method to reduce the computational demands for user perspective rendering by applying lightweight optical flow tracking and an estimation of the user’s motion before head tracking is started. We demonstrate the suitability of our approach for computationally limited mobile devices and we compare it to device perspective rendering, to head tracked user perspective rendering, as well as to fixed point of view user perspective rendering.",
            "Award": "",
            "Keywords": "Augmented Reality;  User Perspective Rendering"
        },
        {
            "Title": "Evaluating Gesture-Based Augmented Reality Annotation",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-141-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYun+Suk+Chang%2C+Benjamin+Nuernberger%2C+Bo+Luan%2C+and+Tobias+Hollerer+%22Evaluating+Gesture-Based+Augmented+Reality+Annotation%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D0HacoNGjOtg",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Yun Suk Chang, Benjamin Nuernberger, Bo Luan, and Tobias Hollerer",
            "AffiliationsString": "University of California at Santa Barbara, USA",
            "Authors": [
                "Yun Suk Chang @ University of California at Santa Barbara, USA",
                "Benjamin Nuernberger @ University of California at Santa Barbara, USA",
                "Bo Luan @ University of California at Santa Barbara, USA",
                "Tobias Hollerer @ University of California at Santa Barbara, USA"
            ],
            "Affiliations": [
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA",
                "University of California at Santa Barbara, USA"
            ],
            "Abstract": "Drawing annotations with 3D hand gestures in augmented reality are useful for creating visual and spatial references in the real world, especially when these gestures can be issued from a distance. Different techniques exist for highlighting physical objects with hand-drawn circle and arrow annotations from a distance, assuming an approximate 3D scene model (e.g., as provided by the Microsoft HoloLens). However, little is known about user preference and performance of such methods for annotating real-world 3D environments. In this paper, we compare different annotation methods using the HoloLens augmented reality development platform: Surface-Drawing and Air-Drawing, with either raw but smoothed or interpreted and beautified gesture input. For the Surface-Drawing method, users control a cursor that is projected onto the world model, allowing gesture input to occur directly on the surfaces of real-world objects. For the Air-Drawing method, gesture drawing occurs at the user&#039;s fingertip and is projected onto the world model on release. The methods have different characteristics regarding necessitated vergence switches and afforded cursor control. We performed an experiment in which users draw on two different real-world objects at different distances using the different methods. Results indicate that Surface-Drawing is more accurate than Air-Drawing and Beautified annotations are drawn faster than Non-Beautified; participants also preferred Surface-Drawing and Beautified.",
            "Award": "",
            "Keywords": "Augmented Reality;  Annotations;  Spatial Referencing;  HoloLens;  User Study"
        },
        {
            "Title": "Attention Guiding Techniques using Peripheral Vision and Eye Tracking for Feedback in Augmented-Reality-Based Assistance Systems",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-195-p",
            "URL": "https%3A%2F%2Fpub.uni-bielefeld.de%2Fdownload%2F2908162%2F2908197",
            "URLvideo": "http%3A%2F%2Fyoutu.be%2F0N68eBPCxR8",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Patrick Renner and Thies Pfeiffer",
            "AffiliationsString": "Bielefeld University, Germany",
            "Authors": [
                "Patrick Renner @ Bielefeld University, Germany",
                "Thies Pfeiffer @ Bielefeld University, Germany"
            ],
            "Affiliations": [
                "Bielefeld University, Germany",
                "Bielefeld University, Germany"
            ],
            "Abstract": "A limiting factor of current smart glasses-based augmented reality (AR) systems is their small field of view. AR assistance systems designed for tasks such as order picking or manual assembly are supposed to guide the visual attention of the user towards the item that is relevant next. This is a challenging task, as the user may initially be in an arbitrary position and orientation relative to the target. As a result of the small field of view, in most cases the target will initially not be covered by the AR display, even if it is visible to the user. This raises the question of how to design attention guiding for such &quot;off-screen gaze&quot; conditions.  The central idea put forward in this paper is to display cues for attention guidance in a way that they can still be followed using peripheral vision. While the eyes&#039; focus point is beyond the AR display, certain visual cues presented on the display are still detectable by the human. In addition to that, guidance methods that are adaptive to the eye movements of the user are introduced and evaluated.  In the frame of a research project on smart glasses-based assistance systems for a manual assembly station, several attention guiding techniques with and without eye tracking have been designed, implemented and tested. As evaluation method simulated AR in a virtual reality HMD setup was used, which supports a repeatable and highly-controlled experimental design.",
            "Award": "",
            "Keywords": "Information Interfaces and Presentation (e.g. HCI);  User Interfaces"
        },
        {
            "Title": "Towards a Hybrid Space Combining Spatial Augmented Reality and Virtual Reality",
            "Type": "Paper",
            "Track": "Papers",
            "Key": "tdui17main-papers-163-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJoan+Sol+Roo+and+Martin+Hachet+%22Towards+a+Hybrid+Space+Combining+Spatial+Augmented+Reality+and+Virtual+Reality%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Joan Sol Roo and Martin Hachet",
            "AffiliationsString": "Inria, France",
            "Authors": [
                "Joan Sol Roo @ Inria, France",
                "Martin Hachet @ Inria, France"
            ],
            "Affiliations": [
                "Inria, France",
                "Inria, France"
            ],
            "Abstract": "Spatial Augmented Reality (SAR) allows a user, or a group of users, to benefit from digital augmentations embedded directly into the physical world. This enables co-located information and unobstructed interaction. On the other hand, SAR suffers from limitations that are inherently linked to its physical dependency, which is not the case for see-through or immersive displays. In this work, we explore how to facilitate the transition from SAR to VR, and vice versa, integrating both into a unified experience. We developed a set of interaction techniques and obtained first feedback from informal interviews.",
            "Award": "",
            "Keywords": "Mixed Reality;  Augmented Reality;  HMD;  3D Interaction"
        },
        {
            "Title": "A Robust and Intuitive 3D Interface for Teleoperation of Autonomous Robotic Agents through Immersive Virtual Reality Environments",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-103-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJace+Regenbrecht%2C+Alireza+Tavakkoli%2C+and+Donald+Loffredo+%22A+Robust+and+Intuitive+3D+Interface+for+Teleoperation+of+Autonomous+Robotic+Agents+through+Immersive+Virtual+Reality+Environments%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Jace Regenbrecht, Alireza Tavakkoli, and Donald Loffredo",
            "AffiliationsString": "University of Houston-Victoria, USA; Univeristy of Houston-Victoria, USA",
            "Authors": [
                "Jace Regenbrecht @ University of Houston-Victoria, USA",
                "Alireza Tavakkoli @ Univeristy of Houston-Victoria, USA",
                "Donald Loffredo @ University of Houston-Victoria, USA"
            ],
            "Affiliations": [
                "University of Houston-Victoria, USA",
                "Univeristy of Houston-Victoria, USA",
                "University of Houston-Victoria, USA"
            ],
            "Abstract": "In this paper an intuitive human interface is presented which allows for an operator immersed in a virtual environment to remotely control a teleoperated agent with minimal cognitive overload and minimal risk of accidental input. Additionally, a cursor-based interface is presented allowing for the placement of navigation nodes for the agent, thus facilitating robot&#039;s autonomous navigation functions to be executed.",
            "Award": "",
            "Keywords": "I.3.7 [Computer Graphics]: Three-Dimensional Graphics and Realism—Virtual Reality;  I.3.7 [Computer Graphics]: Graphics Systems and Interfaces—Graphics Input Devices;  I.3.8 [Human Centered Computing]: Applications; "
        },
        {
            "Title": "Can Social Presence Be Contagious? Effects of Social Presence Priming on Interaction with Virtual Humans",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-108-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSalam+Daher%2C+Kangsoo+Kim%2C+Myungho+Lee%2C+Ryan+Schubert%2C+Jeremy+Bailenson%2C+Gerd+Bruder%2C+and+Gregory+Welch+%22Can+Social+Presence+Be+Contagious%3F+Effects+of+Social+Presence+Priming+on+Interaction+with+Virtual+Humans%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Salam Daher, Kangsoo Kim, Myungho Lee, Ryan Schubert, Jeremy Bailenson, Gerd Bruder, and Gregory Welch",
            "AffiliationsString": "University of Central Florida, USA; Stanford University, USA",
            "Authors": [
                "Salam Daher @ University of Central Florida, USA",
                "Kangsoo Kim @ University of Central Florida, USA",
                "Myungho Lee @ University of Central Florida, USA",
                "Ryan Schubert @ University of Central Florida, USA",
                "Jeremy Bailenson @ Stanford University, USA",
                "Gerd Bruder @ University of Central Florida, USA",
                "Gregory Welch @ University of Central Florida, USA"
            ],
            "Affiliations": [
                "University of Central Florida, USA",
                "University of Central Florida, USA",
                "University of Central Florida, USA",
                "University of Central Florida, USA",
                "Stanford University, USA",
                "University of Central Florida, USA",
                "University of Central Florida, USA"
            ],
            "Abstract": "We explore whether a peripheral observation of apparent mutual social presence between a virtual human (VH) and a virtual human confederate (VHC) can increase a subject’s sense of social presence with the VH. Human subjects were asked to play a game with a VH. Half of the subjects were primed by being exposed to a brief but apparently engaging conversation between the VHC and the VH. The primed subjects reported being significantly more excited, alert, had significantly higher measures of Co-Presence, Attentional Allocation, and Message Understanding dimensions of social presence for the VH, compared to those who were not primed.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Design and Preliminary Evaluation of an Ego-Exocentric Technique for Cooperative Manipulation",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-110-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLeonardo+Pavanatto+Soares%2C+M%C3%A1rcio+Sarroglia+Pinho%2C+and+Regis+Kopper+%22Design+and+Preliminary+Evaluation+of+an+Ego-Exocentric+Technique+for+Cooperative+Manipulation%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D8INnapr1878",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Leonardo Pavanatto Soares, Márcio Sarroglia Pinho, and Regis Kopper",
            "AffiliationsString": "PUCRS, Brazil; Duke University, USA",
            "Authors": [
                "Leonardo Pavanatto Soares @ PUCRS, Brazil",
                "Márcio Sarroglia Pinho @ PUCRS, Brazil",
                "Regis Kopper @ Duke University, USA"
            ],
            "Affiliations": [
                "PUCRS, Brazil",
                "PUCRS, Brazil",
                "Duke University, USA"
            ],
            "Abstract": "This work proposes and evaluates the EGO-EXO technique for cooperative manipulation in a Collaborative Virtual Environment (CVE). From the premise that simultaneous control over navigation and manipulation by the user can make interaction complex, this technique places two users in asymmetric viewpoint positions during the cooperative manipulation of an object, allowing one of them to follow the object. It applies the separation of degrees of freedom method between the two viewpoints to make the manipulation easier. The technique is evaluated through a user study to test its efficiency on handling cooperative manipulation. Results indicate that, for manipulation tasks that require high amplitude position control along precise orientation control, the technique performs with a lower collisions to time ratio.",
            "Award": "",
            "Keywords": "Cooperative Interaction;  3D Interaction;  User Studies"
        },
        {
            "Title": "Awestruck: Natural Interaction with Virtual Reality on Eliciting Awe",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-112-p",
            "URL": "http%3A%2F%2Fwww.denisequesnel.ca%2Fwp-content%2Fuploads%2FIEEE3DUIvDQuesnelFINAL-Copy.pdf",
            "URLvideo": "https%3A%2F%2Fvimeo.com%2F201083373",
            "URLinfo": "http%3A%2F%2Fispace.iat.sfu.ca%2Fproject%2Fearthgazing%2F",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Denise Quesnel and Bernhard E. Riecke",
            "AffiliationsString": "Simon Fraser University, Canada",
            "Authors": [
                "Denise Quesnel @ Simon Fraser University, Canada",
                "Bernhard E. Riecke @ Simon Fraser University, Canada"
            ],
            "Affiliations": [
                "Simon Fraser University, Canada",
                "Simon Fraser University, Canada"
            ],
            "Abstract": "In the study of transformative experiences, the feeling of awe is found to alter an individual’s perception in positive, lasting manners. Our research aims to understand the potential for interactive virtual reality (VR) in eliciting awe, through a framework based on collection of physiological data alongside self-report and phenomenological observations that demonstrate awe. We conducted a mixed-methods experiment to test whether VR is effective in eliciting awe, and if this effect might be modulated by the type of natural interaction in the form of a “flight” lounger vs. “standing”. Results demonstrate both interaction paradigms were equally awe-inspiring, with overall physiological (in the form of goose bumps with a 43.8% incidence rate) and self-report data (overall awe rating of 79.7%), and females showing more physiological signs of awe than males. Observations revealed 360-degree interaction and operability of hand-held controllers could be improved, with the consequence of designing even more effective transformative experiences.",
            "Award": "",
            "Keywords": "Virtual reality;  immersion;  awe;  affective VR;  interaction"
        },
        {
            "Title": "Moving in a Box: Improving Spatial Orientation in Virtual Reality using Simulated Reference Frames",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-113-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DThinh+Nguyen-Vo%2C+Bernhard+E.+Riecke%2C+and+Wolfgang+Stuerzlinger+%22Moving+in+a+Box%3A+Improving+Spatial+Orientation+in+Virtual+Reality+using+Simulated+Reference+Frames%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Thinh Nguyen-Vo, Bernhard E. Riecke, and Wolfgang Stuerzlinger",
            "AffiliationsString": "Simon Fraser University, Canada",
            "Authors": [
                "Thinh Nguyen-Vo @ Simon Fraser University, Canada",
                "Bernhard E. Riecke @ Simon Fraser University, Canada",
                "Wolfgang Stuerzlinger @ Simon Fraser University, Canada"
            ],
            "Affiliations": [
                "Simon Fraser University, Canada",
                "Simon Fraser University, Canada",
                "Simon Fraser University, Canada"
            ],
            "Abstract": "Despite recent advances in virtual reality, locomotion in a virtual environment is still restricted because of spatial disorientation. Previous research has shown the benefits of reference frames in maintaining spatial orientation. Here, we propose using a visually simulated reference frame in virtual reality to provide users with a better sense of direction in landmark-free virtual environments. Visually overlaid rectangular frames simulate different variations of frames of reference. We investigated how two different types of visually simulated reference frames might benefit in a navigational search task through a mixed-method study. Results showed that the presence of a reference frame significantly affects participants’ performance in a navigational search task. Though the egocentric frame of reference (simulated CAVE) that translates with the observer did not significantly help, an allocentric frame of reference (a simulated stationary room) significantly improved user performance both in navigational search time and overall travel distance. Our study suggests that adding a variation of the reference frame to virtual reality applications might be a cost-effective solution to enable more effective locomotion in virtual reality.",
            "Award": "",
            "Keywords": "virtual reality;  locomotion;  spatial orientation;  navigational search;  reference frame"
        },
        {
            "Title": "Indirect Touch Interaction with Stereoscopic Displays using a Two-Sided Handheld Touch Device",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-115-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPrabhakar+Vemavarapu+and+Christoph+Borst+%22Indirect+Touch+Interaction+with+Stereoscopic+Displays+using+a+Two-Sided+Handheld+Touch+Device%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Prabhakar Vemavarapu and Christoph Borst",
            "AffiliationsString": "University of Louisiana at Lafayette, USA",
            "Authors": [
                "Prabhakar Vemavarapu @ University of Louisiana at Lafayette, USA",
                "Christoph Borst @ University of Louisiana at Lafayette, USA"
            ],
            "Affiliations": [
                "University of Louisiana at Lafayette, USA",
                "University of Louisiana at Lafayette, USA"
            ],
            "Abstract": "An indirect touch 3D interface using a two-sided handheld touch device for interactions with dense datasets on stereoscopic displays. This work explores the possibilities for a smartphone able to sense touch on both sides. Two android phones are combined back-to-back. The top touch surface is used for primary or fine interactions (selection /translation/ rotation) and bottom surface for coarser aspects such as mode control or feature extraction. Two surfaces are programmed to recognize input from 4 digits – two top and two bottom. The four touch areas enable 3D object selection, manipulation, and feature extraction using combinations of simultaneous touches.",
            "Award": "",
            "Keywords": "3D user interfaces;  Indirect touch;  Bimanual interaction;  Multi-touch;  Smartphone;  3D Interactions"
        },
        {
            "Title": "Procedural Celestial Rendering for 3D Navigation",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-116-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAlain+Galvan%2C+Francisco+R.+Ortega%2C+and+Naphtali+Rishe+%22Procedural+Celestial+Rendering+for+3D+Navigation%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Alain Galvan, Francisco R. Ortega, and Naphtali Rishe",
            "AffiliationsString": "Florida International University, USA",
            "Authors": [
                "Alain Galvan @ Florida International University, USA",
                "Francisco R. Ortega @ Florida International University, USA",
                "Naphtali Rishe @ Florida International University, USA"
            ],
            "Affiliations": [
                "Florida International University, USA",
                "Florida International University, USA",
                "Florida International University, USA"
            ],
            "Abstract": "Finding the best suitable environment for 3D navigation that utilizes at least six degrees-of-freedom is still difficult. Furthermore, creating a system to procedurally generate a large virtual environment provides an opportunity for researchers to understand this problem further. Therefore, we present a novel technique to render a parametric celestial skybox with the ability to light environments similar to natural color corrected images from telescopes. We first pre-compute a spherical ray map that corresponds to the cubemap coordinates, then generate stars and dust through a combination of different noise generation shaders.",
            "Award": "",
            "Keywords": "3d navigation;  physically-based rendering"
        },
        {
            "Title": "Analysis of R-V Dynamics Illusion Behavior Caused by Varying the Weight of Real Object",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-117-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKana+Oshima%2C+Satoshi+Hashiguchi%2C+Fumihisa+Shibata%2C+and+Asako+Kimura+%22Analysis+of+R-V+Dynamics+Illusion+Behavior+Caused+by+Varying+the+Weight+of+Real+Object%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Kana Oshima, Satoshi Hashiguchi, Fumihisa Shibata, and Asako Kimura",
            "AffiliationsString": "Ritsumeikan University, Japan",
            "Authors": [
                "Kana Oshima @ Ritsumeikan University, Japan",
                "Satoshi Hashiguchi @ Ritsumeikan University, Japan",
                "Fumihisa Shibata @ Ritsumeikan University, Japan",
                "Asako Kimura @ Ritsumeikan University, Japan"
            ],
            "Affiliations": [
                "Ritsumeikan University, Japan",
                "Ritsumeikan University, Japan",
                "Ritsumeikan University, Japan",
                "Ritsumeikan University, Japan"
            ],
            "Abstract": "Previously, we discovered the “R-V Dynamics Illusion,” a psychophysical phenomenon caused by the difference between the dynamics of real object (R) and virtual object (V) in mixed reality (MR) space. We confirmed that a real object with a movable portion (CG) is perceived lighter by MR visual stimulation. Here, we analyze whether the difference in the mass of real objects affects the R-V Dynamics Illusion. We conducted experiments to determine the difference threshold of weights under the condition where the masses of real objects are 500, 750, and 1000g, and only the CG liquid level is changed. As a result, the difference in mass did not influence the difference threshold of weights by changing the virtual liquid level. On the other hand, with the same mass conditions, the difference threshold of weights becomes smaller when the R-V Dynamics Illusion occurs.",
            "Award": "",
            "Keywords": "Mixed Reality;  Sense of Weight;  Visual Stimulation;  Psychophysical Influence"
        },
        {
            "Title": "A Surgical Training System for Four Medical Punctures Based on Virtual Reality and Haptic Feedback",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-posters-119-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRonghai+Wang%2C+Junfeng+Yao%2C+Lin+Wang%2C+Xiaohan+Liu%2C+Hongwei+Wang%2C+and+Liling+Zheng+%22A+Surgical+Training+System+for+Four+Medical+Punctures+Based+on+Virtual+Reality+and+Haptic+Feedback%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Ronghai Wang, Junfeng Yao, Lin Wang, Xiaohan Liu, Hongwei Wang, and Liling Zheng",
            "AffiliationsString": "Quanzhou Normal University, China; Xiamen University, China; Sanming University, China; Quanzhou First Affiliated Hospital of Fujian Medical University, China",
            "Authors": [
                "Ronghai Wang @ Quanzhou Normal University, China",
                "Junfeng Yao @ Xiamen University, China",
                "Lin Wang @ Sanming University, China",
                "Xiaohan Liu @ Xiamen University, China",
                "Hongwei Wang @ Quanzhou Normal University, China",
                "Liling Zheng @ Quanzhou First Affiliated Hospital of Fujian Medical University, China"
            ],
            "Affiliations": [
                "Quanzhou Normal University, China",
                "Xiamen University, China",
                "Sanming University, China",
                "Xiamen University, China",
                "Quanzhou Normal University, China",
                "Quanzhou First Affiliated Hospital of Fujian Medical University, China"
            ],
            "Abstract": "This poster presents a surgical training system for four medical punctures based on virtual reality and haptic feedback, including a client program developed in the Unity3D game engine and a server program developed by PHP. This system provides the immersive surgery simulation for thoracentesis, lumbar puncture, bone marrow puncture and abdominal paracentesis that we call four medical punctures. Trainers or teachers can release training tasks in which trainees or students are able to learn surgery skills at a 3D visual scene. Furthermore, they will feel a sense of immediacy when putting on the head-mounted display and with the help of haptic feedback. The training records will be put into database for analysis.",
            "Award": "",
            "Keywords": "Surgical training system;  virtual reality;  head-mounted display;  haptic feedback"
        },
        {
            "Title": "User Experience Evaluation with Archaeometry Interactive Tools in Virtual Reality Environment",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-126-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAna+Grassiele+Correa%2C+Eduardo+Zilles+Borba%2C+Roseli+Lopes%2C+Marcelo+Zuffo%2C+Astolfo+Araujo%2C+and+Regis+Kopper+%22User+Experience+Evaluation+with+Archaeometry+Interactive+Tools+in+Virtual+Reality+Environment%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Ana Grassiele Correa, Eduardo Zilles Borba, Roseli Lopes, Marcelo Zuffo, Astolfo Araujo, and Regis Kopper",
            "AffiliationsString": "University of São Paulo, Brasil; Duke University, USA",
            "Authors": [
                "Ana Grassiele Correa @ University of São Paulo, Brasil",
                "Eduardo Zilles Borba @ University of São Paulo, Brasil",
                "Roseli Lopes @ University of São Paulo, Brasil",
                "Marcelo Zuffo @ University of São Paulo, Brasil",
                "Astolfo Araujo @ University of São Paulo, Brasil",
                "Regis Kopper @ Duke University, USA"
            ],
            "Affiliations": [
                "University of São Paulo, Brasil",
                "University of São Paulo, Brasil",
                "University of São Paulo, Brasil",
                "University of São Paulo, Brasil",
                "University of São Paulo, Brasil",
                "Duke University, USA"
            ],
            "Abstract": "In this work we present a study about usability experience of users in a cyber-archeological environment. We researched how they explore a realistic 3D environment in Virtual Reality (VR) through archaeometry conventional techniques. Our objective is to evaluate users experiences with interactive archaeometry tools with archaeologist (not a VR expert) and compare results with VR experts (not an archeology expert). Two hypothesis will be tested: a) it’s possible to simulate the virtual world realistically as the real one?; b) if this VR model is passive of exploration, is it possible to create 3DUI analytical tools to help archaeologist to manipulate archaeometry tools? To explore these hypotheses we conducted experimental tests with ten users and the results are promising.",
            "Award": "",
            "Keywords": "Usability;  virtual reality;  user experience;  cyber-archeology;  virtual continuum"
        },
        {
            "Title": "Information Recall in VR Disability Simulation",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-127-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTanvir+Irfan+Chowdhury%2C+Raphael+Costa%2C+and+John+Quarles+%22Information+Recall+in+VR+Disability+Simulation%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Do5uuStSjp74",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Tanvir Irfan Chowdhury, Raphael Costa, and John Quarles",
            "AffiliationsString": "University of Texas at San Antonio, USA",
            "Authors": [
                "Tanvir Irfan Chowdhury @ University of Texas at San Antonio, USA",
                "Raphael Costa @ University of Texas at San Antonio, USA",
                "John Quarles @ University of Texas at San Antonio, USA"
            ],
            "Affiliations": [
                "University of Texas at San Antonio, USA",
                "University of Texas at San Antonio, USA",
                "University of Texas at San Antonio, USA"
            ],
            "Abstract": "The purpose of this poster is to explain our study on the effect of the sense of presence on one aspect of learning, information recall, in an immersive (vs. non-immersive) virtual reality (VR) disability simulation (DS). We hypothesized that a higher level of immersion and involvement in a VR disability simulation that leads to a high sense of presence will help the user improve information recall. We conducted a between subjects experiment in which participants were presented information about multiple sclerosis (MS) in different immersive conditions and afterwards they attempted to recall the information. The results from our study suggest that participants who were in immersive conditions were able to recall the information more effectively than the participants who experienced a non-immersive condition.",
            "Award": "",
            "Keywords": "Virtual Reality;  Immersion;  Presence;  Learning;  Information Recall;  Disability Simulation"
        },
        {
            "Title": "Comparing VR Environments for Seat Selection in an Opera Theater",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-129-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJose+Dorado%2C+Pablo+Figueroa%2C+Jean-Remy+Chardonnet%2C+Frederic+Merienne%2C+and+Tiberio+Hern%C3%A1ndez+%22Comparing+VR+Environments+for+Seat+Selection+in+an+Opera+Theater%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Jose Dorado, Pablo Figueroa, Jean-Remy Chardonnet, Frederic Merienne, and Tiberio Hernández",
            "AffiliationsString": "University of Andes, Colombia; CNRS, France",
            "Authors": [
                "Jose Dorado @ University of Andes, Colombia",
                "Pablo Figueroa @ University of Andes, Colombia",
                "Jean-Remy Chardonnet @ CNRS, France",
                "Frederic Merienne @ CNRS, France",
                "Tiberio Hernández @ University of Andes, Colombia"
            ],
            "Affiliations": [
                "University of Andes, Colombia",
                "University of Andes, Colombia",
                "CNRS, France",
                "CNRS, France",
                "University of Andes, Colombia"
            ],
            "Abstract": "This study presents a comparison of the influence of different VR environments in the task of selecting a preferred seat in an opera theater. We used gaze-based raycasting and headsets in a low-cost head-mounted display (HMD) (GearVR); and a virtual wand, head tracking, and headsets in a CAVE, two somewhat opposing technologies in the spectrum of current VR systems. Visual rendering and the selection technique depend on the capabilities of each environment, whereas the sound is approximated in both environments. Results show that subjects can select similar seats but their decisions differ between both environments. The results obtained can be useful in guiding the development of future VR applications.",
            "Award": "",
            "Keywords": "Human-centered computing;  Virtual reality;  User studies;  Interaction devices;  Pointing"
        },
        {
            "Title": "Multi-phase Wall Warner System for Real Walking in Virtual Environments",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-131-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMarkus+Zank%2C+Colin+Yao%2C+and+Andreas+Kunz+%22Multi-phase+Wall+Warner+System+for+Real+Walking+in+Virtual+Environments%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Markus Zank, Colin Yao, and Andreas Kunz",
            "AffiliationsString": "ETH Zurich, Switzerland",
            "Authors": [
                "Markus Zank @ ETH Zurich, Switzerland",
                "Colin Yao @ ETH Zurich, Switzerland",
                "Andreas Kunz @ ETH Zurich, Switzerland"
            ],
            "Affiliations": [
                "ETH Zurich, Switzerland",
                "ETH Zurich, Switzerland",
                "ETH Zurich, Switzerland"
            ],
            "Abstract": "Real walking is a means to explore virtual environments that are even larger than a physical space. Avoiding collisions with the physical walls necessitates a system to warn users. This paper describes the design and implementation of a multi-phase warning system as a solution to this safety necessity. The first phase is a velocity-based warning based on time-to-impact. The second phase is distance-based and designed as an emergency warning. Combinations of acoustic and visual feedback mechanisms were tested in a study with 13 participants. The quantitative measures show that the system keeps users safe, while allowing them to freely explore the virtual environment.",
            "Award": "",
            "Keywords": "User Interfaces;  Input Devices; "
        },
        {
            "Title": "The Effectiveness of Changing the Field of View in a HMD on the Perceived Self-Motion",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-132-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DOliver+Basting%2C+Stefan+Gr%C3%BCnvogel%2C+and+Arnulph+Fuhrmann+%22The+Effectiveness+of+Changing+the+Field+of+View+in+a+HMD+on+the+Perceived+Self-Motion%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Oliver Basting, Stefan Grünvogel, and Arnulph Fuhrmann",
            "AffiliationsString": "TH Köln, Germany",
            "Authors": [
                "Oliver Basting @ TH Köln, Germany",
                "Stefan Grünvogel @ TH Köln, Germany",
                "Arnulph Fuhrmann @ TH Köln, Germany"
            ],
            "Affiliations": [
                "TH Köln, Germany",
                "TH Köln, Germany",
                "TH Köln, Germany"
            ],
            "Abstract": "The following paper investigates the effect on the intensity of per- ceived vection by changing the field of view (FOV) using a head- mounted display (HMD) in a virtual environment (VE). For this purpose a study was carried out, where the participants were situ- ated in a vection evoking VE using a HMD. During the experiment, the VE was presented with different FOVs, and a measurement of the felt intensity of vection was performed. The results indicate that a decrease of the FOV invokes a decrease of the intensity of perceived vection.",
            "Award": "",
            "Keywords": "vection;  perception;  field of view;  virtual reality;  head-mounted display;  user studies"
        },
        {
            "Title": "Trigger Walking: A Low-Fatigue Travel Technique for Immersive Virtual Reality",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-133-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DBhuvaneswari+Sarupuri%2C+Miriam+Luque+Chipana%2C+and+Robert+W.+Lindeman+%22Trigger+Walking%3A+A+Low-Fatigue+Travel+Technique+for+Immersive+Virtual+Reality%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Bhuvaneswari Sarupuri, Miriam Luque Chipana, and Robert W. Lindeman",
            "AffiliationsString": "University of Canterbury, New Zealand",
            "Authors": [
                "Bhuvaneswari Sarupuri @ University of Canterbury, New Zealand",
                "Miriam Luque Chipana @ University of Canterbury, New Zealand",
                "Robert W. Lindeman @ University of Canterbury, New Zealand"
            ],
            "Affiliations": [
                "University of Canterbury, New Zealand",
                "University of Canterbury, New Zealand",
                "University of Canterbury, New Zealand"
            ],
            "Abstract": "We present Trigger Walking, a low-fatigue travel technique for immersive virtual reality which uses hand-held controllers to move about more naturally within a limited physical space. Most commercial applications use some form of teleportation or physical walking for moving around in a virtual space. However, teleportation can be disorienting, due to the sudden change in the environment when teleported to another location. Physical walking techniques are more physically demanding, leading to fatigue. Hence, we explore the use of two spatial controllers that accompany commercial headsets to walk by taking a virtual step each time a controller trigger is pulled. The user has the choice of using the orientation of a single-controller, the average of both controllers, or that of the head to determine the direction of walking, and speed can be controlled by changing the angle of the controller to the Frontal plane.",
            "Award": "",
            "Keywords": "Tracking;  training;  entertainment;  immersion;  HMD"
        },
        {
            "Title": "VizSpace: Interaction in the Positive Parallax Screen Plane",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-134-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DOyewole+Oyekoya%2C+Emily+Sassard%2C+and+Tiana+Johnson+%22VizSpace%3A+Interaction+in+the+Positive+Parallax+Screen+Plane%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Oyewole Oyekoya, Emily Sassard, and Tiana Johnson",
            "AffiliationsString": "Clemson University, USA",
            "Authors": [
                "Oyewole Oyekoya @ Clemson University, USA",
                "Emily Sassard @ Clemson University, USA",
                "Tiana Johnson @ Clemson University, USA"
            ],
            "Affiliations": [
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA"
            ],
            "Abstract": "The VizSpace is a physically situated interactive system that combines touch and hand interactions behind the screen to create the effect that users are reaching inside and interacting in a 3D virtual workspace. It extends the conventional touch table interface with hand tracking and 3D visualization to enable interaction in the positive parallax plane, where the binocular focus falls behind the screen so as not to occlude projected images. This paper covers the system design, human factors and ergonomics considerations for an interactive and immersive gesture-based visualization system. Results are presented from a preliminary user study that validates the usability of VizSpace.",
            "Award": "",
            "Keywords": "touch interaction;  hand tracking;  immersive"
        },
        {
            "Title": "Effects of Stereo and Head Tracking on Distance Estimation, Presence, and Simulator Sickness using Wall Screen in Architectural Project Review",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-137-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSabah+Boustila%2C+Dominique+Bechmann%2C+and+Antonio+Capobianco+%22Effects+of+Stereo+and+Head+Tracking+on+Distance+Estimation%2C+Presence%2C+and+Simulator+Sickness+using+Wall+Screen+in+Architectural+Project+Review%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Sabah Boustila, Dominique Bechmann, and Antonio Capobianco",
            "AffiliationsString": "University of Strasbourg, France",
            "Authors": [
                "Sabah Boustila @ University of Strasbourg, France",
                "Dominique Bechmann @ University of Strasbourg, France",
                "Antonio Capobianco @ University of Strasbourg, France"
            ],
            "Affiliations": [
                "University of Strasbourg, France",
                "University of Strasbourg, France",
                "University of Strasbourg, France"
            ],
            "Abstract": "Stereo and head tracking are considered as distance perception cues in virtual environment. Several studies have investigated their influence on several tasks. Results were different among studies. In this paper, we conducted a complete experiment investigating the influence of the stereo and head tracking in the specific context of virtual visits of houses during architectural project review with client. We manipulated the stereo and head tracking in four conditions and we examined the effects of the two factors on distance perception (room dimensions, habitability, etc.), task difficulty, presence and simulator sickness. Results reveal a significant effect of the stereo on the estimation of the habitability, the dimensions of the rooms and task difficulty. However, the effect of stereo and head tracking was not significant on the presence and simulator sickness.",
            "Award": "",
            "Keywords": "Virtual reality;  virtual visis;  stereo;  head tracking;  distance estimation;  presence;  simulator sickness;  architectural project review"
        },
        {
            "Title": "Influence of Avatar Appearance on Presence in Social VR",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-138-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPaul+Heidicker%2C+Eike+Langbehn%2C+and+Frank+Steinicke+%22Influence+of+Avatar+Appearance+on+Presence+in+Social+VR%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Paul Heidicker, Eike Langbehn, and Frank Steinicke",
            "AffiliationsString": "University of Hamburg, Germany",
            "Authors": [
                "Paul Heidicker @ University of Hamburg, Germany",
                "Eike Langbehn @ University of Hamburg, Germany",
                "Frank Steinicke @ University of Hamburg, Germany"
            ],
            "Affiliations": [
                "University of Hamburg, Germany",
                "University of Hamburg, Germany",
                "University of Hamburg, Germany"
            ],
            "Abstract": "Social virtual reality (VR) has enormous potential to allow several physically separated users to collaborate in an immersive virtual environment (IVE). These users and their actions are represented by avatars in the IVE. In question is how the appearance of those avatars influences communication and interaction. It might make a difference, if the avatar consists of a complete body representation or if only certain body parts are visible. Moreover, a one-to-one mapping of the user&#039;s movements to the avatar&#039;s movements might have advantages compared to pre-defined avatar animations. To answer these questions, we compared three different types of avatar appearances in a user study. For this, we used estimations of presence, social presence, and cognitive load. The evaluation showed that motion-controlled avatars with full representation of the avatar body lead to an increased sense of presence. Motion-controlled avatars as well as avatars which have only head and hands visible produced an increased feeling of co-presence and behavioral interdependence. This is interesting, since it states that we do not need a complete avatar body in social VR.",
            "Award": "",
            "Keywords": "Collaborative interaction;  perception;  presence"
        },
        {
            "Title": "Angle and Pressure-Based Volumetric Picking on Touchscreen Devices",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-139-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DIevgeniia+Gutenko%2C+Seyedkoosha+Mirhosseini%2C+and+Arie+Kaufman+%22Angle+and+Pressure-Based+Volumetric+Picking+on+Touchscreen+Devices%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Ievgeniia Gutenko, Seyedkoosha Mirhosseini, and Arie Kaufman",
            "AffiliationsString": "Stony Brook University, USA",
            "Authors": [
                "Ievgeniia Gutenko @ Stony Brook University, USA",
                "Seyedkoosha Mirhosseini @ Stony Brook University, USA",
                "Arie Kaufman @ Stony Brook University, USA"
            ],
            "Affiliations": [
                "Stony Brook University, USA",
                "Stony Brook University, USA",
                "Stony Brook University, USA"
            ],
            "Abstract": "The target picking in 3D volumetric data is a common interaction problem in a variety of domains such as medicine, engineering, and physics. When a user clicks on a 2D point on the screen rendering, the ray is cast through the volume at an angle perpendicular to the screen. The problem lies in determining the intended location of picking, that is the end point of the ray. We introduce picking for 3D volumetric data by utilizing pressure and angle of the digital stylus pen on a touchscreen device. We map both pressure and angle of the stylus to the depth of the selector widget to help target acquisition. We evaluate several methods of selection: single finger selection, stylus with pressure but without an angle, and stylus with both angle and pressure. We decouple rotation of the volumetric data, and control for two target sizes. We report significant benefits of digital stylus picking methods and a relation between the methods and target sizes.",
            "Award": "",
            "Keywords": "3D interaction;  picking technique;  volumetric rendering"
        },
        {
            "Title": "PRECIOUS! Out-of-Reach Selection using Iterative Refinement in VR",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-140-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDaniel+Mendes%2C+Daniel+Medeiros%2C+Eduardo+Cordeiro%2C+Maurecio+Sousa%2C+Alfredo+Ferreira%2C+and+Joaquim+Jorge+%22PRECIOUS%21+Out-of-Reach+Selection+using+Iterative+Refinement+in+VR%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Daniel Mendes, Daniel Medeiros, Eduardo Cordeiro, Maurecio Sousa, Alfredo Ferreira, and Joaquim Jorge",
            "AffiliationsString": "INESC-ID, Portugal; University of Lisbon, Portugal",
            "Authors": [
                "Daniel Mendes @ INESC-ID, Portugal",
                "Daniel Medeiros @ INESC-ID, Portugal",
                "Eduardo Cordeiro @ University of Lisbon, Portugal",
                "Maurecio Sousa @ INESC-ID, Portugal",
                "Alfredo Ferreira @ INESC-ID, Portugal",
                "Joaquim Jorge @ INESC-ID, Portugal"
            ],
            "Affiliations": [
                "INESC-ID, Portugal",
                "INESC-ID, Portugal",
                "University of Lisbon, Portugal",
                "INESC-ID, Portugal",
                "INESC-ID, Portugal",
                "INESC-ID, Portugal"
            ],
            "Abstract": "Selecting objects outside user&#039;s arm-reach in Virtual Reality still poses significant challenges. Techniques proposed to overcome such limitations often follow arm-extension metaphors or favor the use of selection volumes combined with ray-casting. Nonetheless, these approaches work for room sized and sparse environments, and they do not scale to larger scenarios with many objects. We introduce PRECIOUS, a novel mid-air technique for selecting out-of-reach objects. It employs an iterative progressive refinement, using cone-casting to select multiple objects and moving users closer to them in each step, allowing accurate selections. A user evaluation showed that PRECIOUS compares favorably against existing approaches, being the most versatile.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Jedi ForceExtension: Telekinesis as a Virtual Reality Interaction Metaphor",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-141-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRory+Clifford%2C+Nikita+Tuanquin%2C+and+Robert+Lindeman+%22Jedi+ForceExtension%3A+Telekinesis+as+a+Virtual+Reality+Interaction+Metaphor%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Rory Clifford, Nikita Tuanquin, and Robert Lindeman",
            "AffiliationsString": "University of Canterbury, New Zealand",
            "Authors": [
                "Rory Clifford @ University of Canterbury, New Zealand",
                "Nikita Tuanquin @ University of Canterbury, New Zealand",
                "Robert Lindeman @ University of Canterbury, New Zealand"
            ],
            "Affiliations": [
                "University of Canterbury, New Zealand",
                "University of Canterbury, New Zealand",
                "University of Canterbury, New Zealand"
            ],
            "Abstract": "Virtual Reality (VR) enables us to freely operate in a space that is unconstrained by physical laws and limitations. To take advantage of this aspect, we have developed a technique for pseudo-telekinetic object manipulation in VR using slight downward tilt of the head to simulate Jedi concentration. This telekinetic ability draws inspiration from The Force abilities exhibited in the Star Wars universe, and is particularly well suited to VR because it provides the ability to interact with and manipulate objects at a distance. We implemented force translate, force rotate, force push and force pull behaviours as examples of the general concept of force extension. We conducted exploratory user testing to assess telekinesis as a suitable interaction metaphor. Subject performance and feedback varied between participants but were generally encouraging.",
            "Award": "",
            "Keywords": "Virtual Reality;  3D interaction;  3D Selection;  object displacement"
        },
        {
            "Title": "Effect of Footstep Vibrations and Proprioceptive Vibrations Used with an Innovative Navigation Method",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-142-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJeremy+Plouzeau%2C+Jose+Luis+Dorado%2C+Damien+Paillot%2C+and+Frederic+Merienne+%22Effect+of+Footstep+Vibrations+and+Proprioceptive+Vibrations+Used+with+an+Innovative+Navigation+Method%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Jeremy Plouzeau, Jose Luis Dorado, Damien Paillot, and Frederic Merienne",
            "AffiliationsString": "CNRS, France",
            "Authors": [
                "Jeremy Plouzeau @ CNRS, France",
                "Jose Luis Dorado @ CNRS, France",
                "Damien Paillot @ CNRS, France",
                "Frederic Merienne @ CNRS, France"
            ],
            "Affiliations": [
                "CNRS, France",
                "CNRS, France",
                "CNRS, France",
                "CNRS, France"
            ],
            "Abstract": "This study proposes to investigate the effect of adding vibration feedback to a navigation task in virtual environment. Previous study used footstep vibrations and proprioceptive vibrations in order to decrease the cyber-sickness and increase the sense of presence. In this study, we experiment the same vibration modalities but with a new navigation method.  The results show that proprioceptive vibrations do not impact the sense of presence neither the cybersickness while footstep vibrations increase sense of presence and decrease in a certain way cybersickness.",
            "Award": "",
            "Keywords": "Virtual Reality;  Navigation Method;  Vibrations;  Cybersickness;  Presence"
        },
        {
            "Title": "Anatomical 2D/3D Shape-Matching in Virtual Reality: A User Interface for Quantifying Joint Kinematics with Radiographic Imaging",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-143-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKyungyoon+Kim%2C+Rebekah+L.+Lawrence%2C+Nikki+Kyllonen%2C+Paula+M.+Ludewig%2C+Arin+M.+Ellingson%2C+and+Daniel+F.+Keefe+%22Anatomical+2D%2F3D+Shape-Matching+in+Virtual+Reality%3A+A+User+Interface+for+Quantifying+Joint+Kinematics+with+Radiographic+Imaging%22",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2FTUKm6pnz_ZA",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Kyungyoon Kim, Rebekah L. Lawrence, Nikki Kyllonen, Paula M. Ludewig, Arin M. Ellingson, and Daniel F. Keefe",
            "AffiliationsString": "University of Minnesota, USA",
            "Authors": [
                "Kyungyoon Kim @ University of Minnesota, USA",
                "Rebekah L. Lawrence @ University of Minnesota, USA",
                "Nikki Kyllonen @ University of Minnesota, USA",
                "Paula M. Ludewig @ University of Minnesota, USA",
                "Arin M. Ellingson @ University of Minnesota, USA",
                "Daniel F. Keefe @ University of Minnesota, USA"
            ],
            "Affiliations": [
                "University of Minnesota, USA",
                "University of Minnesota, USA",
                "University of Minnesota, USA",
                "University of Minnesota, USA",
                "University of Minnesota, USA",
                "University of Minnesota, USA"
            ],
            "Abstract": "We introduce a virtual reality 3D user interface (3DUI) for anatomical 2D/3D shape-matching, a challenging task that is part of medical imaging processes required by biomechanics researchers. Manual shape-matching can be thought of as a nuanced version of classic 6 degree-of-freedom docking tasks studied in the 3DUI research community. Our solution combines dynamic gain for precise translation and rotation from 6 degree-of-freedom tracker input, constraints based on both 2D and 3D data, and immersive visualization and visual feedback.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Redirected Reach in Virtual Reality: Enabling Natural Hand Interaction at Multiple Virtual Locations with Passive Haptics",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-144-p",
            "URL": "http%3A%2F%2Fpeople.tamu.edu%2F%7Eeragan%2Fpapers%2FSuhail_Redirected_Reach_2017.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Mohamed Suhail, Shyam Prathish Sargunam, Dustin Han, and Eric Ragan",
            "AffiliationsString": "Texas A&M University, USA",
            "Authors": [
                "Mohamed Suhail @ Texas A&M University, USA",
                "Shyam Prathish Sargunam @ Texas A&M University, USA",
                "Dustin Han @ Texas A&M University, USA",
                "Eric Ragan @ Texas A&M University, USA"
            ],
            "Affiliations": [
                "Texas A&M University, USA",
                "Texas A&M University, USA",
                "Texas A&M University, USA",
                "Texas A&M University, USA"
            ],
            "Abstract": "In many virtual reality applications, it would be ideal if users could use their physical hands to directly interact with virtual objects while experiencing realistic haptic feedback. While this can be achieved via interaction with tracked physical props that correspond to virtual objects, practical limitations can make it difficult to achieve a physical environment that exactly represents the virtual world, and virtual environments are often much larger than the available tracked physical space. Our approach maps a single physical prop to multiple virtual objects distributed throughout a virtual environment. Additionally, our work explores scenarios using one physical prop to control multiple types of object interactions. We explore considerations that allow physical object manipulation using orientation resetting to physically align the user with a physical prop for interaction. The resetting approach applies a discrete positional and rotational update to the user&#039;s location when the user virtually approaches a target for interaction, and the redirected reach approach applies a translational offset to the user’s virtual hand based on the positional difference of the virtual and physical objects.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Effect of Hand-Avatar in a Selection Task using a Tablet as Input Device in an Immersive Virtual Environment",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-145-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLuis+Afonso%2C+Paulo+Dias%2C+Carlos+Ferreira%2C+and+Beatriz+Sousa+Santos+%22Effect+of+Hand-Avatar+in+a+Selection+Task+using+a+Tablet+as+Input+Device+in+an+Immersive+Virtual+Environment%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Luis Afonso, Paulo Dias, Carlos Ferreira, and Beatriz Sousa Santos",
            "AffiliationsString": "University of Aveiro, Portugal",
            "Authors": [
                "Luis Afonso @ University of Aveiro, Portugal",
                "Paulo Dias @ University of Aveiro, Portugal",
                "Carlos Ferreira @ University of Aveiro, Portugal",
                "Beatriz Sousa Santos @ University of Aveiro, Portugal"
            ],
            "Affiliations": [
                "University of Aveiro, Portugal",
                "University of Aveiro, Portugal",
                "University of Aveiro, Portugal",
                "University of Aveiro, Portugal"
            ],
            "Abstract": "How does the virtual representation of the user&#039;s hands influence the performance on a button selection task performed in a tablet-based interaction within an immersive virtual environment? To answer this question, we asked 55 participants to use three conditions: no-hand avatar, realistic avatar and translucent avatar. The participants were faster but made slightly more errors while using the no-avatar condition, and considered easier to perform the task with the translucent avatar.",
            "Award": "",
            "Keywords": "hand-avatar;  immersive virtual environment;  mobile device;  input device;  button selection task;  user study"
        },
        {
            "Title": "Painting with Light: Gesture Based Light Control in Architectural Settings",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-146-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMohamed+Handosa%2C+Denis+Gracanin%2C+Hicham+Elmongui%2C+and+Andrew+Ciambrone+%22Painting+with+Light%3A+Gesture+Based+Light+Control+in+Architectural+Settings%22",
            "URLvideo": "https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DJE0RiiqyWHw",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Mohamed Handosa, Denis Gracanin, Hicham Elmongui, and Andrew Ciambrone",
            "AffiliationsString": "Virginia Tech, USA; Alexandria University, Egypt",
            "Authors": [
                "Mohamed Handosa @ Virginia Tech, USA",
                "Denis Gracanin @ Virginia Tech, USA",
                "Hicham Elmongui @ Alexandria University, Egypt",
                "Andrew Ciambrone @ Virginia Tech, USA"
            ],
            "Affiliations": [
                "Virginia Tech, USA",
                "Virginia Tech, USA",
                "Alexandria University, Egypt",
                "Virginia Tech, USA"
            ],
            "Abstract": "Lighting can play an essential role in supporting user tasks as well as creating an ambiance. Although users may feel excited about the supported functionality when a complex indoor lighting system is first deployed, the lack of a convenient interface may prevent them from taking the full advantage of the system. We propose a system and a 3D interaction technique for controlling indoor lights. The system is extendable and supports multiple users to control lights using either gestures or a GUI. Using a single Kinect sensor, the user is able to control lights from different positions in the room while standing or sitting down within the tracking range of the sensor. The selection and manipulation accuracy of the proposed technique together with the ease of use compared to other alternatives makes it a promising lighting control technique.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "Visual Cues to Aid 3D Pointing in a Virtual Mirror",
            "Type": "Poster",
            "Track": "Posters",
            "Key": "tdui17posters-postersposters-147-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJason+Woodworth+and+Christoph+Borst+%22Visual+Cues+to+Aid+3D+Pointing+in+a+Virtual+Mirror%22",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2FT6gu4vrOV8o",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Jason Woodworth and Christoph Borst",
            "AffiliationsString": "University of Louisiana at Lafayette, USA",
            "Authors": [
                "Jason Woodworth @ University of Louisiana at Lafayette, USA",
                "Christoph Borst @ University of Louisiana at Lafayette, USA"
            ],
            "Affiliations": [
                "University of Louisiana at Lafayette, USA",
                "University of Louisiana at Lafayette, USA"
            ],
            "Abstract": "We address a 3D pointing problem for a &quot;virtual mirror&quot; view used in collaborative VR. The virtual mirror is a large TV display showing a depth-camera-based image of a user in a surrounding virtual environment. There are problems with pointing and communicating to remote users due to the indirectness of pointing in a mirror and a low sense of depth. We propose several visual cues to help the user control pointing depth, and present an initial user study, providing a basis for further refinement and investigation of techniques.",
            "Award": "",
            "Keywords": "Human Factors;  Virtual Reality"
        },
        {
            "Title": "AACT: A Mobile Augmented Reality Application for Art Creation",
            "Type": "3DUI Contest",
            "Track": "Contest",
            "Key": "tdui17contest-contest-01-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAyush+Bhargava%2C+Jeffrey+Bertrand%2C+and+Sabarish+V.+Babu+%22AACT%3A+A+Mobile+Augmented+Reality+Application+for+Art+Creation%22",
            "URLvideo": "https%3A%2F%2Fwww.dropbox.com%2Fs%2Fvk3y9kspt2rsk80%2Fvideo6.mp4%3Fdl%3D0",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Ayush Bhargava, Jeffrey Bertrand, and Sabarish V. Babu",
            "AffiliationsString": "Clemson University, USA",
            "Authors": [
                "Ayush Bhargava @ Clemson University, USA",
                "Jeffrey Bertrand @ Clemson University, USA",
                "Sabarish V. Babu @ Clemson University, USA"
            ],
            "Affiliations": [
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA"
            ],
            "Abstract": "In this paper, we present Augmented-Art Creation Tool (AACT) as our solution to the IEEE 3DUI 2017 challenge. Our solution employs multi-finger touch gestures along with the built-in camera and accelerometer on a mobile device for interaction in an Augmented Reality (AR) setup. We leverage a user&#039;s knowledge of touch gestures like pinching, swiping, etc. and physical device movement to interact with the environment making the metaphor intuitive. The system helps prevent occlusion by using the accelerometer and allowing touch gestures anywhere on the screen. The interaction metaphor allows for successful art piece creation and assembly.",
            "Award": "",
            "Keywords": ""
        },
        {
            "Title": "HOT: Hold your Own Tools for AR-Based Constructive Art",
            "Type": "3DUI Contest",
            "Track": "Contest",
            "Key": "tdui17contest-contest-02-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DGiuseppe+Attanasio%2C+Alberto+Cannav%C3%B2%2C+Francesca+Cibrario%2C+Fabrizio+Lamberti%2C+Paolo+Montuschi%2C+and+Gianluca+Paravati+%22HOT%3A+Hold+your+Own+Tools+for+AR-Based+Constructive+Art%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Giuseppe Attanasio, Alberto Cannavò, Francesca Cibrario, Fabrizio Lamberti, Paolo Montuschi, and Gianluca Paravati",
            "AffiliationsString": "Politecnico di Torino, Italy",
            "Authors": [
                "Giuseppe Attanasio @ Politecnico di Torino, Italy",
                "Alberto Cannavò @ Politecnico di Torino, Italy",
                "Francesca Cibrario @ Politecnico di Torino, Italy",
                "Fabrizio Lamberti @ Politecnico di Torino, Italy",
                "Paolo Montuschi @ Politecnico di Torino, Italy",
                "Gianluca Paravati @ Politecnico di Torino, Italy"
            ],
            "Affiliations": [
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy"
            ],
            "Abstract": "Using digital instruments to support artistic expression and creativity is a hot topic. In this work, we focused on the design of a suitable interface for Augmented Reality-based constructive art on handheld devices. Issues to be faced encompassed how to give artists sense of spatial dimensions, how to provide them with different tools for realizing artworks, and how much moving away from ``the real&#039;&#039; and going towards ``the virtual&#039;&#039;. Through a touch-capable device, such as a smartphone or a tablet, we offer artists a clean workspace, where they can decide when to introduce artworks and tools. In fact, besides exploiting the multi-touch functionality and the gyroscopes/accelerometers to manipulate artworks in six degrees of freedom (6DOF), the proposed solution exploits a set of printed markers that can be brought into the camera&#039;s field of view to make specific virtual tools appear in the augmented scene. With such tools, artists can decide to control, e.g., manipulation speed, scale factor, scene parameters, etc., thus complementing functionalities that can be accessed via the device&#039;s screen.",
            "Award": "",
            "Keywords": "3D User Interfaces;  Augmented Reality;  Mobile Devices;  Constructive Art;  Customized Tags"
        },
        {
            "Title": "Batmen Beyond: Natural 3D Manipulation with the BatWand",
            "Type": "3DUI Contest",
            "Track": "Contest",
            "Key": "tdui17contest-contest-03-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAndr%C3%A9+Montes+Rodrigues%2C+Olavo+Belloc%2C+Eduardo+Zilles+Borba%2C+Mario+Nagamura%2C+and+Marcelo+Knorich+Zuffo+%22Batmen+Beyond%3A+Natural+3D+Manipulation+with+the+BatWand%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "André Montes Rodrigues, Olavo Belloc, Eduardo Zilles Borba, Mario Nagamura, and Marcelo Knorich Zuffo",
            "AffiliationsString": "University of São Paulo, Brazil",
            "Authors": [
                "André Montes Rodrigues @ University of São Paulo, Brazil",
                "Olavo Belloc @ University of São Paulo, Brazil",
                "Eduardo Zilles Borba @ University of São Paulo, Brazil",
                "Mario Nagamura @ University of São Paulo, Brazil",
                "Marcelo Knorich Zuffo @ University of São Paulo, Brazil"
            ],
            "Affiliations": [
                "University of São Paulo, Brazil",
                "University of São Paulo, Brazil",
                "University of São Paulo, Brazil",
                "University of São Paulo, Brazil",
                "University of São Paulo, Brazil"
            ],
            "Abstract": "In this work we present an interactive 3D object manipulation system using off the shelf mobile devices coupled with Augmented Reality (AR) technology that allows editing 3D objects by way of natural interactions based on tangible interfaces paradigms. The set-up consists of a mobile device, an interactive wand marker and AR markers laid on a table. The system allows users to change viewpoint and execute operations on 3D objects - simultaneous translation and rotation, scaling, cloning or deleting - by unconstrained natural interactions, leveraging user’s proficiency on daily object manipulation tasks and speeding up such typical 3D manipulation operations. Depth perception was significantly enhanced with dynamic shadows, allowing fast alignment and accurate positioning of objects. The prototype presented here allows successful completion of the three challenges proposed by the 2017 3DUI Contest, as validated by a preliminary informal user study with participants from the target audience and also from the general public.",
            "Award": "",
            "Keywords": "Human-centered computing ~ Interaction techniques;  Human-centered computing ~ Mixed / augmented reality;  Computing methodologies ~ Graphics systems and interfaces"
        },
        {
            "Title": "SculptAR: An Augmented Reality Interaction System",
            "Type": "3DUI Contest",
            "Track": "Contest",
            "Key": "tdui17contest-contest-04-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DVicenzo+Abichequer+Sangalli%2C+Thomas+Volpato+de+Oliveira%2C+Leonardo+Pavanatto+Soares%2C+and+Marcio+Sarroglia+Pinho+%22SculptAR%3A+An+Augmented+Reality+Interaction+System%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Vicenzo Abichequer Sangalli, Thomas Volpato de Oliveira, Leonardo Pavanatto Soares, and Marcio Sarroglia Pinho",
            "AffiliationsString": "PUCRS, Brazil",
            "Authors": [
                "Vicenzo Abichequer Sangalli @ PUCRS, Brazil",
                "Thomas Volpato de Oliveira @ PUCRS, Brazil",
                "Leonardo Pavanatto Soares @ PUCRS, Brazil",
                "Marcio Sarroglia Pinho @ PUCRS, Brazil"
            ],
            "Affiliations": [
                "PUCRS, Brazil",
                "PUCRS, Brazil",
                "PUCRS, Brazil",
                "PUCRS, Brazil"
            ],
            "Abstract": "In this work, a 3D mobile interface to create sculptures in an augmented reality environment tracked by AR markers is presented. A raycasting technique was used to interact with the objects in the scene, as well as 2D and 3D interfaces to manipulate and modify the objects. The users can move, delete, paint and duplicate virtual objects using 6 DOFs techniques.",
            "Award": "",
            "Keywords": "3D Interaction;  Augmented Reality;  Mobile"
        },
        {
            "Title": "Augmented Reality Digital Sculpture",
            "Type": "3DUI Contest",
            "Track": "Contest",
            "Key": "tdui17contest-contest-05-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DNathanael+Harrell%2C+Grayson+Bonds%2C+Xiaojia+Wang%2C+Sean+Valent%2C+Sabarish+V.+Babu%2C+and+Elham+Ebrahimi+%22Augmented+Reality+Digital+Sculpture%22",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2FMa4d0V7lGE0",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Nathanael Harrell, Grayson Bonds, Xiaojia Wang, Sean Valent, Sabarish V. Babu, and Elham Ebrahimi",
            "AffiliationsString": "Clemson University, USA",
            "Authors": [
                "Nathanael Harrell @ Clemson University, USA",
                "Grayson Bonds @ Clemson University, USA",
                "Xiaojia Wang @ Clemson University, USA",
                "Sean Valent @ Clemson University, USA",
                "Sabarish V. Babu @ Clemson University, USA",
                "Elham Ebrahimi @ Clemson University, USA"
            ],
            "Affiliations": [
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA",
                "Clemson University, USA"
            ],
            "Abstract": "&#60;p&#62;We present our metaphor for object translation, rotation, and rescaling and particle parameter manipulation in an augmented reality environment using an Android smartphone or tablet for the 2017 3DUI Competition in Los Angeles, California. Our metaphor aims to map the three-dimensional interaction of objects in a real world space to the two-dimensional plane of a smartphone or tablet screen. Our final product is the result of experimentation with different metaphors for translation, rotation, rescaling, and particle parameter manipulation and was guided by the feedback of voluntary product testers. The result is an interaction technique between a mobile device and the virtual world which we believe to be intuitive.&#60;/p&#62;",
            "Award": "",
            "Keywords": "Augmented Reality;  Mobile Devices;  Touch Screens;  User Interface Design"
        },
        {
            "Title": "Collaborative Manipulation of 3D Virtual Objects in Augmented Reality Scenarios using Mobile Devices",
            "Type": "3DUI Contest",
            "Track": "Contest",
            "Key": "tdui17contest-contest-06-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJer%C3%B4nimo+G.+Grandi%2C+Iago+Berndt%2C+Henrique+G.+Debarba%2C+Luciana+Nedel%2C+and+Anderson+Maciel+%22Collaborative+Manipulation+of+3D+Virtual+Objects+in+Augmented+Reality+Scenarios+using+Mobile+Devices%22",
            "URLvideo": "https%3A%2F%2Fwww.dropbox.com%2Fs%2Ftwxdhj5wdzkrnma%2FUFRGS-CollaborativeAR-CameraReady.mp4%3Fdl%3D0",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Jerônimo G. Grandi, Iago Berndt, Henrique G. Debarba, Luciana Nedel, and Anderson Maciel",
            "AffiliationsString": "Federal University of Rio Grande do Sul, Brazil; Artanim Foundation, Switzerland",
            "Authors": [
                "Jerônimo G. Grandi @ Federal University of Rio Grande do Sul, Brazil",
                "Iago Berndt @ Federal University of Rio Grande do Sul, Brazil",
                "Henrique G. Debarba @ Artanim Foundation, Switzerland",
                "Luciana Nedel @ Federal University of Rio Grande do Sul, Brazil",
                "Anderson Maciel @ Federal University of Rio Grande do Sul, Brazil"
            ],
            "Affiliations": [
                "Federal University of Rio Grande do Sul, Brazil",
                "Federal University of Rio Grande do Sul, Brazil",
                "Artanim Foundation, Switzerland",
                "Federal University of Rio Grande do Sul, Brazil",
                "Federal University of Rio Grande do Sul, Brazil"
            ],
            "Abstract": "Interaction in augmented reality environments may be very complex, depending on the degrees of freedom (DOFs) required for the task. In this work we present a 3D user interface for collaborative manipulation of virtual objects in augmented reality (AR) environments. It maps position -- acquired with a camera and fiducial markers -- and touchscreen input of a handheld device into gestures to select, move, rotate and scale virtual objects. As these transformations require the control of multiple DOFs, collaboration is proposed as a solution to coordinate the modification of each and all the available DOFs. Users are free to decide their own manipulation roles. All virtual elements are displayed directly on the mobile device as an overlay of the camera capture, providing an individual point of view of the AR environment to each user.",
            "Award": "",
            "Keywords": "Augmented reality;  mobile devices;  collaborative 3DUI"
        },
        {
            "Title": "T4T: Tangible Interface for Tuning 3D Object Manipulation Tools",
            "Type": "3DUI Contest",
            "Track": "Contest",
            "Key": "tdui17contest-contest-07-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAlberto+Cannav%C3%B2%2C+Fabio+Cermelli%2C+Vincenzo+Chiaramida%2C+Giovanni+Ciccone%2C+Fabrizio+Lamberti%2C+Paolo+Montuschi%2C+and+Gianluca+Paravati+%22T4T%3A+Tangible+Interface+for+Tuning+3D+Object+Manipulation+Tools%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Alberto Cannavò, Fabio Cermelli, Vincenzo Chiaramida, Giovanni Ciccone, Fabrizio Lamberti, Paolo Montuschi, and Gianluca Paravati",
            "AffiliationsString": "Politecnico di Torino, Italy",
            "Authors": [
                "Alberto Cannavò @ Politecnico di Torino, Italy",
                "Fabio Cermelli @ Politecnico di Torino, Italy",
                "Vincenzo Chiaramida @ Politecnico di Torino, Italy",
                "Giovanni Ciccone @ Politecnico di Torino, Italy",
                "Fabrizio Lamberti @ Politecnico di Torino, Italy",
                "Paolo Montuschi @ Politecnico di Torino, Italy",
                "Gianluca Paravati @ Politecnico di Torino, Italy"
            ],
            "Affiliations": [
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy",
                "Politecnico di Torino, Italy"
            ],
            "Abstract": "A 3D User Interface for manipulating virtual objects in Augmented Reality scenarios on handheld devices is presented. The proposed solution takes advantage of two interaction techniques. The former (named ``cursor mode&#039;&#039;) exploits a cursor, which position and movement are bound to the view of the device; the cursor allows the user to select objects and to perform coarse-grain manipulations by moving the device. The latter (referred to as ``tuning mode&#039;&#039;) uses the physical affordances of a tangible interface to provide the user with the possibility to refine objects in all their aspects (position, rotation, scale, color, and so forth) with a fine-grained control.",
            "Award": "",
            "Keywords": "3D User Interfaces;  Augmented Reality;  Mobile Devices;  Tangible Interfaces"
        },
        {
            "Title": "Augmented Reality Exhibits of Constructive Art: 8th Annual 3DUI Contest",
            "Type": "3DUI Contest",
            "Track": "Contest",
            "Key": "tdui17contest-contest-08-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRongkai+Guo%2C+Ryan+P.+McMahan%2C+and+Benjamin+Weyers+%22Augmented+Reality+Exhibits+of+Constructive+Art%3A+8th+Annual+3DUI+Contest%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Rongkai Guo, Ryan P. McMahan, and Benjamin Weyers",
            "AffiliationsString": "Kennesaw State University, USA; University of Texas at Dallas, USA; RWTH Aachen University, Germany",
            "Authors": [
                "Rongkai Guo @ Kennesaw State University, USA",
                "Ryan P. McMahan @ University of Texas at Dallas, USA",
                "Benjamin Weyers @ RWTH Aachen University, Germany"
            ],
            "Affiliations": [
                "Kennesaw State University, USA",
                "University of Texas at Dallas, USA",
                "RWTH Aachen University, Germany"
            ],
            "Abstract": "The 8th annual IEEE 3DUI Contest focuses on the development of a 3D User Interface (3DUI) for an Augmented Reality (AR) exhibit of constructive art. The 3DUI Contest is part of the 2017 IEEE Symposium on 3D User Interfaces held in Los Angeles, California. The contest was open to anyone interested in 3DUIs, from researchers to students, enthusiasts, and professionals. The purpose of the contest is to stimulate innovative and creative solutions to challenging 3DUI problems.",
            "Award": "",
            "Keywords": "3DUI contest;  augmented reality;  constructive art"
        }
    ],
    "Sessions": [
        {
              "Id": "Eiyeix6xie",
              "Title": "Message from the Chairs",
            "ShortTitle": "Message from the Chairs",
            "Type": "Frontmatter",
            "ShortType": "Frontmatter",
            "Key": "1970-01-01 00:00 Message from the Chairs",
            "Day": "1970-01-01",
            "Time": "00:00 - 01:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17FOREWORD",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17foreword-fm001-p"
            ]
        },
        {
              "Id": "nieKeis9EZ",
              "Title": "Posters",
            "ShortTitle": "Posters",
            "Type": "Posters",
            "ShortType": "Posters",
            "Key": "1970-01-01 00:00 Posters",
            "Day": "1970-01-01",
            "Time": "00:00 - 01:00",
            "Location": "",
            "LocationIndex": "2",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17POSTERS",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17posters-posters-103-p",
                "tdui17posters-posters-108-p",
                "tdui17posters-posters-110-p",
                "tdui17posters-posters-112-p",
                "tdui17posters-posters-113-p",
                "tdui17posters-posters-115-p",
                "tdui17posters-posters-116-p",
                "tdui17posters-posters-117-p",
                "tdui17posters-posters-119-p",
                "tdui17posters-postersposters-126-p",
                "tdui17posters-postersposters-127-p",
                "tdui17posters-postersposters-129-p",
                "tdui17posters-postersposters-131-p",
                "tdui17posters-postersposters-132-p",
                "tdui17posters-postersposters-133-p",
                "tdui17posters-postersposters-134-p",
                "tdui17posters-postersposters-137-p",
                "tdui17posters-postersposters-138-p",
                "tdui17posters-postersposters-139-p",
                "tdui17posters-postersposters-140-p",
                "tdui17posters-postersposters-141-p",
                "tdui17posters-postersposters-142-p",
                "tdui17posters-postersposters-143-p",
                "tdui17posters-postersposters-144-p",
                "tdui17posters-postersposters-145-p",
                "tdui17posters-postersposters-146-p",
                "tdui17posters-postersposters-147-p"
            ]
        },
        {
              "Id": "musheeGh0o",
              "Title": "Contest",
            "ShortTitle": "Contest",
            "Type": "Contest",
            "ShortType": "Contest",
            "Key": "1970-01-01 00:00 Contest",
            "Day": "1970-01-01",
            "Time": "00:00 - 01:00",
            "Location": "",
            "LocationIndex": "3",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17CONTEST",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17contest-contest-01-p",
                "tdui17contest-contest-02-p",
                "tdui17contest-contest-03-p",
                "tdui17contest-contest-04-p",
                "tdui17contest-contest-05-p",
                "tdui17contest-contest-06-p",
                "tdui17contest-contest-07-p",
                "tdui17contest-contest-08-p"
            ]
        },
        {
              "Id": "thexoChee9",
              "Title": "Visualization and Tracking",
            "ShortTitle": "Visualization and Tracking",
            "Type": "Papers",
            "ShortType": "Papers",
            "Key": "2017-03-18 09:00 Visualization and Tracking",
            "Day": "2017-03-18",
            "Time": "09:00 - 10:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17main-papers-162-p",
                "tdui17main-papers-191-p",
                "tdui17main-papers-212-p"
            ]
        },
        {
              "Id": "Moe4aiqui3",
              "Title": "3D Interaction",
            "ShortTitle": "3D Interaction",
            "Type": "Papers",
            "ShortType": "Papers",
            "Key": "2017-03-18 10:30 3D Interaction",
            "Day": "2017-03-18",
            "Time": "10:30 - 12:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17main-papers-118-p",
                "tdui17main-papers-121-p",
                "tdui17main-papers-133-p",
                "tdui17main-papers-176-p"
            ]
        },
        {
              "Id": "Thoon3ohph",
              "Title": "Evaluation",
            "ShortTitle": "Evaluation",
            "Type": "Papers",
            "ShortType": "Papers",
            "Key": "2017-03-18 13:30 Evaluation",
            "Day": "2017-03-18",
            "Time": "13:30 - 14:50",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17main-papers-172-p",
                "tdui17main-papers-136-p",
                "tdui17main-papers-211-p",
                "tdui17main-papers-204-p"
            ]
        },
        {
              "Id": "ceYah5hie1",
              "Title": "Haptics",
            "ShortTitle": "Haptics",
            "Type": "Papers",
            "ShortType": "Papers",
            "Key": "2017-03-18 16:00 Haptics",
            "Day": "2017-03-18",
            "Time": "16:00 - 17:15",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17main-papers-197-p",
                "tdui17main-papers-173-p",
                "tdui17main-papers-180-p",
                "tdui17main-papers-213-p"
            ]
        },
        {
              "Id": "fae7Aesoo8",
              "Title": "Navigation",
            "ShortTitle": "Navigation",
            "Type": "Papers",
            "ShortType": "Papers",
            "Key": "2017-03-19 10:15 Navigation",
            "Day": "2017-03-19",
            "Time": "10:15 - 12:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17main-papers-130-p",
                "tdui17main-papers-198-p",
                "tdui17main-papers-132-p",
                "tdui17main-papers-149-p",
                "tdui17main-papers-137-p"
            ]
        },
        {
              "Id": "EZee3Sahku",
              "Title": "Gestures",
            "ShortTitle": "Gestures",
            "Type": "Papers",
            "ShortType": "Papers",
            "Key": "2017-03-19 13:30 Gestures",
            "Day": "2017-03-19",
            "Time": "13:30 - 15:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17main-papers-214-p",
                "tdui17main-papers-182-p",
                "tdui17main-papers-215-p",
                "tdui17main-papers-110-p",
                "tdui17main-papers-199-p"
            ]
        },
        {
              "Id": "quau3Sai1d",
              "Title": "Augmented Reality",
            "ShortTitle": "Augmented Reality",
            "Type": "Papers",
            "ShortType": "Papers",
            "Key": "2017-03-19 15:30 Augmented Reality",
            "Day": "2017-03-19",
            "Time": "15:30 - 17:00",
            "Location": "",
            "LocationIndex": "1",
            "ChairsString": "",
            "Chairs": [
            ],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "TDUI17MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "tdui17main-papers-167-p",
                "tdui17main-papers-141-p",
                "tdui17main-papers-195-p",
                "tdui17main-papers-163-p"
            ]
        }
    ],
    "People": [
        {
            "Name": "Merwan Achibet",
            "Affiliation": "Inria, France",
            "Key": "Merwan Achibet @ Inria, France",
            "Id": "ce1b78a1e5",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Luis Afonso",
            "Affiliation": "University of Aveiro, Portugal",
            "Key": "Luis Afonso @ University of Aveiro, Portugal",
            "Id": "08ddfd25e6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Astolfo Araujo",
            "Affiliation": "University of São Paulo, Brasil",
            "Key": "Astolfo Araujo @ University of São Paulo, Brasil",
            "Id": "1e535e1d83",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jérôme Ardouin",
            "Affiliation": "n.n., n.n.",
            "Key": "Jérôme Ardouin @ n.n., n.n.",
            "Id": "72f65b0d85",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ferran Argelaguet",
            "Affiliation": "Inria, France",
            "Key": "Ferran Argelaguet @ Inria, France",
            "Id": "f600f3b73c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Fernando Argelaguet-Sanz",
            "Affiliation": "Inria, France",
            "Key": "Fernando Argelaguet-Sanz @ Inria, France",
            "Id": "c455d7b106",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Giuseppe Attanasio",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Giuseppe Attanasio @ Politecnico di Torino, Italy",
            "Id": "9641be2f60",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sabarish V. Babu",
            "Affiliation": "Clemson University, USA",
            "Key": "Sabarish V. Babu @ Clemson University, USA",
            "Id": "f70fca021e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jeremy Bailenson",
            "Affiliation": "Stanford University, USA",
            "Key": "Jeremy Bailenson @ Stanford University, USA",
            "Id": "7b24fbba87",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ruben Balcazar",
            "Affiliation": "Florida International University, USA",
            "Key": "Ruben Balcazar @ Florida International University, USA",
            "Id": "c2b57c27a4",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Armando Barreto",
            "Affiliation": "Florida International University, USA",
            "Key": "Armando Barreto @ Florida International University, USA",
            "Id": "4793b52487",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Oliver Basting",
            "Affiliation": "TH Köln, Germany",
            "Key": "Oliver Basting @ TH Köln, Germany",
            "Id": "616f32bf9b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Dominique Bechmann",
            "Affiliation": "University of Strasbourg, France",
            "Key": "Dominique Bechmann @ University of Strasbourg, France",
            "Id": "0e386363f9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Olavo Belloc",
            "Affiliation": "University of São Paulo, Brazil",
            "Key": "Olavo Belloc @ University of São Paulo, Brazil",
            "Id": "e7712999ce",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jonathan Bernal",
            "Affiliation": "Florida International University, USA",
            "Key": "Jonathan Bernal @ Florida International University, USA",
            "Id": "62a77a1d1d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Iago Berndt",
            "Affiliation": "Federal University of Rio Grande do Sul, Brazil",
            "Key": "Iago Berndt @ Federal University of Rio Grande do Sul, Brazil",
            "Id": "26ff08cfab",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jeffrey Bertrand",
            "Affiliation": "Clemson University, USA",
            "Key": "Jeffrey Bertrand @ Clemson University, USA",
            "Id": "5fbb7b3589",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ayush Bhargava",
            "Affiliation": "Clemson University, USA",
            "Key": "Ayush Bhargava @ Clemson University, USA",
            "Id": "afc30b8f45",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mark Billinghurst",
            "Affiliation": "University of South Australia, Australia",
            "Key": "Mark Billinghurst @ University of South Australia, Australia",
            "Id": "cbe5062c42",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Andrea Bönsch",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Andrea Bönsch @ RWTH Aachen University, Germany",
            "Id": "58d9ab8db5",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Grayson Bonds",
            "Affiliation": "Clemson University, USA",
            "Key": "Grayson Bonds @ Clemson University, USA",
            "Id": "104e8ca17f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eduardo Zilles Borba",
            "Affiliation": "University of São Paulo, Brasil",
            "Key": "Eduardo Zilles Borba @ University of São Paulo, Brasil",
            "Id": "ff55df82bf",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eduardo Zilles Borba",
            "Affiliation": "University of São Paulo, Brazil",
            "Key": "Eduardo Zilles Borba @ University of São Paulo, Brazil",
            "Id": "cbc92a115b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Christoph Borst",
            "Affiliation": "University of Louisiana at Lafayette, USA",
            "Key": "Christoph Borst @ University of Louisiana at Lafayette, USA",
            "Id": "c168097abe",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sabah Boustila",
            "Affiliation": "University of Strasbourg, France",
            "Key": "Sabah Boustila @ University of Strasbourg, France",
            "Id": "76c75c25ff",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Doug Bowman",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Doug Bowman @ Virginia Tech, USA",
            "Id": "26bf2eacab",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Gerd Bruder",
            "Affiliation": "University of Central Florida, USA",
            "Key": "Gerd Bruder @ University of Central Florida, USA",
            "Id": "85faaabc5e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alberto Cannavò",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Alberto Cannavò @ Politecnico di Torino, Italy",
            "Id": "bb497edc77",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Antonio Capobianco",
            "Affiliation": "University of Strasbourg, France",
            "Key": "Antonio Capobianco @ University of Strasbourg, France",
            "Id": "a7be2ea704",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Fabio Cermelli",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Fabio Cermelli @ Politecnico di Torino, Italy",
            "Id": "53afa30ee3",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Vikram Chandrashekar",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Vikram Chandrashekar @ Virginia Tech, USA",
            "Id": "7c6e5d4d9b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Yun Suk Chang",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Yun Suk Chang @ University of California at Santa Barbara, USA",
            "Id": "594f068256",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jean-Remy Chardonnet",
            "Affiliation": "CNRS, France",
            "Key": "Jean-Remy Chardonnet @ CNRS, France",
            "Id": "259bfe4473",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Amine Chellali",
            "Affiliation": "University of Evry, France",
            "Key": "Amine Chellali @ University of Evry, France",
            "Id": "827896c5c6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Vincenzo Chiaramida",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Vincenzo Chiaramida @ Politecnico di Torino, Italy",
            "Id": "921299bbbc",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Miriam Luque Chipana",
            "Affiliation": "University of Canterbury, New Zealand",
            "Key": "Miriam Luque Chipana @ University of Canterbury, New Zealand",
            "Id": "e881fed61a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Tanvir Irfan Chowdhury",
            "Affiliation": "University of Texas at San Antonio, USA",
            "Key": "Tanvir Irfan Chowdhury @ University of Texas at San Antonio, USA",
            "Id": "090d316009",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Andrew Ciambrone",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Andrew Ciambrone @ Virginia Tech, USA",
            "Id": "7e429f9154",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Francesca Cibrario",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Francesca Cibrario @ Politecnico di Torino, Italy",
            "Id": "f51dd14b42",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Giovanni Ciccone",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Giovanni Ciccone @ Politecnico di Torino, Italy",
            "Id": "a32f02f6d9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Damien Clergeaud",
            "Affiliation": "Inria, France",
            "Key": "Damien Clergeaud @ Inria, France",
            "Id": "d2d489643c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Rory Clifford",
            "Affiliation": "University of Canterbury, New Zealand",
            "Key": "Rory Clifford @ University of Canterbury, New Zealand",
            "Id": "cef14c0247",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eduardo Cordeiro",
            "Affiliation": "University of Lisbon, Portugal",
            "Key": "Eduardo Cordeiro @ University of Lisbon, Portugal",
            "Id": "fbeed09856",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ana Grassiele Correa",
            "Affiliation": "University of São Paulo, Brasil",
            "Key": "Ana Grassiele Correa @ University of São Paulo, Brasil",
            "Id": "66d8e06026",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Guillaume Cortes",
            "Affiliation": "Realyz, France",
            "Key": "Guillaume Cortes @ Realyz, France",
            "Id": "975269dc4e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Raphael Costa",
            "Affiliation": "University of Texas at San Antonio, USA",
            "Key": "Raphael Costa @ University of Texas at San Antonio, USA",
            "Id": "409a81281f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Salam Daher",
            "Affiliation": "University of Central Florida, USA",
            "Key": "Salam Daher @ University of Central Florida, USA",
            "Id": "270c79dc9c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Henrique G. Debarba",
            "Affiliation": "Artanim Foundation, Switzerland",
            "Key": "Henrique G. Debarba @ Artanim Foundation, Switzerland",
            "Id": "0e90eb1915",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Thomas Volpato de Oliveira",
            "Affiliation": "PUCRS, Brazil",
            "Key": "Thomas Volpato de Oliveira @ PUCRS, Brazil",
            "Id": "82553c9526",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Paulo Dias",
            "Affiliation": "University of Aveiro, Portugal",
            "Key": "Paulo Dias @ University of Aveiro, Portugal",
            "Id": "565a00ed40",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jose Luis Dorado",
            "Affiliation": "CNRS, France",
            "Key": "Jose Luis Dorado @ CNRS, France",
            "Id": "de2be89958",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jose Dorado",
            "Affiliation": "University of Andes, Colombia",
            "Key": "Jose Dorado @ University of Andes, Colombia",
            "Id": "7a20f9d8c9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mélanie Ducoffe",
            "Affiliation": "ENS, France",
            "Key": "Mélanie Ducoffe @ ENS, France",
            "Id": "be018d9f8d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Elham Ebrahimi",
            "Affiliation": "Clemson University, USA",
            "Key": "Elham Ebrahimi @ Clemson University, USA",
            "Id": "b5cd2dbc8d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Arin M. Ellingson",
            "Affiliation": "University of Minnesota, USA",
            "Key": "Arin M. Ellingson @ University of Minnesota, USA",
            "Id": "31b1f68b94",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hicham Elmongui",
            "Affiliation": "Alexandria University, Egypt",
            "Key": "Hicham Elmongui @ Alexandria University, Egypt",
            "Id": "5f66f4e53c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Aida Erfanian",
            "Affiliation": "University of Calgary, Canada",
            "Key": "Aida Erfanian @ University of Calgary, Canada",
            "Id": "060561b3f4",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Fabien Ferlay",
            "Affiliation": "CEA, France",
            "Key": "Fabien Ferlay @ CEA, France",
            "Id": "baf1e5d504",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alfredo Ferreira",
            "Affiliation": "INESC-ID, Portugal",
            "Key": "Alfredo Ferreira @ INESC-ID, Portugal",
            "Id": "7b8f4e47b6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Carlos Ferreira",
            "Affiliation": "University of Aveiro, Portugal",
            "Key": "Carlos Ferreira @ University of Aveiro, Portugal",
            "Id": "af1445ce0e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ricardo Ferreira",
            "Affiliation": "Técnico Lisboa, Portugal",
            "Key": "Ricardo Ferreira @ Técnico Lisboa, Portugal",
            "Id": "2a5b5eb507",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Pablo Figueroa",
            "Affiliation": "University of Andes, Colombia",
            "Key": "Pablo Figueroa @ University of Andes, Colombia",
            "Id": "478bc2508b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sebastian Freitag",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Sebastian Freitag @ RWTH Aachen University, Germany",
            "Id": "f61fcaae27",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Arnulph Fuhrmann",
            "Affiliation": "TH Köln, Germany",
            "Key": "Arnulph Fuhrmann @ TH Köln, Germany",
            "Id": "5069a3f60b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alain Galvan",
            "Affiliation": "Florida International University, USA",
            "Key": "Alain Galvan @ Florida International University, USA",
            "Id": "499e8e5e3b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Adrien Girard",
            "Affiliation": "Inria, France",
            "Key": "Adrien Girard @ Inria, France",
            "Id": "98adb10407",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Denis Gracanin",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Denis Gracanin @ Virginia Tech, USA",
            "Id": "ced01d7e86",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Anand Gramopadhye",
            "Affiliation": "Clemson University, USA",
            "Key": "Anand Gramopadhye @ Clemson University, USA",
            "Id": "6bd47f444b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jerônimo G. Grandi",
            "Affiliation": "Federal University of Rio Grande do Sul, Brazil",
            "Key": "Jerônimo G. Grandi @ Federal University of Rio Grande do Sul, Brazil",
            "Id": "15b9fb1a23",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Remi Gribonval",
            "Affiliation": "Inria, France",
            "Key": "Remi Gribonval @ Inria, France",
            "Id": "1321e8d6b1",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jens Grubert",
            "Affiliation": "Coburg University, Germany",
            "Key": "Jens Grubert @ Coburg University, Germany",
            "Id": "214225782d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Stefan Grünvogel",
            "Affiliation": "TH Köln, Germany",
            "Key": "Stefan Grünvogel @ TH Köln, Germany",
            "Id": "e582161a8f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Pascal Guitton",
            "Affiliation": "University of Bordeaux, France",
            "Key": "Pascal Guitton @ University of Bordeaux, France",
            "Id": "68efb7ea6a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Rongkai Guo",
            "Affiliation": "Kennesaw State University, USA",
            "Key": "Rongkai Guo @ Kennesaw State University, USA",
            "Id": "e96f63c87c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ievgeniia Gutenko",
            "Affiliation": "Stony Brook University, USA",
            "Key": "Ievgeniia Gutenko @ Stony Brook University, USA",
            "Id": "ab3c925baf",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Martin Hachet",
            "Affiliation": "Inria, France",
            "Key": "Martin Hachet @ Inria, France",
            "Id": "4541d889d7",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Dustin Han",
            "Affiliation": "Texas A&M University, USA",
            "Key": "Dustin Han @ Texas A&M University, USA",
            "Id": "26fe24f893",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mohamed Handosa",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Mohamed Handosa @ Virginia Tech, USA",
            "Id": "87eabec5c9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Nathanael Harrell",
            "Affiliation": "Clemson University, USA",
            "Key": "Nathanael Harrell @ Clemson University, USA",
            "Id": "d5963ade59",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Abraham M. Hashemian",
            "Affiliation": "Simon Fraser University, Canada",
            "Key": "Abraham M. Hashemian @ Simon Fraser University, Canada",
            "Id": "e2793c06f4",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Satoshi Hashiguchi",
            "Affiliation": "Ritsumeikan University, Japan",
            "Key": "Satoshi Hashiguchi @ Ritsumeikan University, Japan",
            "Id": "ee36bd6944",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Paul Heidicker",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Paul Heidicker @ University of Hamburg, Germany",
            "Id": "ffd62e03bb",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Tiberio Hernández",
            "Affiliation": "University of Andes, Colombia",
            "Key": "Tiberio Hernández @ University of Andes, Colombia",
            "Id": "3e8756a3cf",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Tobias Hollerer",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Tobias Hollerer @ University of California at Santa Barbara, USA",
            "Id": "7416cdbf7b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Yaoping Hu",
            "Affiliation": "University of Calgary, Canada",
            "Key": "Yaoping Hu @ University of Calgary, Canada",
            "Id": "9eed9c0e32",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Tiana Johnson",
            "Affiliation": "Clemson University, USA",
            "Key": "Tiana Johnson @ Clemson University, USA",
            "Id": "3adaccdf02",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Joaquim Jorge",
            "Affiliation": "INESC-ID, Portugal",
            "Key": "Joaquim Jorge @ INESC-ID, Portugal",
            "Id": "bd7079805c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hiroyuki Kajimoto",
            "Affiliation": "University of Electro-Communications, Japan",
            "Key": "Hiroyuki Kajimoto @ University of Electro-Communications, Japan",
            "Id": "fd25997cbe",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Denis Kalkofen",
            "Affiliation": "Graz University of Technology, Austria",
            "Key": "Denis Kalkofen @ Graz University of Technology, Austria",
            "Id": "26f38891ea",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Arie Kaufman",
            "Affiliation": "Stony Brook University, USA",
            "Key": "Arie Kaufman @ Stony Brook University, USA",
            "Id": "67bd893223",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hannes Kaufmann",
            "Affiliation": "Vienna University of Technology, Austria",
            "Key": "Hannes Kaufmann @ Vienna University of Technology, Austria",
            "Id": "87229922bb",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Daniel F. Keefe",
            "Affiliation": "University of Minnesota, USA",
            "Key": "Daniel F. Keefe @ University of Minnesota, USA",
            "Id": "2a2469051d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Kangsoo Kim",
            "Affiliation": "University of Central Florida, USA",
            "Key": "Kangsoo Kim @ University of Central Florida, USA",
            "Id": "1da2291c5e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Kyungyoon Kim",
            "Affiliation": "University of Minnesota, USA",
            "Key": "Kyungyoon Kim @ University of Minnesota, USA",
            "Id": "e7c8eb7d8f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Asako Kimura",
            "Affiliation": "Ritsumeikan University, Japan",
            "Key": "Asako Kimura @ Ritsumeikan University, Japan",
            "Id": "39eb198dbb",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alexandra Kitson",
            "Affiliation": "Simon Fraser University, Canada",
            "Key": "Alexandra Kitson @ Simon Fraser University, Canada",
            "Id": "869e5d4674",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ryo Kodama",
            "Affiliation": "TOYOTA Central R&D Labs, Japan",
            "Key": "Ryo Kodama @ TOYOTA Central R&D Labs, Japan",
            "Id": "6baf6dcb3c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Masahiro Koge",
            "Affiliation": "University of Electro-Communications, Japan",
            "Key": "Masahiro Koge @ University of Electro-Communications, Japan",
            "Id": "080fa227c6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Yuki Kon",
            "Affiliation": "University of Electro-Communications, Japan",
            "Key": "Yuki Kon @ University of Electro-Communications, Japan",
            "Id": "bfbd2a0a93",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Navyaram Kondur",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Navyaram Kondur @ Virginia Tech, USA",
            "Id": "b74def5b1d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Regis Kopper",
            "Affiliation": "Duke University, USA",
            "Key": "Regis Kopper @ Duke University, USA",
            "Id": "326c59d6a9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ernst Kruijff",
            "Affiliation": "Bonn-Rhein-Sieg University of Applied Sciences, Germany",
            "Key": "Ernst Kruijff @ Bonn-Rhein-Sieg University of Applied Sciences, Germany",
            "Id": "495f0d2f7d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Torsten W. Kuhlen",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Torsten W. Kuhlen @ RWTH Aachen University, Germany",
            "Id": "7a2adcd5d6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Andreas Kunz",
            "Affiliation": "ETH Zurich, Switzerland",
            "Key": "Andreas Kunz @ ETH Zurich, Switzerland",
            "Id": "11e66ff110",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Nikki Kyllonen",
            "Affiliation": "University of Minnesota, USA",
            "Key": "Nikki Kyllonen @ University of Minnesota, USA",
            "Id": "2c4969d04c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Wallace Lages",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Wallace Lages @ Virginia Tech, USA",
            "Id": "76e65c989c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Fabrizio Lamberti",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Fabrizio Lamberti @ Politecnico di Torino, Italy",
            "Id": "d112f2f4f8",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eike Langbehn",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Eike Langbehn @ University of Hamburg, Germany",
            "Id": "facf6032cb",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Markus Lange",
            "Affiliation": "University of Würzburg, Germany",
            "Key": "Markus Lange @ University of Würzburg, Germany",
            "Id": "ad5122f48d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Edward Lank",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Edward Lank @ University of Waterloo, Canada",
            "Id": "0f126c34df",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Rebekah L. Lawrence",
            "Affiliation": "University of Minnesota, USA",
            "Key": "Rebekah L. Lawrence @ University of Minnesota, USA",
            "Id": "6db735b412",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Anatole Lécuyer",
            "Affiliation": "Inria, France",
            "Key": "Anatole Lécuyer @ Inria, France",
            "Id": "cf6e941f51",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Gun Lee",
            "Affiliation": "University of South Australia, Australia",
            "Key": "Gun Lee @ University of South Australia, Australia",
            "Id": "3faa51e4c6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Myungho Lee",
            "Affiliation": "University of Central Florida, USA",
            "Key": "Myungho Lee @ University of Central Florida, USA",
            "Id": "c8498b704e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Benoît Le Gouis",
            "Affiliation": "IRISA, France",
            "Key": "Benoît Le Gouis @ IRISA, France",
            "Id": "ee518f87d7",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Pierre-Alexandre Léziart",
            "Affiliation": "ENS, France",
            "Key": "Pierre-Alexandre Léziart @ ENS, France",
            "Id": "6b296b2a8f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Robert Lindeman",
            "Affiliation": "HIT Lab, New Zealand",
            "Key": "Robert Lindeman @ HIT Lab, New Zealand",
            "Id": "a9bf68a5e4",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Robert Lindeman",
            "Affiliation": "University of Canterbury, New Zealand",
            "Key": "Robert Lindeman @ University of Canterbury, New Zealand",
            "Id": "6443187a12",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Robert W. Lindeman",
            "Affiliation": "University of Canterbury, New Zealand",
            "Key": "Robert W. Lindeman @ University of Canterbury, New Zealand",
            "Id": "ca9af7f289",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xiaohan Liu",
            "Affiliation": "Xiamen University, China",
            "Key": "Xiaohan Liu @ Xiamen University, China",
            "Id": "e953c90d08",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Donald Loffredo",
            "Affiliation": "University of Houston-Victoria, USA",
            "Key": "Donald Loffredo @ University of Houston-Victoria, USA",
            "Id": "f86f14bd2a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Roseli Lopes",
            "Affiliation": "University of São Paulo, Brasil",
            "Key": "Roseli Lopes @ University of São Paulo, Brasil",
            "Id": "19889d48a8",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Céphise Louison",
            "Affiliation": "CEA, France",
            "Key": "Céphise Louison @ CEA, France",
            "Id": "24b5007b33",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Bo Luan",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Bo Luan @ University of California at Santa Barbara, USA",
            "Id": "5cc4c34b24",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Paula M. Ludewig",
            "Affiliation": "University of Minnesota, USA",
            "Key": "Paula M. Ludewig @ University of Minnesota, USA",
            "Id": "a5ace870b2",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Anderson Maciel",
            "Affiliation": "Federal University of Rio Grande do Sul, Brazil",
            "Key": "Anderson Maciel @ Federal University of Rio Grande do Sul, Brazil",
            "Id": "786e4a43fa",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Scott MacKenzie",
            "Affiliation": "York University, Canada",
            "Key": "Scott MacKenzie @ York University, Canada",
            "Id": "c4ce6f7c48",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Kapil Chalil Madathil",
            "Affiliation": "Clemson University, USA",
            "Key": "Kapil Chalil Madathil @ Clemson University, USA",
            "Id": "cc5c1a21e1",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Maud Marchal",
            "Affiliation": "IRISA, France",
            "Key": "Maud Marchal @ IRISA, France",
            "Id": "317329b501",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eric Marchand",
            "Affiliation": "University of Rennes 1, France",
            "Key": "Eric Marchand @ University of Rennes 1, France",
            "Id": "ac509848d9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ryan P. McMahan",
            "Affiliation": "University of Texas at Dallas, USA",
            "Key": "Ryan P. McMahan @ University of Texas at Dallas, USA",
            "Id": "caa0dc1893",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Daniel Medeiros",
            "Affiliation": "INESC-ID, Portugal",
            "Key": "Daniel Medeiros @ INESC-ID, Portugal",
            "Id": "4c17d38a72",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Daniel Mendes",
            "Affiliation": "INESC-ID, Portugal",
            "Key": "Daniel Mendes @ INESC-ID, Portugal",
            "Id": "f221679c86",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Frederic Merienne",
            "Affiliation": "CNRS, France",
            "Key": "Frederic Merienne @ CNRS, France",
            "Id": "56d188877c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Frederic Merienne",
            "Affiliation": "LE2I, France",
            "Key": "Frederic Merienne @ LE2I, France",
            "Id": "713463f529",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Daniel R. Mestre",
            "Affiliation": "Institute of Movement Sciences, France",
            "Key": "Daniel R. Mestre @ Institute of Movement Sciences, France",
            "Id": "ed78d3c97d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Seyedkoosha Mirhosseini",
            "Affiliation": "Stony Brook University, USA",
            "Key": "Seyedkoosha Mirhosseini @ Stony Brook University, USA",
            "Id": "196f0ade19",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Peter Mohr",
            "Affiliation": "Graz University of Technology, Austria",
            "Key": "Peter Mohr @ Graz University of Technology, Austria",
            "Id": "4abb86261d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Paolo Montuschi",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Paolo Montuschi @ Politecnico di Torino, Italy",
            "Id": "fa1c0752b9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mahdi Nabiyouni",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Mahdi Nabiyouni @ Virginia Tech, USA",
            "Id": "259a422918",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mario Nagamura",
            "Affiliation": "University of São Paulo, Brazil",
            "Key": "Mario Nagamura @ University of São Paulo, Brazil",
            "Id": "dfe80a06ed",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Takuto Nakamura",
            "Affiliation": "University of Electro-Communications, Japan",
            "Key": "Takuto Nakamura @ University of Electro-Communications, Japan",
            "Id": "f0d8891d7a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Derek Nankivil",
            "Affiliation": "Duke University, USA",
            "Key": "Derek Nankivil @ Duke University, USA",
            "Id": "8ed88429cc",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Luciana Nedel",
            "Affiliation": "Federal University of Rio Grande do Sul, Brazil",
            "Key": "Luciana Nedel @ Federal University of Rio Grande do Sul, Brazil",
            "Id": "67f2814cbf",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Neha Neha",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Neha Neha @ RWTH Aachen University, Germany",
            "Id": "4220ff2f39",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Thinh Nguyen-Vo",
            "Affiliation": "Simon Fraser University, Canada",
            "Key": "Thinh Nguyen-Vo @ Simon Fraser University, Canada",
            "Id": "2cf4a3657f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Benjamin Nuernberger",
            "Affiliation": "University of California at Santa Barbara, USA",
            "Key": "Benjamin Nuernberger @ University of California at Santa Barbara, USA",
            "Id": "b52b0710bd",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Oscar Javier Ariza Núñez",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Oscar Javier Ariza Núñez @ University of Hamburg, Germany",
            "Id": "53ec692745",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Francisco R. Ortega",
            "Affiliation": "Florida International University, USA",
            "Key": "Francisco R. Ortega @ Florida International University, USA",
            "Id": "08a6880559",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Kana Oshima",
            "Affiliation": "Ritsumeikan University, Japan",
            "Key": "Kana Oshima @ Ritsumeikan University, Japan",
            "Id": "2597460494",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Samir Otmane",
            "Affiliation": "University of Evry, France",
            "Key": "Samir Otmane @ University of Evry, France",
            "Id": "d5bbb80294",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Oyewole Oyekoya",
            "Affiliation": "Clemson University, USA",
            "Key": "Oyewole Oyekoya @ Clemson University, USA",
            "Id": "0d92082b33",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Damien Paillot",
            "Affiliation": "CNRS, France",
            "Key": "Damien Paillot @ CNRS, France",
            "Id": "0d7f5b9c5d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Gianluca Paravati",
            "Affiliation": "Politecnico di Torino, Italy",
            "Key": "Gianluca Paravati @ Politecnico di Torino, Italy",
            "Id": "dae910b9c7",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alex Peer",
            "Affiliation": "University of Wisconsin-Madison, USA",
            "Key": "Alex Peer @ University of Wisconsin-Madison, USA",
            "Id": "74a4f82979",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Thies Pfeiffer",
            "Affiliation": "Bielefeld University, Germany",
            "Key": "Thies Pfeiffer @ Bielefeld University, Germany",
            "Id": "df3447b8d6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Krzysztof Pietroszek",
            "Affiliation": "California State University at Monterey Bay, USA",
            "Key": "Krzysztof Pietroszek @ California State University at Monterey Bay, USA",
            "Id": "0199d62889",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Marcio Sarroglia Pinho",
            "Affiliation": "PUCRS, Brazil",
            "Key": "Marcio Sarroglia Pinho @ PUCRS, Brazil",
            "Id": "8a0bb8d746",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Márcio Sarroglia Pinho",
            "Affiliation": "PUCRS, Brazil",
            "Key": "Márcio Sarroglia Pinho @ PUCRS, Brazil",
            "Id": "0d36a58a36",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Thammathip Piumsomboon",
            "Affiliation": "University of South Australia, Australia",
            "Key": "Thammathip Piumsomboon @ University of South Australia, Australia",
            "Id": "78e67e1b1e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jeremy Plouzeau",
            "Affiliation": "CNRS, France",
            "Key": "Jeremy Plouzeau @ CNRS, France",
            "Id": "888493885c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jérémy Plouzeau",
            "Affiliation": "LE2I, France",
            "Key": "Jérémy Plouzeau @ LE2I, France",
            "Id": "de4a3d1e8b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Kevin Ponto",
            "Affiliation": "University of Wisconsin-Madison, USA",
            "Key": "Kevin Ponto @ University of Wisconsin-Madison, USA",
            "Id": "b08effdd6b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "John Quarles",
            "Affiliation": "University of Texas at San Antonio, USA",
            "Key": "John Quarles @ University of Texas at San Antonio, USA",
            "Id": "ecb4c52dac",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Denise Quesnel",
            "Affiliation": "Simon Fraser University, Canada",
            "Key": "Denise Quesnel @ Simon Fraser University, Canada",
            "Id": "d45fa4c7c5",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eric Ragan",
            "Affiliation": "Texas A&M University, USA",
            "Key": "Eric Ragan @ Texas A&M University, USA",
            "Id": "595eb7a4ad",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alberto Barbosa Raposo",
            "Affiliation": "PUC-Rio, Brazil",
            "Key": "Alberto Barbosa Raposo @ PUC-Rio, Brazil",
            "Id": "c6ffaa7293",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Brandon Ray",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Brandon Ray @ Virginia Tech, USA",
            "Id": "4b936c89d0",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jace Regenbrecht",
            "Affiliation": "University of Houston-Victoria, USA",
            "Key": "Jace Regenbrecht @ University of Houston-Victoria, USA",
            "Id": "4e4fa740d8",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Patrick Renner",
            "Affiliation": "Bielefeld University, Germany",
            "Key": "Patrick Renner @ Bielefeld University, Germany",
            "Id": "eb4a56146f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Aylen Ricca",
            "Affiliation": "University of Evry, France",
            "Key": "Aylen Ricca @ University of Evry, France",
            "Id": "ac213ee01d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Bernhard E. Riecke",
            "Affiliation": "Simon Fraser University, Canada",
            "Key": "Bernhard E. Riecke @ Simon Fraser University, Canada",
            "Id": "a5e72941da",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Naphtali Rishe",
            "Affiliation": "Florida International University, USA",
            "Key": "Naphtali Rishe @ Florida International University, USA",
            "Id": "4eae74ea53",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "André Montes Rodrigues",
            "Affiliation": "University of São Paulo, Brazil",
            "Key": "André Montes Rodrigues @ University of São Paulo, Brazil",
            "Id": "a56989ff89",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Joan Sol Roo",
            "Affiliation": "Inria, France",
            "Key": "Joan Sol Roo @ Inria, France",
            "Id": "bbd3cfba85",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Vicenzo Abichequer Sangalli",
            "Affiliation": "PUCRS, Brazil",
            "Key": "Vicenzo Abichequer Sangalli @ PUCRS, Brazil",
            "Id": "e7b00f5fba",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Beatriz Sousa Santos",
            "Affiliation": "University of Aveiro, Portugal",
            "Key": "Beatriz Sousa Santos @ University of Aveiro, Portugal",
            "Id": "b86d14a25f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Shyam Prathish Sargunam",
            "Affiliation": "Texas A&M University, USA",
            "Key": "Shyam Prathish Sargunam @ Texas A&M University, USA",
            "Id": "7ff0c908ac",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Bhuvaneswari Sarupuri",
            "Affiliation": "University of Canterbury, New Zealand",
            "Key": "Bhuvaneswari Sarupuri @ University of Canterbury, New Zealand",
            "Id": "ab2b112c40",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Emily Sassard",
            "Affiliation": "Clemson University, USA",
            "Key": "Emily Sassard @ Clemson University, USA",
            "Id": "3418b63d30",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Dieter Schmalstieg",
            "Affiliation": "Graz University of Technology, Austria",
            "Key": "Dieter Schmalstieg @ Graz University of Technology, Austria",
            "Id": "e15a7f6991",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ryan Schubert",
            "Affiliation": "University of Central Florida, USA",
            "Key": "Ryan Schubert @ University of Central Florida, USA",
            "Id": "39d1371b4f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Fumihisa Shibata",
            "Affiliation": "Ritsumeikan University, Japan",
            "Key": "Fumihisa Shibata @ Ritsumeikan University, Japan",
            "Id": "a81e56b906",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Leonardo Pavanatto Soares",
            "Affiliation": "PUCRS, Brazil",
            "Key": "Leonardo Pavanatto Soares @ PUCRS, Brazil",
            "Id": "6396a70c1b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Maurecio Sousa",
            "Affiliation": "INESC-ID, Portugal",
            "Key": "Maurecio Sousa @ INESC-ID, Portugal",
            "Id": "a786c8f02a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Maurício Sousa",
            "Affiliation": "INESC-ID, Portugal",
            "Key": "Maurício Sousa @ INESC-ID, Portugal",
            "Id": "ebea155c8b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Frank Steinicke",
            "Affiliation": "University of Hamburg, Germany",
            "Key": "Frank Steinicke @ University of Hamburg, Germany",
            "Id": "4de58cd4cd",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ekaterina R. Stepanova",
            "Affiliation": "Simon Fraser University, Canada",
            "Key": "Ekaterina R. Stepanova @ Simon Fraser University, Canada",
            "Id": "bb26620593",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Wolfgang Stuerzlinger",
            "Affiliation": "Simon Fraser University, Canada",
            "Key": "Wolfgang Stuerzlinger @ Simon Fraser University, Canada",
            "Id": "bf4d32a535",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mohamed Suhail",
            "Affiliation": "Texas A&M University, USA",
            "Key": "Mohamed Suhail @ Texas A&M University, USA",
            "Id": "7571bbf571",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Shun Taguchi",
            "Affiliation": "TOYOTA Central R&D Labs, Japan",
            "Key": "Shun Taguchi @ TOYOTA Central R&D Labs, Japan",
            "Id": "16c973bdd9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Liudmila Tahai",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "Liudmila Tahai @ University of Waterloo, Canada",
            "Id": "1ddd5825a5",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Stanley Tarng",
            "Affiliation": "University of Calgary, Canada",
            "Key": "Stanley Tarng @ University of Calgary, Canada",
            "Id": "d86302a0be",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Katherine Tarre",
            "Affiliation": "Florida International University, USA",
            "Key": "Katherine Tarre @ Florida International University, USA",
            "Id": "7ee528f92c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Markus Tatzgern",
            "Affiliation": "Salzburg University of Applied Sciences, Austria",
            "Key": "Markus Tatzgern @ Salzburg University of Applied Sciences, Austria",
            "Id": "b2d20d5ef9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alireza Tavakkoli",
            "Affiliation": "Univeristy of Houston-Victoria, USA",
            "Key": "Alireza Tavakkoli @ Univeristy of Houston-Victoria, USA",
            "Id": "fedeb32b4c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Robert Teather",
            "Affiliation": "Carleton University, Canada",
            "Key": "Robert Teather @ Carleton University, Canada",
            "Id": "17a0f0c992",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Robert J. Teather",
            "Affiliation": "Carleton University, Canada",
            "Key": "Robert J. Teather @ Carleton University, Canada",
            "Id": "4e156d6ea2",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Bruce Thomas",
            "Affiliation": "University of South Australia, Australia",
            "Key": "Bruce Thomas @ University of South Australia, Australia",
            "Id": "94817b6151",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jason-Lee Thomas",
            "Affiliation": "Florida International University, USA",
            "Key": "Jason-Lee Thomas @ Florida International University, USA",
            "Id": "5968d25fa6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Nikita Tuanquin",
            "Affiliation": "University of Canterbury, New Zealand",
            "Key": "Nikita Tuanquin @ University of Canterbury, New Zealand",
            "Id": "7945463b73",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sean Valent",
            "Affiliation": "Clemson University, USA",
            "Key": "Sean Valent @ Clemson University, USA",
            "Id": "ee071de72e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Khrystyna Vasylevska",
            "Affiliation": "Vienna University of Technology, Austria",
            "Key": "Khrystyna Vasylevska @ Vienna University of Technology, Austria",
            "Id": "23d339f9c4",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Prabhakar Vemavarapu",
            "Affiliation": "University of Louisiana at Lafayette, USA",
            "Key": "Prabhakar Vemavarapu @ University of Louisiana at Lafayette, USA",
            "Id": "3aa76cd14a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Tom Vierjahn",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Tom Vierjahn @ RWTH Aachen University, Germany",
            "Id": "f1ab8f07c1",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "James R. Wallace",
            "Affiliation": "University of Waterloo, Canada",
            "Key": "James R. Wallace @ University of Waterloo, Canada",
            "Id": "089421a9a2",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hongwei Wang",
            "Affiliation": "Quanzhou Normal University, China",
            "Key": "Hongwei Wang @ Quanzhou Normal University, China",
            "Id": "ebbbaff836",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Lin Wang",
            "Affiliation": "Sanming University, China",
            "Key": "Lin Wang @ Sanming University, China",
            "Id": "910e21e68a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ronghai Wang",
            "Affiliation": "Quanzhou Normal University, China",
            "Key": "Ronghai Wang @ Quanzhou Normal University, China",
            "Id": "f310feea46",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xiaojia Wang",
            "Affiliation": "Clemson University, USA",
            "Key": "Xiaojia Wang @ Clemson University, USA",
            "Id": "6a77d26edd",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Gregory Welch",
            "Affiliation": "University of Central Florida, USA",
            "Key": "Gregory Welch @ University of Central Florida, USA",
            "Id": "8c1107b5d9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Benjamin Weyers",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Benjamin Weyers @ RWTH Aachen University, Germany",
            "Id": "47c36448e2",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jason Woodworth",
            "Affiliation": "University of Louisiana at Lafayette, USA",
            "Key": "Jason Woodworth @ University of Louisiana at Lafayette, USA",
            "Id": "cc6b0d59fa",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Siju Wu",
            "Affiliation": "University of Evry, France",
            "Key": "Siju Wu @ University of Evry, France",
            "Id": "f41ceeec2b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Colin Yao",
            "Affiliation": "ETH Zurich, Switzerland",
            "Key": "Colin Yao @ ETH Zurich, Switzerland",
            "Id": "39dd332175",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Junfeng Yao",
            "Affiliation": "Xiamen University, China",
            "Key": "Junfeng Yao @ Xiamen University, China",
            "Id": "b155f68b99",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Thomas Young",
            "Affiliation": "York University, Canada",
            "Key": "Thomas Young @ York University, Canada",
            "Id": "b26a5bb890",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Run Yu",
            "Affiliation": "Virginia Tech, USA",
            "Key": "Run Yu @ Virginia Tech, USA",
            "Id": "ad0b9a80d9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Markus Zank",
            "Affiliation": "ETH Zurich, Switzerland",
            "Key": "Markus Zank @ ETH Zurich, Switzerland",
            "Id": "7dcd0210dd",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Liling Zheng",
            "Affiliation": "Quanzhou First Affiliated Hospital of Fujian Medical University, China",
            "Key": "Liling Zheng @ Quanzhou First Affiliated Hospital of Fujian Medical University, China",
            "Id": "34e1ae80b6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Daniel Zielasko",
            "Affiliation": "RWTH Aachen University, Germany",
            "Key": "Daniel Zielasko @ RWTH Aachen University, Germany",
            "Id": "f478a6830c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "David Zielinski",
            "Affiliation": "Duke University, USA",
            "Key": "David Zielinski @ Duke University, USA",
            "Id": "3263641d5f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Marcelo Knorich Zuffo",
            "Affiliation": "University of São Paulo, Brazil",
            "Key": "Marcelo Knorich Zuffo @ University of São Paulo, Brazil",
            "Id": "e0a4b71ce5",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Marcelo Zuffo",
            "Affiliation": "University of São Paulo, Brasil",
            "Key": "Marcelo Zuffo @ University of São Paulo, Brasil",
            "Id": "1501ed8834",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        }
    ]
}
