{
    "DataRevision": 1516949461,
    "Preliminary": "false",
    "Event": "SANER 2018",
    "Name": "SANER 2018",
    "NameFull": "2018 IEEE 25th International Conference on Software Analysis, Evolution, and Reengineering (SANER)",
    "Description": "",
    "Date": "March 20-23, 2018",
    "DateStart": "2018-03-20",
    "DateEnd": "2018-03-23",
    "Location": "Campobasso, Italy",
    "Sponsors": "",
    "URL": "http://saner.unimol.it/",
    "MultiTrack": "false",
    "UseMiniPage": "true",
    "NewPagePerDay": "false",
    "TableLayout": "false",
    "NumOfParallelTracks": 1,
    "HorizontalAlign": "false",
    "Organization": {
        "General Chairs": [
            "Rocco Oliveto"
        ],
        "PC Chairs": [
            "Massimiliano Di Penta",
            "David C. Shepherd"
        ]
    },
    "SocialFeeds": [],
    "VenueInfo": {
        "Name": "",
        "GPS": {
            "Latitude": 0,
            "Longitude": 0
        }
    },
    "InfoPage": {
        "xaml": "foo",
        "Elements": [
            {
                "XamlName": "ConferenceCenterMap",
                "Type": "Map",
                "GPS": {
                    "Latitude": 0,
                    "Longitude": 0
                },
                "MapLabel": ""
            },
            {
                "XamlName": "LicenseButton",
                "Type": "WebLink",
                "URL": "http://research.microsoft.com/en-US/projects/confapp/terms.aspx"
            },
            {
                "XamlName": "PrivacyButton",
                "Type": "WebLink",
                "URL": "http://privacy.microsoft.com/en-us/default.msp"
            }
        ]
    },
    "SessionPriorities": [
        "Award",
        "Invited Talk",
        "Other"
    ],
    "Items": [
        {
            "Title": "A Decade of Software Quality Analysis in Practice: Surprises, Anecdotes, and Lessons Learned (Keynote)",
            "Type": "KEYNOTE",
            "Track": "Main Research",
            "Key": "saner18main-idk1-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DElmar+Juergens+%22A+Decade+of+Software+Quality+Analysis+in+Practice%3A+Surprises%2C+Anecdotes%2C+and+Lessons+Learned+%28Keynote%29%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Elmar Juergens",
            "AffiliationsString": "CQSE, Germany",
            "Authors": [
                "Juergens-Elmar-CQSE--Germany"
            ],
            "Affiliations": [
                "CQSE, Germany"
            ],
            "Abstract": "I implemented and ran my first clone detection on industrial software roughly a decade ago. Fueled by both the amounts of problematic code it uncovered, and the (at least partially) positive feedback from developers, our research group subsequently fo-cused on quality analyses to improve engineering practice. Since then, our research prototypes have grown into a com-mercial tool employed by professional software developers around the world every day. It implements both static and dy-namic analyses for over 25 programming languages and runs in development, test and production environments of hundreds of companies. We bootstrapped our spin-off, CQSE GmbH, into a company of 30 employees (half of which hold a PhD in Software Engineering). All of us exclusively work on, or employ as part of our audit services, software quality analyses built upon this community’s research. In this keynote, I want to share our key insights: experiences, surprises and anecdotes. I will cover hard lessons learned on how to have an impact in real-world projects, surprising results of seemingly trivial approaches, the role of software visualizations in marketing and our key learnings in transferring research from academia to practice.",
            "Award": "",
            "Badges": "",
            "Keywords": "Clone Detection;  Test Gap Analysis;  Usage Analysis;  Software Audits"
        },
        {
            "Title": "Compilers Are Sprinters – IDEs Are Marathoners (Keynote)",
            "Type": "KEYNOTE",
            "Track": "Main Research",
            "Key": "saner18main-idk2-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DPeter+Gromov+%22Compilers+Are+Sprinters+%E2%80%93+IDEs+Are+Marathoners+%28Keynote%29%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Peter Gromov",
            "AffiliationsString": "JetBrains, Germany",
            "Authors": [
                "Gromov-Peter-JetBrains--Germany"
            ],
            "Affiliations": [
                "JetBrains, Germany"
            ],
            "Abstract": "",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "Towards a New Digital Business Operating System: Speed, Data, Ecosystems, and Empowerment (Keynote)",
            "Type": "KEYNOTE",
            "Track": "Main Research",
            "Key": "saner18main-idk3-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DJan+Bosch+%22Towards+a+New+Digital+Business+Operating+System%3A+Speed%2C+Data%2C+Ecosystems%2C+and+Empowerment+%28Keynote%29%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Jan Bosch",
            "AffiliationsString": "Chalmers University of Technology, Sweden",
            "Authors": [
                "Bosch-Jan-Chalmers-University-of-Technology--Sweden"
            ],
            "Affiliations": [
                "Chalmers University of Technology, Sweden"
            ],
            "Abstract": "We are living in the most exciting time in the history of man-kind. The last century has seen unprecedented improvements in the quality of the human condition and technology is at the heart of this progress. Now we are experiencing an even bigger leap as we move towards a new level of digitalization and au-tomation. Ranging from self-driving cars to factories without workers to societal infrastructure, every sensor and actuator is becoming connected and new applications that enable new op-portunities are appearing daily. The fuel of this emerging con-nected, software-driven reality is software and the key chal-lenge is to continuously deliver value to customers. The future of software engineering in this context is centered around a new, emerging digital business operating system consisting of four dimensions: Speed, Data, Ecosystems and Empowerment. The focus on speed is concerned with the constantly increasing rate of deploying new software in the field. This continuous integra-tion and deployment is no longer only the purview of internet companies but is also increasingly deployed in embedded sys-tems. Second, data is concerned with the vast amounts of infor-mation collected from systems deployed in the field and the be-havior of the users of these systems. Software businesses need to significantly improve their ability to exploit the value present in that data. Third, ecosystems are concerned with the transi-tion in many companies from doing everything in-house to stra-tegic use of innovation partners and commodity providing partners. Finally, we need new ways of organizing work in this new, digital age. The keynote discusses these four main devel-opments but focuses on the continuous software engineering. Also, the keynote provides numerous examples from the Nordic and international industry and predicts the next steps that in-dustry and academia need to engage in to remain competitive.",
            "Award": "",
            "Badges": "",
            "Keywords": "Speed;  data-driven development;  software ecosystems;  empowered organization"
        },
        {
            "Title": "SMARTLOG: Place Error Log Statement by Deep Understanding of Log Intention",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id6-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DZhouyang+Jia%2C+Shanshan+Li%2C+Yunhuai+Liu%2C+Xiaodong+Liu%2C+and+Xiangke+Liao+%22SMARTLOG%3A+Place+Error+Log+Statement+by+Deep+Understanding+of+Log+Intention%22",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fgithub.com%2FZhouyangJia%2FSmartLog",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Zhouyang Jia, Shanshan Li, Yunhuai Liu, Xiaodong Liu, and Xiangke Liao",
            "AffiliationsString": "National University of Defense Technology, China; Peking University, China",
            "Authors": [
                "Jia-Zhouyang-National-University-of-Defense-Technology--China",
                "Li-Shanshan-National-University-of-Defense-Technology--China",
                "Liu-Yunhuai-Peking-University--China",
                "Liu-Xiaodong-National-University-of-Defense-Technology--China",
                "Liao-Xiangke-National-University-of-Defense-Technology--China"
            ],
            "Affiliations": [
                "National University of Defense Technology, China",
                "National University of Defense Technology, China",
                "Peking University, China",
                "National University of Defense Technology, China",
                "National University of Defense Technology, China"
            ],
            "Abstract": "Failure-diagnosis logs can dramatically reduce the system recovery time when software systems fail. Log automation tools can assist developers to write high quality log code. In traditional designs of log automation tools, they define log placement rules by extracting syntax features or summarizing code patterns. These approaches are, however, limited since the log placements are far beyond those rules but are according to the intention of software code. To overcome these limitations, we design and implement SmartLog, an intention-aware log automation tool. To describe the intention of log statements, we propose the Intention Description Model (IDM). SmartLog then explores the intention of existing logs and mines log rules from equivalent intentions. We conduct the experiments based on 6 real-world open-source projects. Experimental results show that SmartLog improves the accuracy of log placement by 43% and 16% compared with two state-of-the-art works. For 86 real-world patches aimed to add logs, 57% of them can be covered by SmartLog, while the overhead of all additional logs is less than 1%.",
            "Award": "",
            "Badges": "",
            "Keywords": "Log Automation;  Log Intention;  Failure Diagnosis"
        },
        {
            "Title": "Recursion Aware Modeling and Discovery for Hierarchical Software Event Log Analysis",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id11-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMaikel+Leemans%2C+Wil+M.+P.+van+der+Aalst%2C+and+Mark+G.+J.+van+den+Brand+%22Recursion+Aware+Modeling+and+Discovery+for+Hierarchical+Software+Event+Log+Analysis%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Maikel Leemans, Wil M. P. van der Aalst, and Mark G. J. van den Brand",
            "AffiliationsString": "Eindhoven University of Technology, Netherlands",
            "Authors": [
                "Leemans-Maikel-Eindhoven-University-of-Technology--Netherlands",
                "Aalst-Wil-M.-P.-van-der-Eindhoven-University-of-Technology--Netherlands",
                "Brand-Mark-G.-J.-van-den-Eindhoven-University-of-Technology--Netherlands"
            ],
            "Affiliations": [
                "Eindhoven University of Technology, Netherlands",
                "Eindhoven University of Technology, Netherlands",
                "Eindhoven University of Technology, Netherlands"
            ],
            "Abstract": "This paper presents 1) a novel hierarchy and recursion extension to the process tree model; and 2) the first, recursion aware process model discovery technique that leverages hierarchical information in event logs, typically available for software systems. This technique allows us to analyze the operational processes of software systems under real-life conditions at multiple levels of granularity. The work can be positioned in-between reverse engineering and process mining. An implementation of the proposed approach is available as a ProM plugin. Experimental results based on real-life (software) event logs demonstrate the feasibility and usefulness of the approach and show the huge potential to speed up discovery by exploiting the available hierarchy.",
            "Award": "",
            "Badges": "",
            "Keywords": "Reverse Engineering;  Process Mining;  Recursion Aware Discovery;  Event Log;  Hierarchical Event Log;  Process Discovery;  Hierarchical Discovery;  Hierarchical Modeling"
        },
        {
            "Title": "Exploring the Integration of User Feedback in Automated Testing of Android Applications",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id23-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DGiovanni+Grano%2C+Adelina+Ciurumelea%2C+Sebastiano+Panichella%2C+Fabio+Palomba%2C+and+Harald+C.+Gall+%22Exploring+the+Integration+of+User+Feedback+in+Automated+Testing+of+Android+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Giovanni Grano, Adelina Ciurumelea, Sebastiano Panichella, Fabio Palomba, and Harald C. Gall",
            "AffiliationsString": "University of Zurich, Switzerland",
            "Authors": [
                "Grano-Giovanni-University-of-Zurich--Switzerland",
                "Ciurumelea-Adelina-University-of-Zurich--Switzerland",
                "Panichella-Sebastiano-University-of-Zurich--Switzerland",
                "Palomba-Fabio-University-of-Zurich--Switzerland",
                "Gall-Harald-C.-University-of-Zurich--Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "The intense competition characterizing mobile application&#39;s marketplaces forces developers to create and maintain high-quality mobile apps in order to ensure their commercial success and acquire new users. This motivated the research community to propose solutions that automate the testing process of mobile apps. However, the main problem of current testing tools is that they generate redundant and random inputs that are insufficient to properly simulate the human behavior, thus leaving feature and crash bugs undetected until they are encountered by users. To cope with this problem, we conjecture that information available in user reviews---that previous work showed as effective for maintenance and evolution problems---can be successfully exploited to identify the main issues users experience while using mobile applications, e.g., GUI problems and crashes. In this paper we provide initial insights into this direction, investigating (i) what type of user feedback can be actually exploited for testing purposes, (ii) how complementary user feedback and automated testing tools are, when detecting crash bugs or errors and (iii) whether an automated system able to monitor crash-related information reported in user feedback is sufficiently accurate. Results of our study, involving 11,296 reviews of 8 mobile applications, show that user feedback can be exploited to provide contextual details about errors or exceptions detected by automated testing tools. Moreover, they also help detecting bugs that would remain uncovered when rely on testing tools only. Finally, the accuracy of the proposed automated monitoring system demonstrates the feasibility of our vision, i.e., integrate user feedback into testing process.",
            "Award": "",
            "Badges": "",
            "Keywords": "Automated Software Testing;  Mobile Applications;  User Reviews Analysis"
        },
        {
            "Title": "Efficient Features for Function Matching between Binary Executables",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id25-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DChariton+Karamitas+and+Thanasis+Kehagias+%22Efficient+Features+for+Function+Matching+between+Binary+Executables%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Chariton Karamitas and Thanasis Kehagias",
            "AffiliationsString": "CENSUS, Greece; University of Thessaloniki, Greece",
            "Authors": [
                "Karamitas-Chariton-CENSUS--Greece",
                "Kehagias-Thanasis-University-of-Thessaloniki--Greece"
            ],
            "Affiliations": [
                "CENSUS, Greece",
                "University of Thessaloniki, Greece"
            ],
            "Abstract": "Binary diffing is the process of reverse engineering two programs, when source code is not available, in order to study their syntactic and semantic differences. For large programs, binary diffing can be performed by function matching which, in turn, is reduced to a graph isomorphism problem between the compared programs&#39; CFGs (Control Flow Graphs) and/or CGs (Call Graphs). In this paper we provide a set of carefully chosen features, extracted from a binary&#39;s CG and CFG, which can be used by BinDiff algorithm variants to, first, build a set of initial exact matches with minimal false positives (by scanning for unique perfect matches) and, second, propagate approximate matching information using, for example, a nearest-neighbor scheme. Furthermore, we investigate the benefits of applying Markov lumping techniques to function CFGs (to our knowledge, this technique has not been previously studied). The proposed function features are evaluated in a series of experiments on various versions of the Linux kernel (Intel64), the OpenSSH server (Intel64) and Firefox&#39;s xul.dll (IA-32). Our prototype system is also compared to Diaphora, the current state-of-the-art binary diffing software.",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "Mining Framework Usage Graphs from App Corpora",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id117-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DSergio+Mover%2C+Rhys+Olsen%2C+Bor-Yuh+Evan+Chang%2C+and+Sriram+Sankaranarayanan+%22Mining+Framework+Usage+Graphs+from+App+Corpora%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Sergio Mover, Rhys Olsen, Bor-Yuh Evan Chang, and Sriram Sankaranarayanan",
            "AffiliationsString": "University of Colorado at Boulder, USA",
            "Authors": [
                "Mover-Sergio-University-of-Colorado-at-Boulder--USA",
                "Olsen-Rhys-University-of-Colorado-at-Boulder--USA",
                "Chang-Bor-Yuh-Evan-University-of-Colorado-at-Boulder--USA",
                "Sankaranarayanan-Sriram-University-of-Colorado-at-Boulder--USA"
            ],
            "Affiliations": [
                "University of Colorado at Boulder, USA",
                "University of Colorado at Boulder, USA",
                "University of Colorado at Boulder, USA",
                "University of Colorado at Boulder, USA"
            ],
            "Abstract": "We investigate the problem of mining graph-based usage patterns for large, object-oriented frameworks like Android—revisiting previous approaches based on graph-based object usage models (groums). Groums are a promising approach to represent usage patterns for object-oriented libraries because they simultaneously describe control flow and data dependencies between methods of multiple interacting object types. However, this expressivity comes at a cost: mining groums requires solving a subgraph isomorphism problem that is well known to be expensive. This cost limits the applicability of groum mining to large API frameworks. In this paper, we employ groum mining to learn usage patterns for object-oriented frameworks from program corpora. The central challenge is to scale groum mining so that it is sensitive to usages horizontally across programs from arbitrarily many developers (as opposed to simply usages vertically within the program of a single developer). To address this challenge, we develop a novel groum mining algorithm that scales on a large corpus of programs. We first use frequent itemset mining to restrict the search for groums to smaller subsets of methods in the given corpus. Then, we pose the subgraph isomorphism as a SAT problem and apply efficient pre-processing algorithms to rule out fruitless comparisons ahead of time. Finally, we identify containment relationships between clusters of groums to characterize popular usage patterns in the corpus (as well as classify less popular patterns as possible anomalies). We find that our approach scales on a corpus of over five hundred open source Android applications, effectively mining obligatory and best-practice usage patterns.",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "Context Is King: The Developer Perspective on the Usage of Static Analysis Tools",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id126-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DCarmine+Vassallo%2C+Sebastiano+Panichella%2C+Fabio+Palomba%2C+Sebastian+Proksch%2C+Andy+Zaidman%2C+and+Harald+C.+Gall+%22Context+Is+King%3A+The+Developer+Perspective+on+the+Usage+of+Static+Analysis+Tools%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Carmine Vassallo, Sebastiano Panichella, Fabio Palomba, Sebastian Proksch, Andy Zaidman, and Harald C. Gall",
            "AffiliationsString": "University of Zurich, Switzerland; Delft University of Technology, Netherlands",
            "Authors": [
                "Vassallo-Carmine-University-of-Zurich--Switzerland",
                "Panichella-Sebastiano-University-of-Zurich--Switzerland",
                "Palomba-Fabio-Delft-University-of-Technology--Netherlands",
                "Proksch-Sebastian-University-of-Zurich--Switzerland",
                "Zaidman-Andy-Delft-University-of-Technology--Netherlands",
                "Gall-Harald-C.-University-of-Zurich--Switzerland"
            ],
            "Affiliations": [
                "University of Zurich, Switzerland",
                "University of Zurich, Switzerland",
                "Delft University of Technology, Netherlands",
                "University of Zurich, Switzerland",
                "Delft University of Technology, Netherlands",
                "University of Zurich, Switzerland"
            ],
            "Abstract": "Automatic static analysis tools (ASATs) are tools that support automatic code quality evaluation of software systems with the aim of (i) avoiding and/or removing bugs and (ii) spotting design issues. Hindering their wide-spread acceptance are their (i) high false positive rates and (ii) low comprehensibility of the generated warnings. Researchers and ASATs vendors have proposed solutions to prioritize such warnings with the aim of guiding developers toward the most severe ones. However, none of the proposed solutions considers the development context in which an ASAT is being used to further improve the selection of relevant warnings. To shed light on the impact of such contexts on the warnings configuration, usage and adopted prioritization strategies, we surveyed 42 developers (69% in industry and 31% in open source projects) and interviewed 11 industrial experts that integrate ASATs in their workflow. While we can confirm previous findings on the reluctance of developers to configure ASATs, our study highlights that (i) 71% of developers do pay attention to different warning categories depending on the development context, and (ii) 63% of our respondents rely on specific factors (e.g., team policies and composition) when prioritizing warnings to fix during their programming. Our results clearly indicate ways to better assist developers by improving existing warning selection and prioritization strategies.",
            "Award": "",
            "Badges": "",
            "Keywords": "Static Analysis;  Development Context;   Continuous Integration;  Code Review;  Empirical Study"
        },
        {
            "Title": "Structured Random Differential Testing of Instruction Decoders",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id158-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DNathan+Jay+and+Barton+P.+Miller+%22Structured+Random+Differential+Testing+of+Instruction+Decoders%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Nathan Jay and Barton P. Miller",
            "AffiliationsString": "University of Wisconsin-Madison, USA",
            "Authors": [
                "Jay-Nathan-University-of-Wisconsin-Madison--USA",
                "Miller-Barton-P.-University-of-Wisconsin-Madison--USA"
            ],
            "Affiliations": [
                "University of Wisconsin-Madison, USA",
                "University of Wisconsin-Madison, USA"
            ],
            "Abstract": "Decoding binary executable files is a critical facility for software analysis, including debugging, performance monitor- ing, malware detection, cyber forensics, and sandboxing, among other techniques. As a foundational capability, binary decoding must be consistently correct for the techniques that rely on it to be viable. Unfortunately, modern instruction sets are huge and the encodings are complex, so as a result, modern binary decoders are buggy. In this paper, we present a testing methodology that automatically infers structural information for an instruction set and uses the inferred structure to efficiently generate structured- random test cases independent of the instruction set being tested. Our testing methodology includes automatic output verification using differential analysis and reassembly to generate error reports. This testing methodology requires little instruction- set-specific knowledge, allowing rapid testing of decoders for new architectures and extensions to existing ones. We have implemented our testing procedure in a tool name Fleece and used it to test multiple binary decoders (Intel XED, libopcodes, LLVM, Dyninst and Capstone) on multiple architectures (x86, ARM and PowerPC). Our testing efficiently covered thousands of instruction format variations for each instruction set and uncovered decoding bugs in every decoder we tested.",
            "Award": "",
            "Badges": "",
            "Keywords": "binary code analysis;  fuzz testing"
        },
        {
            "Title": "Classifying Stack Overflow Posts on API Issues",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id168-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMd+Ahasanuzzaman%2C+Muhammad+Asaduzzaman%2C+Chanchal+K.+Roy%2C+and+Kevin+A.+Schneider+%22Classifying+Stack+Overflow+Posts+on+API+Issues%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Md Ahasanuzzaman, Muhammad Asaduzzaman, Chanchal K. Roy, and Kevin A. Schneider",
            "AffiliationsString": "Queen's University, Canada; University of Saskatchewan, Canada",
            "Authors": [
                "Ahasanuzzaman-Md-Queen-s-University--Canada",
                "Asaduzzaman-Muhammad-University-of-Saskatchewan--Canada",
                "Roy-Chanchal-K.-University-of-Saskatchewan--Canada",
                "Schneider-Kevin-A.-University-of-Saskatchewan--Canada"
            ],
            "Affiliations": [
                "Queen's University, Canada",
                "University of Saskatchewan, Canada",
                "University of Saskatchewan, Canada",
                "University of Saskatchewan, Canada"
            ],
            "Abstract": "The design and maintenance of APIs are complex tasks due to the constantly changing requirements of its users. Despite the efforts of its designers, APIs may suffer from a number of issues (such as incomplete or erroneous documentation, poor performance, and backward incompatibility). To maintain a healthy client base, API designers must learn these issues to fix them. Question answering sites, such as Stack Overflow (SO), has become a popular place for discussing API issues. These posts about API issues are invaluable to API designers, not only because they can help to learn more about the problem but also because they can facilitate learning the requirements of API users. However, the unstructured nature of posts and the abundance of non-issue posts make the task of detecting SO posts concerning API issues difficult and challenging. In this paper, we first develop a supervised learning approach using a Conditional Random Field (CRF), a statistical modeling method, to identify API issue-related sentences. We use the above information together with different features of posts and experience of users to build a technique, called CAPS, that can classify SO posts concerning API issues. Evaluation of CAPS using carefully curated SO posts on three popular API types reveals that the technique outperforms all three baseline approaches we consider in this study. We also conduct studies to test the generalizability of CAPS results and to understand the effects of different sources of information on it.",
            "Award": "",
            "Badges": "",
            "Keywords": "API Issue;  unstructured data mining;  text classification;  feature extraction;  Stack Overflow"
        },
        {
            "Title": "Automated Quality Assessment for Crowdsourced Test Reports of Mobile Applications",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id75-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DXin+Chen%2C+He+Jiang%2C+Xiaochen+Li%2C+Tieke+He%2C+and+Zhenyu+Chen+%22Automated+Quality+Assessment+for+Crowdsourced+Test+Reports+of+Mobile+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Xin Chen, He Jiang, Xiaochen Li, Tieke He, and Zhenyu Chen",
            "AffiliationsString": "Dalian University of Technology, China; Nanjing University, China",
            "Authors": [
                "Chen-Xin-Dalian-University-of-Technology--China",
                "Jiang-He-Dalian-University-of-Technology--China",
                "Li-Xiaochen-Dalian-University-of-Technology--China",
                "He-Tieke-Nanjing-University--China",
                "Chen-Zhenyu-Nanjing-University--China"
            ],
            "Affiliations": [
                "Dalian University of Technology, China",
                "Dalian University of Technology, China",
                "Dalian University of Technology, China",
                "Nanjing University, China",
                "Nanjing University, China"
            ],
            "Abstract": "In crowdsourced mobile application testing, crowd workers help developers perform testing and submit test reports for unexpected behaviors. These submitted test reports usually provide critical information for developers to understand and reproduce the bugs. However, due to the poor performance of workers and the inconvenience of editing on mobile devices, the quality of test reports may vary sharply. At times developers have to spend a significant portion of their available resources to handle the low-quality test reports, thus heavily decreasing their efficiency. In this paper, to help developers predict whether a test report should be selected for inspection within limited resources, we propose a new framework named TERQAF to automatically model the quality of test reports. TERQAF defines a series of quantifiable indicators to measure the desirable properties of test reports and aggregates the numerical values of all indicators to determine the quality of test reports by using step transformation functions. Experiments conducted over five crowdsourced test report datasets of mobile applications show that TERQAF can correctly predict the quality of test reports with accuracy of up to 88.06% and outperform baselines by up to 23.06%. Meanwhile, the experimental results also demonstrate that the four categories of measurable indicators have positive impacts on TERQAF in evaluating the quality of test reports.",
            "Award": "",
            "Badges": "",
            "Keywords": "crowdsourced testing;  test reports;  test report quality;  quality indicators;  natural language processing"
        },
        {
            "Title": "Why and How Java Developers Break APIs",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id80-p",
            "URL": "https%3A%2F%2Farxiv.org%2Fpdf%2F1801.05198.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Aline Brito, Laerte Xavier, André Hora, and Marco Tulio Valente",
            "AffiliationsString": "Federal University of Minas Gerais, Brazil; Federal University of Mato Grosso do Sul, Brazil",
            "Authors": [
                "Brito-Aline-Federal-University-of-Minas-Gerais--Brazil",
                "Xavier-Laerte-Federal-University-of-Minas-Gerais--Brazil",
                "Hora-Andre-Federal-University-of-Mato-Grosso-do-Sul--Brazil",
                "Valente-Marco-Tulio-Federal-University-of-Minas-Gerais--Brazil"
            ],
            "Affiliations": [
                "Federal University of Minas Gerais, Brazil",
                "Federal University of Minas Gerais, Brazil",
                "Federal University of Mato Grosso do Sul, Brazil",
                "Federal University of Minas Gerais, Brazil"
            ],
            "Abstract": "Modern software development depends on APIs to reuse code and increase productivity. As most software systems, these libraries and frameworks also evolve, which may break existing clients. However, the main reasons to introduce breaking changes in APIs are unclear. Therefore, in this paper, we report the results of an almost 4-month long field study with the developers of 400 popular Java libraries and frameworks. We configured an infrastructure to observe all changes in these libraries and to detect breaking changes shortly after their introduction in the code. After identifying breaking changes, we asked the developers to explain the reasons behind their decision to change the APIs. During the study, we identified 59 breaking changes, confirmed by the developers of 19 projects. By analyzing the developers&#39; answers, we report that breaking changes are mostly motivated by the need to implement new features, by the desire to make the APIs simpler and with fewer elements, and to improve maintainability. We conclude by providing suggestions to language designers, tool builders, software engineering researchers and API developers.",
            "Award": "",
            "Badges": "",
            "Keywords": "API Evolution;  Breaking Changes;  Field Study"
        },
        {
            "Title": "Micro-clones in Evolving Software",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id169-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DManishankar+Mondal%2C+Chanchal+K.+Roy%2C+and+Kevin+A.+Schneider+%22Micro-clones+in+Evolving+Software%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Manishankar Mondal, Chanchal K. Roy, and Kevin A. Schneider",
            "AffiliationsString": "University of Saskatchewan, Canada",
            "Authors": [
                "Mondal-Manishankar-University-of-Saskatchewan--Canada",
                "Roy-Chanchal-K.-University-of-Saskatchewan--Canada",
                "Schneider-Kevin-A.-University-of-Saskatchewan--Canada"
            ],
            "Affiliations": [
                "University of Saskatchewan, Canada",
                "University of Saskatchewan, Canada",
                "University of Saskatchewan, Canada"
            ],
            "Abstract": "Detection, tracking, and refactoring of code clones (i.e., identical or nearly similar code fragments in the code-base of a software system) have been extensively investigated by a great many studies. Code clones have often been considered bad smells. While clone refactoring is important for removing code clones from the code-base, clone tracking is important for consistently updating code clones that are not suitable for refactoring. In this research we investigate the importance of micro-clones (i.e., code clones of less than five lines of code) in consistent updating of the code-base. While the existing clone detectors and trackers have ignored micro clones, our investigation on thousands of commits from six subject systems imply that around 80% of all consistent updates during system evolution occur in micro clones. The percentage of consistent updates occurring in micro clones is significantly higher than that in regular clones according to our statistical significance tests. Also, the consistent updates occurring in micro-clones can be up to 23% of all updates during the whole period of evolution. According to our manual analysis, around 83% of the consistent updates in micro-clones are non-trivial. As micro-clones also require consistent updates like the regular clones, tracking or refactoring micro-clones can help us considerably minimize effort for consistently updating such clones. Thus, micro-clones should also be taken into proper consideration when making clone management decisions.",
            "Award": "",
            "Badges": "",
            "Keywords": "Code Clones;  Micro-Clones;  Consistent Updates;  Software Evolution; "
        },
        {
            "Title": "Cross-Version Defect Prediction via Hybrid Active Learning with Kernel Principal Component Analysis",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id38-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DZhou+Xu%2C+Jin+Liu%2C+Xiapu+Luo%2C+and+Tao+Zhang+%22Cross-Version+Defect+Prediction+via+Hybrid+Active+Learning+with+Kernel+Principal+Component+Analysis%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Zhou Xu, Jin Liu, Xiapu Luo, and Tao Zhang",
            "AffiliationsString": "Wuhan University, China; Hong Kong Polytechnic University, China; Harbin Engineering University, China",
            "Authors": [
                "Xu-Zhou-Wuhan-University--China",
                "Liu-Jin-Wuhan-University--China",
                "Luo-Xiapu-Hong-Kong-Polytechnic-University--China",
                "Zhang-Tao-Harbin-Engineering-University--China"
            ],
            "Affiliations": [
                "Wuhan University, China",
                "Wuhan University, China",
                "Hong Kong Polytechnic University, China",
                "Harbin Engineering University, China"
            ],
            "Abstract": "As defects in software modules may cause product failure and financial loss, it is critical to utilize defect prediction methods to effectively identify the potentially defective modules for a thorough inspection, especially in the early stage of software development lifecycle. For an upcoming version of a software project, it is practical to employ the historical labeled defect data of the prior versions within the same project to conduct defect prediction on the current version, i.e., Cross-Version Defect Prediction (CVDP). However, software development is a dynamic evolution process that may cause the data distribution (such as defect characteristics) to vary across versions. Furthermore, the raw features usually may not well reveal the intrinsic structure information behind the data. Therefore, it is challenging to perform effective CVDP. In this paper, we propose a two-phase CVDP framework that combines Hybrid Active Learning and Kernel PCA (HALKP) to address these two issues. In the first stage, HALKP uses a hybrid active learning method to select some informative and representative unlabeled modules from the current version for querying their labels, then merges them into the labeled modules of the prior version to form an enhanced training set. In the second stage, HALKP employs a non-linear mapping method, kernel PCA, to extract representative features by embedding the original data of two versions into a high-dimension space. We evaluate the HALKP framework on 31 versions of 10 projects with three prevalent performance indicators. The experimental results indicate that HALKP achieves encouraging results with average F-measure, g-mean and Balance of 0.480, 0.592 and 0.580, respectively and significantly outperforms nearly all baseline methods.",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "Mining StackOverflow for Program Repair",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id44-p",
            "URL": "http%3A%2F%2Fwww.cs.sjtu.edu.cn%2F%7Ezhonghao%2Fpaper%2Fminstackoverflow.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Xuliang Liu and Hao Zhong",
            "AffiliationsString": "Shanghai Jiao Tong University, China",
            "Authors": [
                "Liu-Xuliang-Shanghai-Jiao-Tong-University--China",
                "Zhong-Hao-Shanghai-Jiao-Tong-University--China"
            ],
            "Affiliations": [
                "Shanghai Jiao Tong University, China",
                "Shanghai Jiao Tong University, China"
            ],
            "Abstract": "In recent years, automatic program repair has been a hot research topic in the software engineering community, and many approaches have been proposed. Although these approaches produce promising results, some researchers criticize that existing approaches are still limited in their repair capability, due to their limited repair templates. Indeed, it is quite difficult to design effective repair templates. An award-wining paper analyzes thousands of manual bug fixes, but summarizes only ten repair templates. Although more bugs are thus repaired, recent studies show such repair templates are still insufficient.  We notice that programmers often refer to Stack Overflow, when they repair bugs. With years of accumulation, Stack Overflow has millions of posts that are potentially useful to repair many bugs. The observation motives our work towards mining repair templates from Stack Overflow. In this paper, we propose a novel approach, called SOFIX, that extracts code samples from Stack Overflow, and mines repair patterns from extracted code samples. Based on our mined repair patterns, we derived 13 repair templates. We implemented these repair templates in SOFIX, and conducted evaluations on the widely used benchmark, Defects4J. Our results show that SOFIX repaired 23 bugs, which are more than existing approaches. After comparing repaired bugs and templates, we find that SOFIX repaired more bugs, since it has more repair templates. In addition, our results also reveal the urgent need for better fault localization techniques.",
            "Award": "",
            "Badges": "",
            "Keywords": "program repair;  Stack Overflow;  repair template"
        },
        {
            "Title": "Supporting Exploratory Code Search with Differencing and Visualization",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id71-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DWenjian+Liu%2C+Xin+Peng%2C+Zhenchang+Xing%2C+Junyi+Li%2C+Bing+Xie%2C+and+Wenyun+Zhao+%22Supporting+Exploratory+Code+Search+with+Differencing+and+Visualization%22",
            "URLvideo": "https%3A%2F%2Fyoutu.be%2FsM0r27-_TI8",
            "URLinfo": "https%3A%2F%2Fcodenuance2017.wixsite.com%2Fcodenuance",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Wenjian Liu, Xin Peng, Zhenchang Xing, Junyi Li, Bing Xie, and Wenyun Zhao",
            "AffiliationsString": "Fudan University, China; Australian National University, Australia; Peking University, China",
            "Authors": [
                "Liu-Wenjian-Fudan-University--China",
                "Peng-Xin-Fudan-University--China",
                "Xing-Zhenchang-Australian-National-University--Australia",
                "Li-Junyi-Fudan-University--China",
                "Xie-Bing-Peking-University--China",
                "Zhao-Wenyun-Fudan-University--China"
            ],
            "Affiliations": [
                "Fudan University, China",
                "Fudan University, China",
                "Australian National University, Australia",
                "Fudan University, China",
                "Peking University, China",
                "Fudan University, China"
            ],
            "Abstract": "Searching and reusing online code has become a common practice in software development. Two important characteristics of online code have not been carefully considered in current tool support. First, many pieces of online code are largely similar but subtly different. Second, several pieces of code may form complex relations through their differences. These two characteristics make it difficult to properly rank online code to a search query and reduce the efficiency of examining search results. In this paper, we present an exploratory online code search approach that explicitly takes into account the above two characteristics of online code. Given a list of methods returned for a search query, our approach uses clone detection and code differencing techniques to analyze both commonalities and differences among the methods in the search results. It then produces an exploration graph that visualizes the method differences and the relationships of methods through their differences. The exploration graph allows developers to explore search results in a structured view of different method groups present in the search results, and turns implicit code differences into visual cues to help developers navigate the search results. We implement our approach in a web-based tool called textit{CodeNuance}. We conduct experiments to evaluate the effectiveness of our textit{CodeNuance} tool for search results examination, compared with ranked-list and code-clustering based search results examination. We also compare the performance and user behavior differences in using our tool and other exploratory code search tools.",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "How Do Developers Fix Issues and Pay Back Technical Debt in the Apache Ecosystem?",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id116-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DGeorgios+Digkas%2C+Mircea+Lungu%2C+Alexander+Chatzigeorgiou%2C+Apostolos+Ampatzoglou%2C+and+Paris+Avgeriou+%22How+Do+Developers+Fix+Issues+and+Pay+Back+Technical+Debt+in+the+Apache+Ecosystem%3F%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Georgios Digkas, Mircea Lungu, Alexander Chatzigeorgiou, Apostolos Ampatzoglou, and Paris Avgeriou",
            "AffiliationsString": "University of Groningen, Netherlands; University of Bern, Switzerland; University of Macedonia, Greece",
            "Authors": [
                "Digkas-Georgios-University-of-Groningen--Netherlands",
                "Lungu-Mircea-University-of-Bern--Switzerland",
                "Chatzigeorgiou-Alexander-University-of-Macedonia--Greece",
                "Ampatzoglou-Apostolos-University-of-Macedonia--Greece",
                "Avgeriou-Paris-University-of-Groningen--Netherlands"
            ],
            "Affiliations": [
                "University of Groningen, Netherlands",
                "University of Bern, Switzerland",
                "University of Macedonia, Greece",
                "University of Macedonia, Greece",
                "University of Groningen, Netherlands"
            ],
            "Abstract": "During software evolution technical debt (TD) follows a constant ebb and flow, being incurred and paid back, sometimes in the same day and sometimes ten years later. There have been several studies in the literature investigating how technical debt in source code accumulates during time and the consequences of this accumulation for software maintenance. However, to the best of our knowledge there are no large scale studies that focus on the types of issues that are fixed and the amount of TD that is paid back during software evolution. In this paper we present the results of a case study, in which we analyzed the evolution of fifty-seven Java open-source software projects by the Apache Software Foundation at the temporal granularity level of weekly snapshots. In particular, we focus on the amount of technical debt that is paid back and the types of issues that are fixed. The findings reveal that a small subset of all issue types is responsible for the largest percentage of TD repayment and thus, targeting particular violations the development team can achieve higher benefits.",
            "Award": "",
            "Badges": "",
            "Keywords": "Software Evolution;  Technical Debt;  Mining Software Repositories;  Empirical Study;  Apache Software Foundation"
        },
        {
            "Title": "How Do Developers Discuss Rationale?",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id122-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRana+Alkadhi%2C+Manuel+Nonnenmacher%2C+Emitza+Guzman%2C+and+Bernd+Bruegge+%22How+Do+Developers+Discuss+Rationale%3F%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Rana Alkadhi, Manuel Nonnenmacher, Emitza Guzman, and Bernd Bruegge",
            "AffiliationsString": "TU Munich, Germany; University of Zurich, Switzerland",
            "Authors": [
                "Alkadhi-Rana-TU-Munich--Germany",
                "Nonnenmacher-Manuel-TU-Munich--Germany",
                "Guzman-Emitza-University-of-Zurich--Switzerland",
                "Bruegge-Bernd-TU-Munich--Germany"
            ],
            "Affiliations": [
                "TU Munich, Germany",
                "TU Munich, Germany",
                "University of Zurich, Switzerland",
                "TU Munich, Germany"
            ],
            "Abstract": "Developers make various decisions during software development. The rationale behind these decisions is of great importance during software evolution of long living software systems. However, current practices for documenting rationale often fall short and rationale remains hidden in the heads of developers or embedded in development artifacts. Further challenges are faced for capturing rationale in OSS projects; in which developers are geographically distributed and rely mostly on written communication channels to support and coordinate their activities. In this paper, we present an empirical study to understand how OSS developers discuss rationale in IRC channels and explore the possibility of automatic extraction of rationale elements by analyzing IRC messages of development teams. To achieve this, we manually analyzed 7,500 messages of three large OSS projects and identified all fine-grained elements of rationale. We evaluated various machine learning algorithms for automatically detecting and classifying rationale in IRC messages. Our results show that 1) rationale is discussed on average in 25% of IRC messages, 2) code committers contributed on average 54% of the discussed rationale, and 3) machine learning algorithms can detect rationale with 0.76 precision and 0.79 recall, and classify messages into finer-grained rationale elements with an average of 0.45 precision and 0.43 recall.",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "Detection of Protection-Impacting Changes during Software Evolution",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id135-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMarc-Andr%C3%A9+Laverdi%C3%A8re+and+Ettore+Merlo+%22Detection+of+Protection-Impacting+Changes+during+Software+Evolution%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Marc-André Laverdière and Ettore Merlo",
            "AffiliationsString": "Tata Consultancy Services, Canada; Polytechnique Montréal, Canada",
            "Authors": [
                "Laverdiere-Marc-Andre-Tata-Consultancy-Services--Canada",
                "Merlo-Ettore-Polytechnique-Montreal--Canada"
            ],
            "Affiliations": [
                "Tata Consultancy Services, Canada",
                "Polytechnique Montréal, Canada"
            ],
            "Abstract": "Role-Based Access Control (RBAC) is often used in web applications to restrict operations and protect security sensitive information and resources. Web applications regularly undergo maintenance and evolution and their security may be affected by source code changes between releases. To prevent security regression and vulnerabilities, developers have to take re-validation actions before deploying new releases. This may become a significant undertaking, especially when quick and repeated releases are sought. We define protection-impacting changes as those changed statements during evolution that alter privilege protection of some code. We propose an automated method that identifies protection-impacting changes within all changed statements between two versions. The proposed approach compares statically computed security protection models and repository information corresponding to different releases of a system to identify protection-impacting changes. Results of experiments present the occurrence of protection-impacting changes over 210 release pairs of WordPress, a PHP content management web application. First, we show that only 41% of the release pairs present protection-impacting changes. Second, for these affected release pairs, protection-impacting changes can be identified and represent a median of 47.00 lines of code, that is 27.41% of the total changed lines of code. Over all investigated releases in WordPress, protection-impacting changes amounted to 10.89% of changed lines of code. Conversely, an average of about 89% of changed source code have no impact on RBAC security and thus need no re-validation nor investigation. The proposed method reduces the amount of candidate causes of protection changes that developers need to investigate. This information could help developers re-validate application security, identify causes of negative security changes, and perform repairs in a more effective way.",
            "Award": "",
            "Badges": "",
            "Keywords": "Security Impact of Changes;  Role Based Access Control;  Static Analysis;  Software Evolution;  Software Maintenance"
        },
        {
            "Title": "Maintaining Behaviour Driven Development Specifications: Challenges and Opportunities",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id181-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLeonard+Peter+Binamungu%2C+Suzanne+M+Embury%2C+and+Nikolaos+Konstantinou+%22Maintaining+Behaviour+Driven+Development+Specifications%3A+Challenges+and+Opportunities%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Leonard Peter Binamungu, Suzanne M Embury, and Nikolaos Konstantinou",
            "AffiliationsString": "University of Manchester, UK",
            "Authors": [
                "Binamungu-Leonard-Peter-University-of-Manchester--UK",
                "Embury-Suzanne-M-University-of-Manchester--UK",
                "Konstantinou-Nikolaos-University-of-Manchester--UK"
            ],
            "Affiliations": [
                "University of Manchester, UK",
                "University of Manchester, UK",
                "University of Manchester, UK"
            ],
            "Abstract": "In Behaviour-Driven Development (BDD) the behaviour of a software system is specified as a set of example interactions with the system using a &quot;Given-When-Then&quot; structure. These examples are expressed in high level domain-specific terms, and are executable. They thus act both as a specification of requirements and as tests that can verify whether the current system implementation provides the desired behaviour or not. This approach has many advantages but also presents some problems. When the number of examples grows, BDD specifications can become costly to maintain and extend. Some teams find that parts of the system are effectively frozen due to the challenges of finding and modifying the examples associated with them. We surveyed 75 BDD practitioners from 26 countries to understand the extent of BDD use, its benefits and challenges, and specifically the challenges of maintaining BDD specifications in practice. We found that BDD is in active use amongst respondents, and that the use of domain specific terms, improving communication among stakeholders, the executable nature of BDD specifications, and facilitating comprehension of code intentions are the main benefits of BDD. The results also showed that BDD specifications suffer the same maintenance challenges found in automated test suites more generally. We map the survey results to the literature, and propose 10 research opportunities in this area.",
            "Award": "",
            "Badges": "",
            "Keywords": "behaviour-driven development;  test suite maintenance;  test suite evolution"
        },
        {
            "Title": "A Deep Neural Network Language Model with Contexts for Source Code",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id5-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DAnh+Tuan+Nguyen%2C+Trong+Nguyen%2C+Hung+Phan%2C+and+Tien+N.+Nguyen+%22A+Deep+Neural+Network+Language+Model+with+Contexts+for+Source+Code%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Anh Tuan Nguyen, Trong Nguyen, Hung Phan, and Tien N. Nguyen",
            "AffiliationsString": "Iowa State University, USA; University of Texas at Dallas, USA",
            "Authors": [
                "Nguyen-Anh-Tuan-n.n.--n.n.",
                "Nguyen-Trong-Iowa-State-University--USA",
                "Phan-Hung-Iowa-State-University--USA",
                "Nguyen-Tien-N.-University-of-Texas-at-Dallas--USA"
            ],
            "Affiliations": [
                "n.n., n.n.",
                "Iowa State University, USA",
                "Iowa State University, USA",
                "University of Texas at Dallas, USA"
            ],
            "Abstract": "Statistical language models (LMs) have been applied in several software engineering applications. However, they have issues in dealing with ambiguities in the names of program~and API elements (classes and method calls). In this paper, inspired by the success of Deep Neural Network (DNN) in natural language processing, we present DNN4C, a DNN language model that complements the local context of lexical code elements with both syntactic and type contexts. We designed a context-incorporating method to use with syntactic and type annotations for source code in order to learn to distinguish the lexical tokens in different syntactic and type contexts. Our empirical evaluation on code completion for real-world projects shows that DNN4C relatively improves 11.6%, 16.3%, 27.1%, and 44.7% top-1 accuracy over the state-of-the-art language models for source code used with the same features: RNN LM, DNN LM, SLAMC, and $n$-gram LM, respectively. For another application, we showed that DNN4C helps improve accuracy over $n$-gram LM in migrating source code from Java to C# with a machine translation model.",
            "Award": "",
            "Badges": "",
            "Keywords": "Deep Neural Networks;  Statistical Language Models;  Source Code;  Contexts"
        },
        {
            "Title": "Clustering Support for Inadequate Test Suite Reduction",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id31-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DCarmen+Coviello%2C+Simone+Romano%2C+Giuseppe+Scanniello%2C+Alessandro+Marchetto%2C+Giuliano+Antoniol%2C+and+Anna+Corazza+%22Clustering+Support+for+Inadequate+Test+Suite+Reduction%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Carmen Coviello, Simone Romano, Giuseppe Scanniello, Alessandro Marchetto, Giuliano Antoniol, and Anna Corazza",
            "AffiliationsString": "University of Basilicata, Italy; Polytechnique Montréal, Canada; Federico II University of Naples, Italy",
            "Authors": [
                "Coviello-Carmen-University-of-Basilicata--Italy",
                "Romano-Simone-University-of-Basilicata--Italy",
                "Scanniello-Giuseppe-University-of-Basilicata--Italy",
                "Marchetto-Alessandro-n.n.--n.n.",
                "Antoniol-Giuliano-Polytechnique-Montreal--Canada",
                "Corazza-Anna-Federico-II-University-of-Naples--Italy"
            ],
            "Affiliations": [
                "University of Basilicata, Italy",
                "University of Basilicata, Italy",
                "University of Basilicata, Italy",
                "n.n., n.n.",
                "Polytechnique Montréal, Canada",
                "Federico II University of Naples, Italy"
            ],
            "Abstract": "Regression testing is an important activity that can be expensive (e.g., for large test suites). Test suite reduction approaches speed up regression testing by removing redundant test cases. These approaches can be classified as adequate or inadequate. Adequate approaches reduce test suites so that they completely preserve the test requirements (e.g., code coverage) of the original test suites. Inadequate approaches produce reduced test suites that only partially preserve the test requirements. An inadequate approach is appealing when it leads to a greater reduction in test suite size at the expense of a small loss in fault-detection capability. We investigate a clustering-based approach for inadequate test suite reduction and compare it with well-known adequate approaches. Our investigation is founded on a public dataset and allows an exploration of trade-offs in test suite reduction. Results help a more informed decision, using guidelines defined in this research, to balance size, coverage, and fault-detection loss of reduced test suites when using clustering.",
            "Award": "",
            "Badges": "",
            "Keywords": "test suite reduction;  regression testing;  software clustering"
        },
        {
            "Title": "Mining Accurate Message Formats for Service APIs",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id51-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMd+Arafat+Hossain%2C+Steve+Versteeg%2C+Jun+Han%2C+Muhammad+Ashad+Kabir%2C+Jiaojiao+Jiang%2C+and+Jean-Guy+Schneider+%22Mining+Accurate+Message+Formats+for+Service+APIs%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Md Arafat Hossain, Steve Versteeg, Jun Han, Muhammad Ashad Kabir, Jiaojiao Jiang, and Jean-Guy Schneider",
            "AffiliationsString": "Swinburne University of Technology, Australia; CA Technologies, Australia",
            "Authors": [
                "Hossain-Md-Arafat-Swinburne-University-of-Technology--Australia",
                "Versteeg-Steve-CA-Technologies--Australia",
                "Han-Jun-Swinburne-University-of-Technology--Australia",
                "Kabir-Muhammad-Ashad-Swinburne-University-of-Technology--Australia",
                "Jiang-Jiaojiao-Swinburne-University-of-Technology--Australia",
                "Schneider-Jean-Guy-Swinburne-University-of-Technology--Australia"
            ],
            "Affiliations": [
                "Swinburne University of Technology, Australia",
                "CA Technologies, Australia",
                "Swinburne University of Technology, Australia",
                "Swinburne University of Technology, Australia",
                "Swinburne University of Technology, Australia",
                "Swinburne University of Technology, Australia"
            ],
            "Abstract": "APIs play a significant role in the sharing, utilization and integration of information and service assets for enterprises, delivering significant business value. However, the documentation of service APIs can often be incomplete, ambiguous, or even nonexistent, hindering API-based application development efforts. In this paper, we introduce an approach to automatically mine the fine-grained message formats required in defining the APIs of services and applications from their interaction traces, without assuming any prior knowledge. Our approach includes three major steps with corresponding techniques: (1) classifying the interaction messages of a service into clusters corresponding to message types, (2) identifying the keywords of messages in each cluster, and (3) extracting the format of each message type. We have applied our approach to network traces collected from four real services which used the following application protocols: REST, SOAP, LDAP and SIP. The results show that our approach achieves much greater accuracy in extracting message formats for service APIs than current state-of-art approaches.",
            "Award": "",
            "Badges": "",
            "Keywords": "Service mining;  message format;  message trace;  entropy;  keyword identification"
        },
        {
            "Title": "Detecting Third-Party Libraries in Android Applications with High Precision and Recall",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id56-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYuan+Zhang%2C+Jiarun+Dai%2C+Xiaohan+Zhang%2C+Sirong+Huang%2C+Zhemin+Yang%2C+Min+Yang%2C+and+Hao+Chen+%22Detecting+Third-Party+Libraries+in+Android+Applications+with+High+Precision+and+Recall%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Yuan Zhang, Jiarun Dai, Xiaohan Zhang, Sirong Huang, Zhemin Yang, Min Yang, and Hao Chen",
            "AffiliationsString": "Fudan University, China; University of California at Davis, USA",
            "Authors": [
                "Zhang-Yuan-Fudan-University--China",
                "Dai-Jiarun-Fudan-University--China",
                "Zhang-Xiaohan-Fudan-University--China",
                "Huang-Sirong-Fudan-University--China",
                "Yang-Zhemin-Fudan-University--China",
                "Yang-Min-Fudan-University--China",
                "Chen-Hao-University-of-California-at-Davis--USA"
            ],
            "Affiliations": [
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China",
                "Fudan University, China",
                "University of California at Davis, USA"
            ],
            "Abstract": "Third-party libraries are widely used in Android applications to ease development and enhance functionalities. However, the incorporated libraries also bring new security &#38; privacy issues to the host application, and blur the accounting of application code and library code. Under this situation, a precise and reliable library detector is highly desirable. In fact, library code may be customized by developers during integration and dead library code may be eliminated by code obfuscators during application build process. However, existing research on library detection has not gracefully handled these problems, thus facing severe limitations in practice.  In this paper, we propose LibPecker, an obfuscation-resilient, highly precise and reliable library detector for Android applications. LibPecker adopts signature matching to give a similarity score between a given library and an application. By fully utilizing the internal class dependencies inside a library, LibPecker generates a strict signature for each class. To tolerate library code customization and elimination as much as possible, LibPecker introduces adaptive class similarity threshold and weighted class similarity score in calculating library similarity. To quantitatively evaluate precision and recall of LibPecker, we perform the first such experiment (to the best of our knowledge) with a large number of libraries and applications. Results show that LibPecker significantly outperforms state-of-the-art tool in both recall and precision (91% and 98.1% respectively",
            "Award": "",
            "Badges": "",
            "Keywords": "Library Detection;  Code Similarity;  Obfuscation Resilience"
        },
        {
            "Title": "Automatically Repairing Dependency-Related Build Breakage",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id69-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DChristian+Macho%2C+Shane+McIntosh%2C+and+Martin+Pinzger+%22Automatically+Repairing+Dependency-Related+Build+Breakage%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Christian Macho, Shane McIntosh, and Martin Pinzger",
            "AffiliationsString": "University of Klagenfurt, Austria; McGill University, Canada",
            "Authors": [
                "Macho-Christian-University-of-Klagenfurt--Austria",
                "McIntosh-Shane-McGill-University--Canada",
                "Pinzger-Martin-University-of-Klagenfurt--Austria"
            ],
            "Affiliations": [
                "University of Klagenfurt, Austria",
                "McGill University, Canada",
                "University of Klagenfurt, Austria"
            ],
            "Abstract": "Build systems are widely used in today’s software projects to automate integration and build processes. Similar to source code, build specifications need to be maintained to avoid outdated specifications, and build breakage as a consequence. Recent work indicates that neglected build maintenance is one of the most frequently occurring reasons why open source and proprietary builds break. In this paper, we propose BuildMedic, an approach to automatically repair Maven builds that break due to dependency-related issues. Based on a manual investigation of 37 broken Maven builds in 23 open source Java projects, we derive three repair strategies to automatically repair the build, namely Version Update, Delete Dependency, and Add Repository. We evaluate the three strategies on 84 additional broken builds from the 23 studied projects in order to demonstrate the applicability of our approach. The evaluation shows that BuildMedic can automatically repair 45 of these broken builds (54%). Furthermore, in 36% of the successfully repaired build breakages, BuildMedic outputs at least one repair candidate that is considered a correct repair. Moreover, 76% of them could be repaired with only a single dependency correction.",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "Automatically Exploiting Implicit Design Knowledge When Solving the Class Responsibility Assignment Problem",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id76-p",
            "URL": "http%3A%2F%2Fwww.cs.rug.nl%2Fsearch%2Fuploads%2FPublications%2Fxu2017aei.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Yongrui Xu, Peng Liang, and Muhammad Ali Babar",
            "AffiliationsString": "Wuhan University, China; University of Adelaide, Australia",
            "Authors": [
                "Xu-Yongrui-Wuhan-University--China",
                "Liang-Peng-Wuhan-University--China",
                "Babar-Muhammad-Ali-University-of-Adelaide--Australia"
            ],
            "Affiliations": [
                "Wuhan University, China",
                "Wuhan University, China",
                "University of Adelaide, Australia"
            ],
            "Abstract": "Assigning responsibilities to classes is not only vital during initial software analysis/design phases in object-oriented analysis and design (OOAD), but also during maintenance and evolution phases, when new responsibilities have to be assigned to classes or existing responsibilities have to be changed. Class Re-sponsibility Assignment (CRA) is one of the most complex tasks in OOAD as it heavily relies on designers’ judgment and implicit design knowledge (DK) of design problems. Since CRA is highly dependent on the successful use of implicit DK, (semi)- automat-ed approaches that help designers to assign responsibilities to classes should make implicit DK explicit and exploit the DK ef-fectively. In this paper, we propose a learning based approach for the Class Responsibility Assignment (CRA) problem. A learning mechanism is introduced into Genetic Algorithm (GA) to extract the implicit DK about which responsibilities have a high proba-bility to be assigned to the same class, and then the extracted DK is employed automatically to improve the design quality of the generated solutions. The proposed approach has been evaluated through an experimental study with three cases. By comparing the solutions obtained from the proposed approach and the exist-ing approaches, the proposed approach can significantly improve the design quality of the generated solutions to the CRA problem, and the generated solutions by the proposed approach are more likely to be accepted by developers from the practical aspects.",
            "Award": "",
            "Badges": "",
            "Keywords": "Search-Based Software Engineering;  Class Responsibility Assignment;  Object-Oriented Analysis and Design"
        },
        {
            "Title": "Mining Sandboxes: Are We There Yet?",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id90-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLingfeng+Bao%2C+Bui+Tien+Duy+Le%2C+and+David+Lo+%22Mining+Sandboxes%3A+Are+We+There+Yet%3F%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Lingfeng Bao, Bui Tien Duy Le, and David Lo",
            "AffiliationsString": "Singapore Management University, Singapore",
            "Authors": [
                "Bao-Lingfeng-Singapore-Management-University--Singapore",
                "Le-Bui-Tien-Duy-Singapore-Management-University--Singapore",
                "Lo-David-Singapore-Management-University--Singapore"
            ],
            "Affiliations": [
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore",
                "Singapore Management University, Singapore"
            ],
            "Abstract": "The popularity of Android platform on mobile devices has attracted much attention from many developers and researchers, as well as malware writers. Recently, Jamrozik et al. proposed a technique to secure Android applications referred to as mining sandboxes. They used an automated test case generation technique to explore the behavior of the app under test and then extracted a set of sensitive APIs that were called. Based on the extracted sensitive APIs, they built a sandbox that can block access to APIs not used during testing. However, they only evaluated the proposed technique with benign apps but not investigated whether it was effective in detecting malicious behavior of malware that infects benign apps. Furthermore, they only investigated one test case generation tool (i.e., Droidmate) to build the sandbox, while many others have been proposed in the literature.  In this work, we complement Jamrozik et al.’s work in two ways: (1) we evaluate the effectiveness of mining sandboxes on detecting malicious behaviors; (2) we investigate the effectiveness of multiple automated test case generation tools to mine sandboxes. To investigate effectiveness of mining sandboxes in detecting malicious behaviors, we make use of pairs of malware and benign app it infects. We build a sandbox based on sensitive APIs called by the benign app and check if it can identify malicious behaviors in the corresponding malware. To generate inputs to apps, we investigate five popular test case generation tools: Monkey, Droidmate, Droidbot, GUIRipper, and PUMA. We conduct two experiments to evaluate the effectiveness and efficiency of these test case generation tools on detecting malicious behavior. In the first experiment, we select 10 apps and allow test case generation tools to run for one hour; while in the second experiment, we select 102 pairs of apps and allow the test case generation tools to run for one minute. Our experiments highlight that 75.5% 77.2% of malware in our dataset can be uncovered by mining sandboxes – showing its power to protect Android apps. We also find that Droidbot performs best in generating test cases for mining sandboxes, and its effectiveness can be further boosted when coupled with other test case generation tools.",
            "Award": "",
            "Badges": "",
            "Keywords": "Mining Sandboxing;  Android Malware;  Automated Test Case Generation"
        },
        {
            "Title": "DeepWeak: Reasoning Common Software Weaknesses via Knowledge Graph Embedding",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id93-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DZhuobing+Han%2C+Xiaohong+Li%2C+Hongtao+Liu%2C+Zhenchang+Xing%2C+and+Zhiyong+Feng+%22DeepWeak%3A+Reasoning+Common+Software+Weaknesses+via+Knowledge+Graph+Embedding%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Zhuobing Han, Xiaohong Li, Hongtao Liu, Zhenchang Xing, and Zhiyong Feng",
            "AffiliationsString": "Tianjin University, China; Australian National University, Australia",
            "Authors": [
                "Han-Zhuobing-Tianjin-University--China",
                "Li-Xiaohong-Tianjin-University--China",
                "Liu-Hongtao-Tianjin-University--China",
                "Xing-Zhenchang-Australian-National-University--Australia",
                "Feng-Zhiyong-Tianjin-University--China"
            ],
            "Affiliations": [
                "Tianjin University, China",
                "Tianjin University, China",
                "Tianjin University, China",
                "Australian National University, Australia",
                "Tianjin University, China"
            ],
            "Abstract": "Common software weaknesses, such as improper input validation, integer overflow, can harm system security directly or indirectly, causing adverse effects such as denial-of-service, execution of unauthorized code. Common Weakness Enumeration (CWE) maintains a standard list and classification of common software weakness. Although CWE contains rich information about software weaknesses, including textual descriptions, common sequences and relations between software weaknesses, the current data representation, i.e., hyperlined documents, does not support advanced reasoning tasks on software weaknesses, such as prediction of missing relations and common consequences of CWEs.Such reasoning tasks become critical to managing and analyzing large numbers of common software weaknesses and their relations. In this paper, we propose to represent common software weaknesses and their relations as a knowledge graph, and develop a translation-based, description-embodied knowledge representation learning method to embed both software weaknesses and their relations in the knowledge graph into a semantic vector space. The vector representations (i.e., embeddings) of software weaknesses and their relations can be exploited for knowledge acquisition and inference.We conduct extensive experiments to evaluate the performance of software weakness and relation embeddings in three reasoning tasks, including CWE link prediction, CWE triple classification, and common consequence prediction. Our knowledge graph embedding approach outperforms other description- and/or structure-based representation learning methods.",
            "Award": "",
            "Badges": "",
            "Keywords": "Software weakness prediction;  multi-class classification;  knowledge graph;  mining software repositories"
        },
        {
            "Title": "Using Recurrent Neural Networks for Decompilation",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id129-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DDeborah+S.+Katz%2C+Jason+Ruchti%2C+and+Eric+Schulte+%22Using+Recurrent+Neural+Networks+for+Decompilation%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Deborah S. Katz, Jason Ruchti, and Eric Schulte",
            "AffiliationsString": "Carnegie Mellon University, USA; GrammaTech, USA",
            "Authors": [
                "Katz-Deborah-S.-Carnegie-Mellon-University--USA",
                "Ruchti-Jason-GrammaTech--USA",
                "Schulte-Eric-GrammaTech--USA"
            ],
            "Affiliations": [
                "Carnegie Mellon University, USA",
                "GrammaTech, USA",
                "GrammaTech, USA"
            ],
            "Abstract": "Decompilation, recovering source code from binary, is useful in many situations where it is necessary to analyze or understand software for which source code is not available. Source code is much easier for humans to read than binary code, and there are many tools available to analyze source code. Existing decompilation techniques often generate source code that is difficult for humans to understand because the generated code often does not use the coding idioms that programmers use. Differences from human-written code also reduce the effectiveness of analysis tools on the decompiled source code.  To address the problem of differences between decompiled code and human-written code, we present a novel technique for decompiling binary code snippets using a model based on Recurrent Neural Networks. The model learns properties and patterns that occur in source code and uses them to produce decompilation output. We train and evaluate our technique on snippets of binary machine code compiled from C source code. The general approach we outline in this paper is not language-specific and requires little or no domain knowledge of a language and its properties or how a compiler operates, making the approach easily extensible to new languages and constructs. Furthermore, the technique can be extended and applied in situations to which traditional decompilers are not targeted, such as for decompilation of isolated binary snippets; fast, on-demand decompilation; domain-specific learned decompilation; optimizing for readability of decompilation; and recovering control flow constructs, comments, and variable or function names. We show that the translations produced by this technique are often accurate or close and can provide a useful picture of the snippet&#39;s behavior.",
            "Award": "",
            "Badges": "",
            "Keywords": "decompilation;  recurrent neural networks;  translation;  deep learning; "
        },
        {
            "Title": "Using a Probabilistic Model to Predict Bug Fixes",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id136-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DMauricio+Soto+and+Claire+Le+Goues+%22Using+a+Probabilistic+Model+to+Predict+Bug+Fixes%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Mauricio Soto and Claire Le Goues",
            "AffiliationsString": "Carnegie Mellon University, USA",
            "Authors": [
                "Soto-Mauricio-Carnegie-Mellon-University--USA",
                "Le-Goues-Claire-Carnegie-Mellon-University--USA"
            ],
            "Affiliations": [
                "Carnegie Mellon University, USA",
                "Carnegie Mellon University, USA"
            ],
            "Abstract": "Automatic Software Repair (APR) has significant potential to reduce software maintenance costs by reducing the human effort required to localize and fix bugs. State-of-theart generate-and-validate APR techniques select between and instantiate various mutation operators to construct candidate patches, informed largely by heuristic probability distributions. This may reduce effectiveness in terms of both efficiency and output quality. In practice, human developers have many options in terms of how to edit code to fix bugs, some of which are far more common than others (e.g., deleting a line of code is more common than adding a new class). We mined the most recent 100 bug-fixing commits from each of the 500 most popular Java projects in GitHub (the largest dataset to date) to create a probabilistic model describing edit distributions. We categorize, compare and evaluate the different mutation operators used in state-of-the-art approaches. We find that a probabilistic model-based APR approach patches bugs more quickly in the majority of bugs studied, and that the resulting patches are of higher quality than those produced by previous approaches. Finally, we mine association rules for multi-edit source code changes, an understudied but important problem. We validate the association rules by analyzing how much of our corpus can be built from them. Our evaluation indicates that 84.6% of the multi-edit patches from the corpus can be built from the association rules, while maintaining 90% confidence.",
            "Award": "",
            "Badges": "",
            "Keywords": "Automatic program repair;  probabilistic model;  APR;  Association rules"
        },
        {
            "Title": "SQL-Aware Fault Localization in PHP-Based Web Applications",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id192-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DHung+Viet+Nguyen%2C+Hoan+Anh+Nguyen%2C+and+Tien+N.+Nguyen+%22SQL-Aware+Fault+Localization+in+PHP-Based+Web+Applications%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Hung Viet Nguyen, Hoan Anh Nguyen, and Tien N. Nguyen",
            "AffiliationsString": "Google, USA; Iowa State University, USA; University of Texas at Dallas, USA",
            "Authors": [
                "Nguyen-Hung-Viet-Google--USA",
                "Nguyen-Hoan-Anh-Iowa-State-University--USA",
                "Nguyen-Tien-N.-University-of-Texas-at-Dallas--USA"
            ],
            "Affiliations": [
                "Google, USA",
                "Iowa State University, USA",
                "University of Texas at Dallas, USA"
            ],
            "Abstract": "Localizing and fixing software faults is an important software maintenance task in improving software quality. In a dynamic Web application, localizing the faults is challenging due to its dynamic nature and the interactions between the application and the databases. The faults could occur in the statements in the host program or inside the queries that are sent from the application to be executed in the database engines. This paper presents SQLook, a novel database-aware fault localization method/tool that is able to locate output faults in PHP statements of a dynamic Web application as well as in the predicates of the WHERE expressions in SQL queries. In SQLook, a PHP interpreter is instrumented to execute an SQL query and to monitor the evaluation of those SQL predicates to determine if they affect the output process of individual data records. It performs row-based slicing across PHP statements and SQL queries to record the entities that are involved in the output of each data row. Finally, it uses predicate switching to identify the suspicious predicates in an SQL query. Our empirical evaluation shows that SQLook can achieve higher accuracy than the state-of-the-art database-aware fault localization approach.",
            "Award": "",
            "Badges": "",
            "Keywords": "Fault Localization;  PHP Web applications;  SQL"
        },
        {
            "Title": "Syntax and Sensibility: Using Language Models to Detect and Correct Syntax Errors",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id42-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DEddie+Antonio+Santos%2C+Joshua+Charles+Campbell%2C+Dhvani+Patel%2C+Abram+Hindle%2C+and+Jos%C3%A9+Nelson+Amaral+%22Syntax+and+Sensibility%3A+Using+Language+Models+to+Detect+and+Correct+Syntax+Errors%22",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fgithub.com%2Fnaturalness%2Fsensibility",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Eddie Antonio Santos, Joshua Charles Campbell, Dhvani Patel, Abram Hindle, and José Nelson Amaral",
            "AffiliationsString": "University of Alberta, Canada",
            "Authors": [
                "Santos-Eddie-Antonio-University-of-Alberta--Canada",
                "Campbell-Joshua-Charles-University-of-Alberta--Canada",
                "Patel-Dhvani-University-of-Alberta--Canada",
                "Hindle-Abram-University-of-Alberta--Canada",
                "Amaral-Jose-Nelson-University-of-Alberta--Canada"
            ],
            "Affiliations": [
                "University of Alberta, Canada",
                "University of Alberta, Canada",
                "University of Alberta, Canada",
                "University of Alberta, Canada",
                "University of Alberta, Canada"
            ],
            "Abstract": "Syntax errors are made by novice and experienced programmers alike; however, novice programmers lack the years of experience that help them quickly resolve these frustrating errors. Standard LR parsers are of little help, typically resolving syntax errors and their precise location poorly. We propose a methodology that locates where syntax errors occur, and suggests possible changes to the token stream that can fix the error identified. This methodology finds syntax errors by using language models trained on correct source code to find tokens that seem out of place. Fixes are synthesized by consulting the language models to determine what tokens are more likely at the estimated error location. We compare n-gram and LSTM (long short-term memory) language models for this task, each trained on a large corpus of Java code collected from GitHub. Unlike prior work, our methodology does not rely that the problem source code comes from the same domain as the training data. We evaluated against a repository of real student mistakes. Our tools are able to find a syntactically-valid fix within its top-2 suggestions, often producing the exact fix that the student used to resolve the error. The results show that this tool and methodology can locate and suggest corrections for syntax errors. Our methodology is of practical use to all programmers, but will be especially useful to novices frustrated with incomprehensible syntax errors.",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "The Impact of Refactoring Changes on the SZZ Algorithm: An Empirical Study",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id46-p",
            "URL": "https%3A%2F%2Fedmilsoncampos.files.wordpress.com%2F2018%2F01%2Fsaner18main-id46-p-97b9c7e-34928-final.pdf",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fsites.google.com%2Fview%2Frefactoringszz%2F",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Edmilson Campos Neto, Daniel Alencar Da Costa, and Uirá Kulesza",
            "AffiliationsString": "Instituto Federal do Rio Grande do Norte, Brazil; Queen's University, Canada; Federal University of Rio Grande do Norte, Brazil",
            "Authors": [
                "Neto-Edmilson-Campos-Instituto-Federal-do-Rio-Grande-do-Norte--Brazil",
                "Da-Costa-Daniel-Alencar-Queen-s-University--Canada",
                "Kulesza-Uira-Federal-University-of-Rio-Grande-do-Norte--Brazil"
            ],
            "Affiliations": [
                "Instituto Federal do Rio Grande do Norte, Brazil",
                "Queen's University, Canada",
                "Federal University of Rio Grande do Norte, Brazil"
            ],
            "Abstract": "SZZ is a widely used algorithm in the software engineering community to identify changes that are likely to introduce bugs (i.e., bug-introducing changes). Despite its wide adoption, SZZ still has room for improvements. For example, current SZZ implementations may still flag refactoring changes as bug-introducing. Refactorings should be disregarded as bug-introducing because they do not change the system behaviour. In this paper, we empirically investigate how refactorings impact both the input (bug-fix changes) and the output (bug-introducing changes) of the SZZ algorithm. We analyse 31,518 issues of ten Apache projects with 20,298 bug-introducing changes. We use an existing tool that automatically detects refactorings in code changes. We observe that 6.5% of lines that are flagged as bug-introducing changes by SZZ are in fact refactoring changes. Regarding bug-fix changes, we observe that 19.9% of lines that are removed during a fix are related to refactorings and, therefore, their respective inducing changes are false positives. We then incorporate the refactoring-detection tool in our Refactoring Aware SZZ Implementation (RA-SZZ). Our results reveal that RA-SZZ reduces 20.8% of the lines that are flagged as bug-introducing changes compared to the state-of-the-art SZZ implementations. Finally, we perform a manual analysis to identify change patterns that are not captured by the refactoring identification tool used in our study. Our results reveal that 47.95% of the analyzed bug-introducing changes contain additional change patterns that RA-SZZ should not flag as bug-introducing.",
            "Award": "",
            "Badges": "",
            "Keywords": "SZZ algorithm;  refactoring;  bug-introducing change;  bug-fix change"
        },
        {
            "Title": "Detecting Faulty Empty Cells in Spreadsheets",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id47-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DLiang+Xu%2C+Shuo+Wang%2C+Wensheng+Dou%2C+Bo+Yang%2C+Chushu+Gao%2C+Jun+Wei%2C+and+Tao+Huang+%22Detecting+Faulty+Empty+Cells+in+Spreadsheets%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Liang Xu, Shuo Wang, Wensheng Dou, Bo Yang, Chushu Gao, Jun Wei, and Tao Huang",
            "AffiliationsString": "Institute of Software at Chinese Academy of Sciences, China; North China University of Technology, China",
            "Authors": [
                "Xu-Liang-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
                "Wang-Shuo-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
                "Dou-Wensheng-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
                "Yang-Bo-North-China-University-of-Technology--China",
                "Gao-Chushu-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
                "Wei-Jun-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
                "Huang-Tao-Institute-of-Software-at-Chinese-Academy-of-Sciences--China"
            ],
            "Affiliations": [
                "Institute of Software at Chinese Academy of Sciences, China",
                "Institute of Software at Chinese Academy of Sciences, China",
                "Institute of Software at Chinese Academy of Sciences, China",
                "North China University of Technology, China",
                "Institute of Software at Chinese Academy of Sciences, China",
                "Institute of Software at Chinese Academy of Sciences, China",
                "Institute of Software at Chinese Academy of Sciences, China"
            ],
            "Abstract": "Spreadsheets play an important role in various business tasks, such as financial reports and data analysis. In spreadsheets, empty cells are widely used for different purposes, e.g., separating different tables, or default value “0”. However, a user may delete a formula unintentionally, and leave a cell empty. Such ad-hoc modification may introduce a faulty empty cell that should have a formula. We observe that the context of an empty cell can help determine whether the empty cell is faulty. For example, is the empty cell next to a cell array in which all cells share the same semantics? Does the empty cell have headers similar to other non-empty cells’? In this paper, we propose EmptyCheck, to detect faulty empty cells in spreadsheets. By analyzing the context of an empty cell, EmptyCheck validates whether the cell belong to a cell array. If yes, the empty cell is faulty since it does not contain a formula. We evaluate EmptyCheck on 100 randomly sampled EUSES spreadsheets. The experimental result shows that EmptyCheck can detect faulty empty cells with high precision (75.00%) and recall (87.04%). Existing techniques can detect only 4.26% of the true faulty empty cells that EmptyCheck detects.",
            "Award": "",
            "Badges": "",
            "Keywords": "Spreadsheet;  fault;  empty cell"
        },
        {
            "Title": "Connecting Software Metrics across Versions to Predict Defects",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id62-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DYibin+Liu%2C+Yanhui+Li%2C+Jianbo+Guo%2C+Yuming+Zhou%2C+and+Baowen+Xu+%22Connecting+Software+Metrics+across+Versions+to+Predict+Defects%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Yibin Liu, Yanhui Li, Jianbo Guo, Yuming Zhou, and Baowen Xu",
            "AffiliationsString": "Nanjing University, China; Tsinghua University, China",
            "Authors": [
                "Liu-Yibin-Nanjing-University--China",
                "Li-Yanhui-Nanjing-University--China",
                "Guo-Jianbo-Tsinghua-University--China",
                "Zhou-Yuming-Nanjing-University--China",
                "Xu-Baowen-Nanjing-University--China"
            ],
            "Affiliations": [
                "Nanjing University, China",
                "Nanjing University, China",
                "Tsinghua University, China",
                "Nanjing University, China",
                "Nanjing University, China"
            ],
            "Abstract": "Accurate software defect prediction could help software practitioners allocate test resources to defect-prone modules effectively and efficiently. In the last decades, much effort has been devoted to build accurate defect prediction models, including developing quality defect predictors and modeling techniques. However, current widely used defect predictors such as code metrics and process metrics could not well describe how software modules change over the project evolution, which we believe is important for defect prediction. In order to deal with this problem, in this paper, we propose to use the Historical Version Sequence of Metrics (HVSM) in continuous software versions as defect predictors. Furthermore, we leverage Recurrent Neural Network (RNN), a popular modeling technique, to take HVSM as the input to build software prediction models. The experimental results show that, in most cases, the proposed HVSM-based RNN model has significantly better effort-aware ranking effectiveness than the commonly used baseline models.",
            "Award": "",
            "Badges": "",
            "Keywords": "Defect Prediction;  Metrics;  Version Sequence;  Recurrent Neural Network"
        },
        {
            "Title": "How Good Is Your Puppet? An Empirically Defined and Validated Quality Model for Puppet",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id70-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DEduard+Van+der+Bent%2C+Jurriaan+Hage%2C+Joost+Visser%2C+and+Georgios+Gousios+%22How+Good+Is+Your+Puppet%3F+An+Empirically+Defined+and+Validated+Quality+Model+for+Puppet%22",
            "URLvideo": "",
            "URLinfo": "https%3A%2F%2Fgithub.com%2Fevanderbent%2FPuppetSurveyData",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Eduard Van der Bent, Jurriaan Hage, Joost Visser, and Georgios Gousios",
            "AffiliationsString": "Utrecht University, Netherlands; Software Improvement Group, Netherlands; Delft University of Technology, Netherlands",
            "Authors": [
                "Van-der-Bent-Eduard-Utrecht-University--Netherlands",
                "Hage-Jurriaan-Utrecht-University--Netherlands",
                "Visser-Joost-Software-Improvement-Group--Netherlands",
                "Gousios-Georgios-Delft-University-of-Technology--Netherlands"
            ],
            "Affiliations": [
                "Utrecht University, Netherlands",
                "Utrecht University, Netherlands",
                "Software Improvement Group, Netherlands",
                "Delft University of Technology, Netherlands"
            ],
            "Abstract": "Puppet is a declarative language for configuration management that has rapidly gained popularity in recent years. Numerous organizations now rely on Puppet code for deploying their software systems onto cloud infrastructures. In this paper we provide a definition of code quality for Puppet code and an automated technique for measuring and rating Puppet code quality. To this end, we first explore the notion of code quality as it applies to Puppet code by performing a survey among Puppet developers. Second, we develop a measurement model for the maintainability aspect of Puppet code quality. To arrive at this measurement model, we derive appropriate quality metrics from our survey results and from existing software quality models. We implemented the Puppet code quality model in a software analysis tool. We validate our definition of Puppet code quality and the measurement model by a structured interview with Puppet experts and by comparing the tool results with quality judgments of those experts. The validation shows that the measurement model and tool provide quality judgments of Puppet code that closely match the judgments of experts. Also, the experts deem the model appropriate and usable in practice. The Software Improvement Group (SIG) has started using the model in its consultancy practice.",
            "Award": "",
            "Badges": "",
            "Keywords": ""
        },
        {
            "Title": "An Extensible Approach for Taming the Challenges of JavaScript Dead Code Elimination",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id74-p",
            "URL": "http%3A%2F%2Fwww.ivanomalavolta.com%2Ffiles%2Fpapers%2FSANER_2018.pdf",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Niels Groot Obbink, Ivano Malavolta, Gian Luca Scoccia, and Patricia Lago",
            "AffiliationsString": "Vrije Universiteit Amsterdam, Netherlands; Gran Sasso Science Institute, Italy",
            "Authors": [
                "Obbink-Niels-Groot-Vrije-Universiteit-Amsterdam--Netherlands",
                "Malavolta-Ivano-Vrije-Universiteit-Amsterdam--Netherlands",
                "Scoccia-Gian-Luca-Gran-Sasso-Science-Institute--Italy",
                "Lago-Patricia-Vrije-Universiteit-Amsterdam--Netherlands"
            ],
            "Affiliations": [
                "Vrije Universiteit Amsterdam, Netherlands",
                "Vrije Universiteit Amsterdam, Netherlands",
                "Gran Sasso Science Institute, Italy",
                "Vrije Universiteit Amsterdam, Netherlands"
            ],
            "Abstract": "JavaScript is becoming the de-facto programming language of the Web. Large-scale web applications (web apps) written in Javascript are commonplace nowadays, with big technology players (e.g., Google, Facebook) using it in their core flagship products. Today, it is common practice to reuse existing JavaScript code, usually in the form of third-party libraries and frameworks. If on one side this practice helps in speeding up development time, on the other side it comes with the risk of bringing dead code, i.e., JavaScript code which is never executed, but still downloaded from the network and parsed in the browser. This overhead can negatively impact the overall performance and energy consumption of the web app. In this paper we present Lacuna, an approach for JavaScript dead code elimination, where existing JavaScript analysis techniques are applied in combination. The proposed approach supports both static and dynamic analyses, it is extensible, and independent of the specificities of the used JavaScript analysis techniques. Lacuna can be applied to any JavaScript code base, without imposing any constraints to the developer, e.g., on her coding style or on the use of some specific JavaScript feature (e.g., modules). Lacuna has been evaluated on a suite of 29 publicly-available web apps, composed of 15,946 JavaScript functions, and built with different JavaScript frameworks (e.g., Angular, Vue.js, jQuery). Despite being a prototype, Lacuna obtained promising results in terms of analysis execution time and precision.",
            "Award": "",
            "Badges": "",
            "Keywords": "JavaScript;  Dead code elimination;  Program analysis"
        },
        {
            "Title": "Automated Refactoring of Client-Side JavaScript Code to ES6 Modules",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id84-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DKaterina+Paltoglou%2C+Vassilis+E.+Zafeiris%2C+E.+A.+Giakoumakis%2C+and+N.+A.+Diamantidis+%22Automated+Refactoring+of+Client-Side+JavaScript+Code+to+ES6+Modules%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Katerina Paltoglou, Vassilis E. Zafeiris, E. A. Giakoumakis, and N. A. Diamantidis",
            "AffiliationsString": "Athens University of Economics and Business, Greece",
            "Authors": [
                "Paltoglou-Katerina-Athens-University-of-Economics-and-Business--Greece",
                "Zafeiris-Vassilis-E.-Athens-University-of-Economics-and-Business--Greece",
                "Giakoumakis-E.-A.-Athens-University-of-Economics-and-Business--Greece",
                "Diamantidis-N.-A.-Athens-University-of-Economics-and-Business--Greece"
            ],
            "Affiliations": [
                "Athens University of Economics and Business, Greece",
                "Athens University of Economics and Business, Greece",
                "Athens University of Economics and Business, Greece",
                "Athens University of Economics and Business, Greece"
            ],
            "Abstract": "JavaScript (textrm{JS}) is a dynamic, weakly-typed and object-based programming language that expanded its reach, in recent years, from the desktop web browser to a wide range of runtime platforms in embedded, mobile and server hosts. Moreover, the scope of functionality implemented in textrm{JS} scaled from DOM manipulation in dynamic HTML pages to full-scale applications for various domains, stressing the need for code reusability and maintainability. Towards this direction, the ECMAScript 6 (textrm{ES6}) revision of the language standardized the syntax for class and module definitions, streamlining the encapsulation of data and functionality at various levels of granularity.  This work focuses on refactoring client-side web applications for the elimination of code smells, relevant to global variables and functions that are declared in textrm{JS} files linked to a web page. These declarations ``pollute&#39;&#39; the global namespace at runtime and often lead to name conflicts with undesired effects. We propose a method for the encapsulation of global declarations through automated refactoring to textrm{ES6} modules. Our approach transforms each linked textrm{JS} script of a web application to an textrm{ES6} module with appropriate import and export declarations that are inferred through static analysis. A prototype implementation of the proposed method, based on WALA libraries, has been evaluated on a set of open source projects. The evaluation results support the applicability and runtime efficiency of the proposed method.",
            "Award": "",
            "Badges": "",
            "Keywords": "Refactoring;  Client-side JavaScript;  Global variables;  ES6 Modules"
        },
        {
            "Title": "Dissection of a Bug Dataset: Anatomy of 395 Patches from Defects4J",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id108-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DVictor+Sobreira%2C+Thomas+Durieux%2C+Fernanda+Madeiral%2C+Martin+Monperrus%2C+and+Marcelo+de+Almeida+Maia+%22Dissection+of+a+Bug+Dataset%3A+Anatomy+of+395+Patches+from+Defects4J%22",
            "URLvideo": "",
            "URLinfo": "http%3A%2F%2Fprogram-repair.org%2Fdefects4j-dissection%2F",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Victor Sobreira, Thomas Durieux, Fernanda Madeiral, Martin Monperrus, and Marcelo de Almeida Maia",
            "AffiliationsString": "Federal University of Uberlândia, Brazil; Inria, France; KTH, Sweden",
            "Authors": [
                "Sobreira-Victor-Federal-University-of-Uberlandia--Brazil",
                "Durieux-Thomas-Inria--France",
                "Madeiral-Fernanda-Federal-University-of-Uberlandia--Brazil",
                "Monperrus-Martin-KTH--Sweden",
                "Maia-Marcelo-de-Almeida-Federal-University-of-Uberlandia--Brazil"
            ],
            "Affiliations": [
                "Federal University of Uberlândia, Brazil",
                "Inria, France",
                "Federal University of Uberlândia, Brazil",
                "KTH, Sweden",
                "Federal University of Uberlândia, Brazil"
            ],
            "Abstract": "Well-designed and publicly available datasets of bugs are an invaluable asset to advance research fields such as fault localization and program repair. They allow directly and fairly comparison between competing techniques and also the replication of experiments. These datasets need to be deeply understood by researchers: the answer for questions like ``which bugs can my technique handle?&#39;&#39; and ``for which bugs is my technique effective?&#39;&#39; depends on the comprehension of properties related to bugs and their patches. However, such properties are usually not included in the datasets, and there is still no widely adopted methodology for characterizing bugs and patches. In this work, we deeply study 395 patches of the Defects4J dataset. Quantitative properties (patch size and spreading) were automatically extracted, whereas qualitative ones (repair actions and patterns) were manually extracted using a thematic analysis-based approach. We found that 1) the median size of Defects4J patches is four lines, and almost 30% of the patches contain only addition of lines; 2) 92% of the patches change only one file, and 38% has no spreading at all; 3) the top-3 most applied repair actions are addition of method calls, conditionals, and assignments, occurring in 77% of the patches; and 4) nine repair patterns were found for 95% of the patches, where the most prevalent, appearing in 43% of the patches, is on conditional blocks. These results are useful for researchers to perform advanced analysis on their techniques&#39; results based on Defects4J. Moreover, our set of properties can be used to characterize and compare different bug datasets.",
            "Award": "",
            "Badges": "",
            "Keywords": "Defects4J;  Patch Analysis;  Bug Fixes;  Repair Patterns;  Repair Actions"
        },
        {
            "Title": "Improving Developers Awareness of the Exception Handling Policy",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id137-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DTaiza+Montenegro%2C+Hugo+Melo%2C+Roberta+Coelho%2C+and+Eiji+Barbosa+%22Improving+Developers+Awareness+of+the+Exception+Handling+Policy%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Taiza Montenegro, Hugo Melo, Roberta Coelho, and Eiji Barbosa",
            "AffiliationsString": "Federal University of Rio Grande do Norte, Brazil",
            "Authors": [
                "Montenegro-Taiza-Federal-University-of-Rio-Grande-do-Norte--Brazil",
                "Melo-Hugo-Federal-University-of-Rio-Grande-do-Norte--Brazil",
                "Coelho-Roberta-Federal-University-of-Rio-Grande-do-Norte--Brazil",
                "Barbosa-Eiji-Federal-University-of-Rio-Grande-do-Norte--Brazil"
            ],
            "Affiliations": [
                "Federal University of Rio Grande do Norte, Brazil",
                "Federal University of Rio Grande do Norte, Brazil",
                "Federal University of Rio Grande do Norte, Brazil",
                "Federal University of Rio Grande do Norte, Brazil"
            ],
            "Abstract": "The exception handling policy of a system comprises the set of design rules that specify its exception handling behavior (how exceptions should be handled and thrown in a system). Such policy is usually undocumented and implicitly defined by the system architect. Developers are usually unaware of such rules and may think that by just sprinkling the code with catch-blocks they can adequately deal with the exceptional conditions of a system. As a consequence, the exception handling code once designed to make the program more reliable may become a source of faults (e.g., the uncaught exceptions are one of the main causes of crashes in current Java applications). To mitigate such problem, we propose Exception Policy Expert (EPE), a tool embedded in Eclipse IDE that warns developers about policy violations related to the code being edited. A case study performed in a real development context showed that the tool could indeed make the exception handling policy explicit to the developers during development.",
            "Award": "",
            "Badges": "",
            "Keywords": "exception handling;  exception handling policy;  Eclipse plug-in"
        },
        {
            "Title": "A Generalized Model for Visualizing Library Popularity, Adoption, and Diffusion within a Software Ecosystem",
            "Type": "RESEARCH TRACK",
            "Track": "Main Research",
            "Key": "saner18main-id166-p",
            "URL": "http%3A%2F%2Fscholar.google.com%2Fscholar%3Fq%3DRaula+Gaikovina+Kula%2C+Coen+De+Roover%2C+Daniel+M.+German%2C+Takashi+Ishio%2C+and+Katsuro+Inoue+%22A+Generalized+Model+for+Visualizing+Library+Popularity%2C+Adoption%2C+and+Diffusion+within+a+Software+Ecosystem%22",
            "URLvideo": "",
            "URLinfo": "",
            "URLmaterial": "",
            "DOI": "",
            "AuthorizerURL": "",
            "AuthorizerRef": "",
            "PersonsString": "Raula Gaikovina Kula, Coen De Roover, Daniel M. German, Takashi Ishio, and Katsuro Inoue",
            "AffiliationsString": "NAIST, Japan; Vrije Universiteit Brussel, Belgium; University of Victoria, Canada; Osaka University, Japan",
            "Authors": [
                "Kula-Raula-Gaikovina-NAIST--Japan",
                "De-Roover-Coen-Vrije-Universiteit-Brussel--Belgium",
                "German-Daniel-M.-University-of-Victoria--Canada",
                "Ishio-Takashi-NAIST--Japan",
                "Inoue-Katsuro-Osaka-University--Japan"
            ],
            "Affiliations": [
                "NAIST, Japan",
                "Vrije Universiteit Brussel, Belgium",
                "University of Victoria, Canada",
                "NAIST, Japan",
                "Osaka University, Japan"
            ],
            "Abstract": "The popularity of super repositories such as Maven Central and the CRAN is a testament to software reuse activities in both open-source and commercial projects alike. However, several studies have highlighted the risks and dangers brought about by application developers keeping dependencies on outdated library versions. Intelligent mining of super repositories could reveal hidden trends within the corresponding software ecosystem and thereby provide valuable insights for such dependency-related decisions. In this paper, we propose the Software Universe Graph (SUG) Model as a structured abstraction of the evolution of software systems and their library dependencies over time. To demonstrate the SUG&#39;s usefulness, we conduct an empirical study using 6,374 Maven artifacts and over 6,509 CRAN packages mined from their real-world ecosystems. Visualizations of the SUG model such as `library coexistence pairings&#39; and `dependents diffusion&#39; uncover popularity, adoption and diffusion patterns within each software ecosystem. Results show the Maven ecosystem as having a more conservative approach to dependency updating than the CRAN ecosystem.",
            "Award": "",
            "Badges": "",
            "Keywords": "Software Ecosystems;  Software Libraries;  Library Dependencies"
        }
    ],
    "Sessions": [
        {
            "Id": "sheith2Fah",
            "Title": "Main Research",
            "ShortTitle": "Main Research",
            "Type": "Main Research",
            "ShortType": "Main Research",
            "Key": "2018-03-20 09:00 Main Research",
            "Day": "2018-03-20",
            "Time": "09:00 - 10:00",
            "Location": "",
            "LocationIndex": "0",
            "ChairsString": "",
            "Chairs": [],
            "SponsoredBy": "",
            "Workshop": false,
            "Comment": "SANER18MAIN",
            "URL": "",
            "Abstract": "",
            "Items": [
                "saner18main-idk1-p",
                "saner18main-idk2-p",
                "saner18main-idk3-p",
                "saner18main-id6-p",
                "saner18main-id11-p",
                "saner18main-id23-p",
                "saner18main-id25-p",
                "saner18main-id117-p",
                "saner18main-id126-p",
                "saner18main-id158-p",
                "saner18main-id168-p",
                "saner18main-id75-p",
                "saner18main-id80-p",
                "saner18main-id169-p",
                "saner18main-id38-p",
                "saner18main-id44-p",
                "saner18main-id71-p",
                "saner18main-id116-p",
                "saner18main-id122-p",
                "saner18main-id135-p",
                "saner18main-id181-p",
                "saner18main-id5-p",
                "saner18main-id31-p",
                "saner18main-id51-p",
                "saner18main-id56-p",
                "saner18main-id69-p",
                "saner18main-id76-p",
                "saner18main-id90-p",
                "saner18main-id93-p",
                "saner18main-id129-p",
                "saner18main-id136-p",
                "saner18main-id192-p",
                "saner18main-id42-p",
                "saner18main-id46-p",
                "saner18main-id47-p",
                "saner18main-id62-p",
                "saner18main-id70-p",
                "saner18main-id74-p",
                "saner18main-id84-p",
                "saner18main-id108-p",
                "saner18main-id137-p",
                "saner18main-id166-p"
            ]
        }
    ],
    "People": [
        {
            "Name": "Wil M. P. van der Aalst",
            "Affiliation": "Eindhoven University of Technology, Netherlands",
            "Key": "Aalst-Wil-M.-P.-van-der-Eindhoven-University-of-Technology--Netherlands",
            "Id": "350573f356",
            "Code": "24ed5b1588eb9be086cf040843432e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Md Ahasanuzzaman",
            "Affiliation": "Queen's University, Canada",
            "Key": "Ahasanuzzaman-Md-Queen-s-University--Canada",
            "Id": "1cc56e5252",
            "Code": "01374b0744a4d645e0ac039a1882f5",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Rana Alkadhi",
            "Affiliation": "TU Munich, Germany",
            "Key": "Alkadhi-Rana-TU-Munich--Germany",
            "Id": "95c1c22ca1",
            "Code": "fc44c935d3c4f0c3fab5bb4f01db3f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "José Nelson Amaral",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Amaral-Jose-Nelson-University-of-Alberta--Canada",
            "Id": "455122d583",
            "Code": "8d78c8df0ddd0084e282697ba6be18",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Apostolos Ampatzoglou",
            "Affiliation": "University of Macedonia, Greece",
            "Key": "Ampatzoglou-Apostolos-University-of-Macedonia--Greece",
            "Id": "6066a14f65",
            "Code": "b896231bef29fdb8bc04d5d3bff779",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Giuliano Antoniol",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Antoniol-Giuliano-Polytechnique-Montreal--Canada",
            "Id": "35fd72ae74",
            "Code": "b6429d085f067d576050d708965b24",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Muhammad Asaduzzaman",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "Asaduzzaman-Muhammad-University-of-Saskatchewan--Canada",
            "Id": "3ec202b5de",
            "Code": "480fff66f992f655704d0ae3314d88",
            "Bio": "",
            "URLhp": "https://asaduzzamanparvez.wordpress.com/",
            "URLphoto": "",
            "URLgs": "https://scholar.google.com/citations?user=i6m_L90AAAAJ&hl=en&oi=ao",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Paris Avgeriou",
            "Affiliation": "University of Groningen, Netherlands",
            "Key": "Avgeriou-Paris-University-of-Groningen--Netherlands",
            "Id": "5f49ad0c90",
            "Code": "bc87b9dc9b094db10465ca29c19629",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Muhammad Ali Babar",
            "Affiliation": "University of Adelaide, Australia",
            "Key": "Babar-Muhammad-Ali-University-of-Adelaide--Australia",
            "Id": "47b677afb3",
            "Code": "bcdac4c26fb6366d91f5449c579a5f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Lingfeng Bao",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Bao-Lingfeng-Singapore-Management-University--Singapore",
            "Id": "040e5a40e9",
            "Code": "fb868cf263379f771dbaa439d1ab53",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eiji Barbosa",
            "Affiliation": "Federal University of Rio Grande do Norte, Brazil",
            "Key": "Barbosa-Eiji-Federal-University-of-Rio-Grande-do-Norte--Brazil",
            "Id": "dbab9064f7",
            "Code": "96c1e215ea74033559f14ddb76d67d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Leonard Peter Binamungu",
            "Affiliation": "University of Manchester, UK",
            "Key": "Binamungu-Leonard-Peter-University-of-Manchester--UK",
            "Id": "7dec2d624e",
            "Code": "1b3c3a5e13ee39c9f55b77c9eddcc7",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jan Bosch",
            "Affiliation": "Chalmers University of Technology, Sweden",
            "Key": "Bosch-Jan-Chalmers-University-of-Technology--Sweden",
            "Id": "4a5b6e01cb",
            "Code": "ee30ea53a098f2339995ece109b294",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mark G. J. van den Brand",
            "Affiliation": "Eindhoven University of Technology, Netherlands",
            "Key": "Brand-Mark-G.-J.-van-den-Eindhoven-University-of-Technology--Netherlands",
            "Id": "fa5c8a2b3e",
            "Code": "80c465baeed5e195cb08671cba80be",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Aline Brito",
            "Affiliation": "Federal University of Minas Gerais, Brazil",
            "Key": "Brito-Aline-Federal-University-of-Minas-Gerais--Brazil",
            "Id": "0eb33ea72c",
            "Code": "5e6080f8ee948d0f11ff4c11a53ccd",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Bernd Bruegge",
            "Affiliation": "TU Munich, Germany",
            "Key": "Bruegge-Bernd-TU-Munich--Germany",
            "Id": "07db740c9b",
            "Code": "c6d1110ec8b07c758d3b1eda6f58e7",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Joshua Charles Campbell",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Campbell-Joshua-Charles-University-of-Alberta--Canada",
            "Id": "e779c594e3",
            "Code": "d6ac02cff0fc971caba8cf5bec26c9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Bor-Yuh Evan Chang",
            "Affiliation": "University of Colorado at Boulder, USA",
            "Key": "Chang-Bor-Yuh-Evan-University-of-Colorado-at-Boulder--USA",
            "Id": "137c99ba2b",
            "Code": "332191eb693c86f68aa3c49449f089",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alexander Chatzigeorgiou",
            "Affiliation": "University of Macedonia, Greece",
            "Key": "Chatzigeorgiou-Alexander-University-of-Macedonia--Greece",
            "Id": "f348a511b6",
            "Code": "6484224677b8b500d104611fa5855a",
            "Bio": "Alexander Chatzigeorgiou is an associate professor of software engineering in the Department of Applied Informatics at the University of Macedonia, Thessaloniki, Greece. He received the Diploma in Electrical Engineering and the PhD degree in Computer Science from the Aristotle University of Thessaloniki, Greece, in 1996 and 2000, respectively. From 1997 to 1999 he was with Intracom S.A., Greece, as a telecommunications software designer. Since 2007, he is also a member of the teaching staff at the Hellenic Open University. His research interests include software quality, software maintenance, and software evolution analysis. He is a member of the IEEE and the Technical Chamber of Greece.",
            "URLhp": "http://users.uom.gr/~achat/index_en.html",
            "URLphoto": "http://users.uom.gr/~achat/pictures/alec.jpg",
            "URLgs": "https://scholar.google.gr/citations?user=D4ixXl8AAAAJ&hl=el&oi=ao",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hao Chen",
            "Affiliation": "University of California at Davis, USA",
            "Key": "Chen-Hao-University-of-California-at-Davis--USA",
            "Id": "2992403e23",
            "Code": "28ee723d4244295401dd5fe8e1a2f2",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xin Chen",
            "Affiliation": "Dalian University of Technology, China",
            "Key": "Chen-Xin-Dalian-University-of-Technology--China",
            "Id": "b75d85dd04",
            "Code": "65a6eb996e175db16ec019d305ccd2",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Zhenyu Chen",
            "Affiliation": "Nanjing University, China",
            "Key": "Chen-Zhenyu-Nanjing-University--China",
            "Id": "6defa95394",
            "Code": "41afe0c660259bcf6b08e24c48108e",
            "Bio": "Zhenyu Chen is currently a full professor at Software Institute of Nanjing University. He is the founder of mooctest.net and kikbug.net. His research interests focus on software analysis and testing. He has more than 80 publications at major venues including TOSEM, TSE, ICSE, FSE, ISSTA, ICST etc. He serves as an associate editor of IEEE Transactions on Reliability, guest editors of JSS and SP&#38;E. He has served as a PC co-chairs of TSA 2016, QRS 2016, QSIC 2013, AST2013, IWPD2012. He has nearly 20 patents and some of them have been used in Baidu, Alibaba, Huawei and so on.",
            "URLhp": "http://software.nju.edu.cn/zychen/",
            "URLphoto": "http://software.nju.edu.cn/zychen/pic/czy1.jpg",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Adelina Ciurumelea",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Ciurumelea-Adelina-University-of-Zurich--Switzerland",
            "Id": "3ccdd7359f",
            "Code": "ce1f959fc8b828b9b2676d41795b36",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Roberta Coelho",
            "Affiliation": "Federal University of Rio Grande do Norte, Brazil",
            "Key": "Coelho-Roberta-Federal-University-of-Rio-Grande-do-Norte--Brazil",
            "Id": "606dbcf79e",
            "Code": "b5fa1d1ba9d0338334f56cc2e40278",
            "Bio": "Roberta Coelho is a professor in the Department of Informatics and Applied Mathematics at Federal Univer- sity of Rio Grande do Norte, Brazil. She received an MSc dregree from Federal University of Pernambuco, Brazil, and a PhD degree in computer science from PUC-Rio in cooperation with Lancaster University. Her research interests include software testing, software dependability and exception handling.",
            "URLhp": "http://www.dimap.ufrn.br/~roberta/",
            "URLphoto": "",
            "URLgs": "https://scholar.google.com.br/citations?user=EEC5GEQAAAAJ&hl=en",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": "https://br.linkedin.com/in/roberta-coelho-72b29916"
        },
        {
            "Name": "Anna Corazza",
            "Affiliation": "Federico II University of Naples, Italy",
            "Key": "Corazza-Anna-Federico-II-University-of-Naples--Italy",
            "Id": "e0b328da6f",
            "Code": "0e3320144666feadf64ad798dd248a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Carmen Coviello",
            "Affiliation": "University of Basilicata, Italy",
            "Key": "Coviello-Carmen-University-of-Basilicata--Italy",
            "Id": "001beb2a72",
            "Code": "6e28e1f93011eadad4df0c6ccf4d4d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Daniel Alencar Da Costa",
            "Affiliation": "Queen's University, Canada",
            "Key": "Da-Costa-Daniel-Alencar-Queen-s-University--Canada",
            "Id": "02f83898fd",
            "Code": "47c878bc91767ed04cf7a79335a4d3",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jiarun Dai",
            "Affiliation": "Fudan University, China",
            "Key": "Dai-Jiarun-Fudan-University--China",
            "Id": "9b7093ba3c",
            "Code": "2f0ee95374d2f69069b22803be956a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Coen De Roover",
            "Affiliation": "Vrije Universiteit Brussel, Belgium",
            "Key": "De-Roover-Coen-Vrije-Universiteit-Brussel--Belgium",
            "Id": "d036268dd6",
            "Code": "bf6738d698ee3bba80c1717b907891",
            "Bio": "",
            "URLhp": "http://soft.vub.ac.be/~cderoove/",
            "URLphoto": "http://soft.vub.ac.be/~cderoove/images/Coen%20De%20Roover.jpg",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "https://twitter.com/oniroi",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "N. A. Diamantidis",
            "Affiliation": "Athens University of Economics and Business, Greece",
            "Key": "Diamantidis-N.-A.-Athens-University-of-Economics-and-Business--Greece",
            "Id": "e574a45a1b",
            "Code": "8186c2d1c45fdce24387c96387a6ed",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Georgios Digkas",
            "Affiliation": "University of Groningen, Netherlands",
            "Key": "Digkas-Georgios-University-of-Groningen--Netherlands",
            "Id": "e9c0c432a3",
            "Code": "46e664937d8d09a0e36ffc5a756efe",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Wensheng Dou",
            "Affiliation": "Institute of Software at Chinese Academy of Sciences, China",
            "Key": "Dou-Wensheng-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
            "Id": "b4a35b4e83",
            "Code": "0444bb9b5952375eb410194dbff301",
            "Bio": "Wensheng Dou received the doctoral degree in computer science and technology from the University of Chinese Academy of Sciences in 2015. He is an associate professor in the Institute of Software, Chinese Academy of Sciences (ISCAS). His research interests include end-user software engineering, program analysis, testing and debugging, cloud computing, and big data software engineering.",
            "URLhp": "http://www.tcse.cn/~wsdou/",
            "URLphoto": "http://www.tcse.cn/~wsdou/photo.jpg",
            "URLgs": "https://scholar.google.com/citations?user=NYHyagEAAAAJ&hl=en",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Thomas Durieux",
            "Affiliation": "Inria, France",
            "Key": "Durieux-Thomas-Inria--France",
            "Id": "8c0aecd7af",
            "Code": "63f4400a8ff74e5c38c4e75a335340",
            "Bio": "",
            "URLhp": "https://durieux.me",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Suzanne M Embury",
            "Affiliation": "University of Manchester, UK",
            "Key": "Embury-Suzanne-M-University-of-Manchester--UK",
            "Id": "9fe088ae16",
            "Code": "07c14fc96bb05b313be9a0e227a786",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Zhiyong Feng",
            "Affiliation": "Tianjin University, China",
            "Key": "Feng-Zhiyong-Tianjin-University--China",
            "Id": "2b22edf973",
            "Code": "1e7dbe0028efe2a8622ef56a4b03a6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Harald C. Gall",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Gall-Harald-C.-University-of-Zurich--Switzerland",
            "Id": "7874ce10d1",
            "Code": "6052a9ae50b2a754642935e896c270",
            "Bio": "",
            "URLhp": "http://www.ifi.uzh.ch/en/seal/people/gall.html",
            "URLphoto": "http://www.ifi.uzh.ch/en/seal/people/gall.html",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": "http://www.linkedin.com/in/haraldgall"
        },
        {
            "Name": "Chushu Gao",
            "Affiliation": "Institute of Software at Chinese Academy of Sciences, China",
            "Key": "Gao-Chushu-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
            "Id": "3f65ccf7fd",
            "Code": "8ac66fbede3a3ea03951b2dd1737f8",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Daniel M. German",
            "Affiliation": "University of Victoria, Canada",
            "Key": "German-Daniel-M.-University-of-Victoria--Canada",
            "Id": "f5a0afa08e",
            "Code": "7fdd82aa8e5cf9a218153fb2801558",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "E. A. Giakoumakis",
            "Affiliation": "Athens University of Economics and Business, Greece",
            "Key": "Giakoumakis-E.-A.-Athens-University-of-Economics-and-Business--Greece",
            "Id": "00fe40b0e1",
            "Code": "643c09a5c0cdd0c8110ded965f6352",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Georgios Gousios",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Gousios-Georgios-Delft-University-of-Technology--Netherlands",
            "Id": "8fec70620f",
            "Code": "05751ab908f3a43b714a0b59578527",
            "Bio": "",
            "URLhp": "http://gousios.org",
            "URLphoto": "http://gousios.gr/img/moi_full.jpg",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "https://twitter.com/gousiosg",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Giovanni Grano",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Grano-Giovanni-University-of-Zurich--Switzerland",
            "Id": "541664a84e",
            "Code": "81ec587c702cf6b2b83fd2f42b4184",
            "Bio": "I am a PhD Student at the Software Evolution and Architecture Lab ( s.e.a.l.) led by Harald Gall since November 2016. My research interests include Search Based Software Engineering, Software maintenance and evolution and Empirical Software Engineering.          I received my Master&#39;s Degree in 2015, from the University of Salerno (Italy), advised by Prof. Andrea De Lucia, defending a thesis on Search Based Software Testing.",
            "URLhp": "http://www.ifi.uzh.ch/en/seal/people/grano.html",
            "URLphoto": "https://image.ibb.co/hhYnLQ/oscar_pic.jpg",
            "URLgs": "https://scholar.google.ch/citations?user=UuGF6ScAAAAJ&hl=en",
            "URLmsa": "",
            "URLtw": "https://twitter.com/giograno90",
            "URLgp": "",
            "URLfb": "",
            "URLli": "https://www.linkedin.com/in/giovannigrano/"
        },
        {
            "Name": "Peter Gromov",
            "Affiliation": "JetBrains, Germany",
            "Key": "Gromov-Peter-JetBrains--Germany",
            "Id": "f78c814faf",
            "Code": "cce93e8373871733dedc32e5a31ea8",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jianbo Guo",
            "Affiliation": "Tsinghua University, China",
            "Key": "Guo-Jianbo-Tsinghua-University--China",
            "Id": "86ed84bd15",
            "Code": "febd773204e6f837e61836bb4591a9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Emitza Guzman",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Guzman-Emitza-University-of-Zurich--Switzerland",
            "Id": "897ddfdabb",
            "Code": "4a95ea66a573347dc08a2bc610f2dc",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jurriaan Hage",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Hage-Jurriaan-Utrecht-University--Netherlands",
            "Id": "b5d541df62",
            "Code": "a1989ac9689611be905c0e71d02579",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jun Han",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Han-Jun-Swinburne-University-of-Technology--Australia",
            "Id": "af9ff5be5f",
            "Code": "39b1e53bf6f98f8e3132840c21a65b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Zhuobing Han",
            "Affiliation": "Tianjin University, China",
            "Key": "Han-Zhuobing-Tianjin-University--China",
            "Id": "6c96b54003",
            "Code": "e8268c713ebfea2d022dbdf841a2db",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Tieke He",
            "Affiliation": "Nanjing University, China",
            "Key": "He-Tieke-Nanjing-University--China",
            "Id": "ab50546058",
            "Code": "bc927c9c821331c09bbbcafdc48107",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Abram Hindle",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Hindle-Abram-University-of-Alberta--Canada",
            "Id": "7b1f6fdce8",
            "Code": "20699cd7fb046dfc317a7b9d37d677",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "André Hora",
            "Affiliation": "Federal University of Mato Grosso do Sul, Brazil",
            "Key": "Hora-Andre-Federal-University-of-Mato-Grosso-do-Sul--Brazil",
            "Id": "884f9b29dd",
            "Code": "2bb3a97d9974603f496145914ddfe1",
            "Bio": "",
            "URLhp": "http://www.facom.ufms.br/~hora",
            "URLphoto": "http://www.facom.ufms.br/~hora/bootstrap/andre-hora.png",
            "URLgs": "https://scholar.google.com.br/citations?user=2fwfYtQAAAAJ&hl=en&oi=ao",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Md Arafat Hossain",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Hossain-Md-Arafat-Swinburne-University-of-Technology--Australia",
            "Id": "a7cfb1c775",
            "Code": "b1fc5149ba18ea81e9a52e3df57e8a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sirong Huang",
            "Affiliation": "Fudan University, China",
            "Key": "Huang-Sirong-Fudan-University--China",
            "Id": "8fad5f60b1",
            "Code": "46b792fd10fed80b6fdb5ec66cb319",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Tao Huang",
            "Affiliation": "Institute of Software at Chinese Academy of Sciences, China",
            "Key": "Huang-Tao-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
            "Id": "3ee2926848",
            "Code": "9e4cea1e363bc8b8e914ac2c852e9c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Katsuro Inoue",
            "Affiliation": "Osaka University, Japan",
            "Key": "Inoue-Katsuro-Osaka-University--Japan",
            "Id": "97223edb13",
            "Code": "8390e44f9d7b46f3f78388c9e73924",
            "Bio": "",
            "URLhp": "http://sel.ist.osaka-u.ac.jp/people/inoue/",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Takashi Ishio",
            "Affiliation": "NAIST, Japan",
            "Key": "Ishio-Takashi-NAIST--Japan",
            "Id": "3b152f4cef",
            "Code": "2ad2d69b3350a4a62372e75247fb87",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Nathan Jay",
            "Affiliation": "University of Wisconsin-Madison, USA",
            "Key": "Jay-Nathan-University-of-Wisconsin-Madison--USA",
            "Id": "a8f6b4f07e",
            "Code": "e58670bb5a38014cba9d8092df497a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Zhouyang Jia",
            "Affiliation": "National University of Defense Technology, China",
            "Key": "Jia-Zhouyang-National-University-of-Defense-Technology--China",
            "Id": "76d5a03408",
            "Code": "e8471f80173d01b298004eee15428b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "He Jiang",
            "Affiliation": "Dalian University of Technology, China",
            "Key": "Jiang-He-Dalian-University-of-Technology--China",
            "Id": "5843d07e63",
            "Code": "5c632d26368bed9400ebaf05022816",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jiaojiao Jiang",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Jiang-Jiaojiao-Swinburne-University-of-Technology--Australia",
            "Id": "dda594f794",
            "Code": "adfe3b080f79b63c1908fa107dc36e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Elmar Juergens",
            "Affiliation": "CQSE, Germany",
            "Key": "Juergens-Elmar-CQSE--Germany",
            "Id": "bf843a507c",
            "Code": "8d7a8ec78eabcc3de08db95473300d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Muhammad Ashad Kabir",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Kabir-Muhammad-Ashad-Swinburne-University-of-Technology--Australia",
            "Id": "39e877ffc5",
            "Code": "a6c6f1e01f8c03c308a6be37a8f38d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Chariton Karamitas",
            "Affiliation": "CENSUS, Greece",
            "Key": "Karamitas-Chariton-CENSUS--Greece",
            "Id": "550ae662ae",
            "Code": "5363efad49d655fe5bc291a887d98f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Deborah S. Katz",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Katz-Deborah-S.-Carnegie-Mellon-University--USA",
            "Id": "7248025876",
            "Code": "b3288b8f1b01a04c282331bce7f406",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Thanasis Kehagias",
            "Affiliation": "University of Thessaloniki, Greece",
            "Key": "Kehagias-Thanasis-University-of-Thessaloniki--Greece",
            "Id": "ed12ad29de",
            "Code": "6c903e148728047df4b1d77d47ab1c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Nikolaos Konstantinou",
            "Affiliation": "University of Manchester, UK",
            "Key": "Konstantinou-Nikolaos-University-of-Manchester--UK",
            "Id": "46dca13bc8",
            "Code": "cf3ef31c132d39461e14ec48742855",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Raula Gaikovina Kula",
            "Affiliation": "NAIST, Japan",
            "Key": "Kula-Raula-Gaikovina-NAIST--Japan",
            "Id": "cc3667f876",
            "Code": "7a8ae809c4f93fb32d349450c832f7",
            "Bio": "",
            "URLhp": "http://sel.ist.osaka-u.ac.jp/people/raula-k/",
            "URLphoto": "http://sel.ist.osaka-u.ac.jp/people/raula-k/images/demo/profile.jpg",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Uirá Kulesza",
            "Affiliation": "Federal University of Rio Grande do Norte, Brazil",
            "Key": "Kulesza-Uira-Federal-University-of-Rio-Grande-do-Norte--Brazil",
            "Id": "2291511304",
            "Code": "7c882e04f2fec22cff01f08b399e01",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Patricia Lago",
            "Affiliation": "Vrije Universiteit Amsterdam, Netherlands",
            "Key": "Lago-Patricia-Vrije-Universiteit-Amsterdam--Netherlands",
            "Id": "dc43b29653",
            "Code": "c41ba030b9e76d22b76cf4dd7b2018",
            "Bio": "",
            "URLhp": "www.cs.vu.nl/~patricia",
            "URLphoto": "https://scholar.google.com/citations?view_op=view_photo&user=q5vgzKgAAAAJ&citpid=2",
            "URLgs": "https://scholar.google.com/citations?hl=en&user=q5vgzKgAAAAJ&pagesize=100&view_op=list_works",
            "URLmsa": "",
            "URLtw": "https://twitter.com/patricia_lago",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Marc-André Laverdière",
            "Affiliation": "Tata Consultancy Services, Canada",
            "Key": "Laverdiere-Marc-Andre-Tata-Consultancy-Services--Canada",
            "Id": "d4df336943",
            "Code": "4d36dd21a81a38acaa06604e51c01d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "https://scholar.google.ca/citations?user=R96pkjYAAAAJ&hl=en",
            "URLmsa": "",
            "URLtw": "https://twitter.com/@malaverdiere",
            "URLgp": "https://plus.google.com/+MarcAndr%C3%A9Laverdi%C3%A8re",
            "URLfb": "",
            "URLli": "https://www.linkedin.com/in/malaverdiere/"
        },
        {
            "Name": "Bui Tien Duy Le",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Le-Bui-Tien-Duy-Singapore-Management-University--Singapore",
            "Id": "823cc3e043",
            "Code": "9f4c7427f60063ffe821a0c2dc9cea",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Maikel Leemans",
            "Affiliation": "Eindhoven University of Technology, Netherlands",
            "Key": "Leemans-Maikel-Eindhoven-University-of-Technology--Netherlands",
            "Id": "cc5c7c5462",
            "Code": "8499f0203c185604f57e96d21294aa",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Claire Le Goues",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Le-Goues-Claire-Carnegie-Mellon-University--USA",
            "Id": "ea24b3a4eb",
            "Code": "2ca8b67d0dfa3131d36c231d37f2f1",
            "Bio": "",
            "URLhp": "http://www.cs.cmu.edu/~clegoues",
            "URLphoto": "http://www.cs.cmu.edu/~clegoues/images/claire_headshot.jpg",
            "URLgs": "https://scholar.google.ch/citations?user=Cmr9ljkAAAAJ&hl=en",
            "URLmsa": "",
            "URLtw": "https://twitter.com/clegoues",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Junyi Li",
            "Affiliation": "Fudan University, China",
            "Key": "Li-Junyi-Fudan-University--China",
            "Id": "c2aea1ede7",
            "Code": "ec953503138bcd1c634c07272e6ec6",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Shanshan Li",
            "Affiliation": "National University of Defense Technology, China",
            "Key": "Li-Shanshan-National-University-of-Defense-Technology--China",
            "Id": "b9a1d91be2",
            "Code": "0221f9b14bce19cef3649f93f7ed28",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xiaochen Li",
            "Affiliation": "Dalian University of Technology, China",
            "Key": "Li-Xiaochen-Dalian-University-of-Technology--China",
            "Id": "e1d3096ce8",
            "Code": "6162a2897c84c181b84d01c785bb57",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xiaohong Li",
            "Affiliation": "Tianjin University, China",
            "Key": "Li-Xiaohong-Tianjin-University--China",
            "Id": "9f830582cd",
            "Code": "67e09a0785e94b9f5f2c9687b56f85",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Yanhui Li",
            "Affiliation": "Nanjing University, China",
            "Key": "Li-Yanhui-Nanjing-University--China",
            "Id": "d605be6ce8",
            "Code": "0964d14c55264b00076b1c35f438dc",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Peng Liang",
            "Affiliation": "Wuhan University, China",
            "Key": "Liang-Peng-Wuhan-University--China",
            "Id": "f136c5c56b",
            "Code": "9710a0b35b0dea605364c96d6bc98a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xiangke Liao",
            "Affiliation": "National University of Defense Technology, China",
            "Key": "Liao-Xiangke-National-University-of-Defense-Technology--China",
            "Id": "9537072461",
            "Code": "11a18df5775e5877bccd5db825dd34",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hongtao Liu",
            "Affiliation": "Tianjin University, China",
            "Key": "Liu-Hongtao-Tianjin-University--China",
            "Id": "d3d86206b5",
            "Code": "4e225eddb75b18a91dca87c493fa2d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jin Liu",
            "Affiliation": "Wuhan University, China",
            "Key": "Liu-Jin-Wuhan-University--China",
            "Id": "7130b95331",
            "Code": "55035cbc176cd282696e1a6e6301ed",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Wenjian Liu",
            "Affiliation": "Fudan University, China",
            "Key": "Liu-Wenjian-Fudan-University--China",
            "Id": "13a54a609a",
            "Code": "207fe976796d8d0c7d0a3993d66384",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xiaodong Liu",
            "Affiliation": "National University of Defense Technology, China",
            "Key": "Liu-Xiaodong-National-University-of-Defense-Technology--China",
            "Id": "056b1128e2",
            "Code": "dcf8b0ba82bbb1b1903a8cae100a7f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xuliang Liu",
            "Affiliation": "Shanghai Jiao Tong University, China",
            "Key": "Liu-Xuliang-Shanghai-Jiao-Tong-University--China",
            "Id": "6466d2f62f",
            "Code": "d0bed674df171d83001aee3d36f233",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Yibin Liu",
            "Affiliation": "Nanjing University, China",
            "Key": "Liu-Yibin-Nanjing-University--China",
            "Id": "d8f48f2728",
            "Code": "e3af726208e865044e82ce36cbdf80",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Yunhuai Liu",
            "Affiliation": "Peking University, China",
            "Key": "Liu-Yunhuai-Peking-University--China",
            "Id": "00db691c5a",
            "Code": "c904ecd7e204621a62e73e6e1fe47b",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "David Lo",
            "Affiliation": "Singapore Management University, Singapore",
            "Key": "Lo-David-Singapore-Management-University--Singapore",
            "Id": "f377767c2d",
            "Code": "584bd4c2590498660645c2e72bce8a",
            "Bio": "I&#39;m an associate professor in School of Information Systems, Singapore Management University. My research interest include software specification mining/protocol inference, mining software repositories, program analysis, software testing and automated debugging. In general, I&#39;m interested on how software can be better developed, better maintained, better tested and better debugged through an analysis of the wealth of software data currently available.",
            "URLhp": "http://www.mysmu.edu/faculty/davidlo/",
            "URLphoto": "http://www.mysmu.edu/faculty/davidlo/PhotoDLo-small.JPG",
            "URLgs": "https://scholar.google.com/citations?user=Ra4bt-oAAAAJ",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mircea Lungu",
            "Affiliation": "University of Bern, Switzerland",
            "Key": "Lungu-Mircea-University-of-Bern--Switzerland",
            "Id": "c016a98a52",
            "Code": "24ae603c29d914bd7e9387a57d115d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xiapu Luo",
            "Affiliation": "Hong Kong Polytechnic University, China",
            "Key": "Luo-Xiapu-Hong-Kong-Polytechnic-University--China",
            "Id": "52570140a7",
            "Code": "b49803f36b5bda7f45b1ed126a47b5",
            "Bio": "",
            "URLhp": "http://www4.comp.polyu.edu.hk/~csxluo/",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Christian Macho",
            "Affiliation": "University of Klagenfurt, Austria",
            "Key": "Macho-Christian-University-of-Klagenfurt--Austria",
            "Id": "e5bd9e8467",
            "Code": "3fcaea2e175511bd15cc75c976683a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Fernanda Madeiral",
            "Affiliation": "Federal University of Uberlândia, Brazil",
            "Key": "Madeiral-Fernanda-Federal-University-of-Uberlandia--Brazil",
            "Id": "57c10a906c",
            "Code": "bbceb7fdba6d1c27e5891bacfdb086",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Marcelo de Almeida Maia",
            "Affiliation": "Federal University of Uberlândia, Brazil",
            "Key": "Maia-Marcelo-de-Almeida-Federal-University-of-Uberlandia--Brazil",
            "Id": "cdf439f6db",
            "Code": "18ef21459b99ad6a44b8e07b8a4a7d",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ivano Malavolta",
            "Affiliation": "Vrije Universiteit Amsterdam, Netherlands",
            "Key": "Malavolta-Ivano-Vrije-Universiteit-Amsterdam--Netherlands",
            "Id": "e322302255",
            "Code": "ef452a12ab800787a2ec30db57b6bb",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Alessandro Marchetto",
            "Affiliation": "n.n., n.n.",
            "Key": "Marchetto-Alessandro-n.n.--n.n.",
            "Id": "9376bce939",
            "Code": "9a1cb02cded6904fc2b892f9f43db7",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Shane McIntosh",
            "Affiliation": "McGill University, Canada",
            "Key": "McIntosh-Shane-McGill-University--Canada",
            "Id": "2f2958b380",
            "Code": "99ffb81209749889a39f9722a4e311",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hugo Melo",
            "Affiliation": "Federal University of Rio Grande do Norte, Brazil",
            "Key": "Melo-Hugo-Federal-University-of-Rio-Grande-do-Norte--Brazil",
            "Id": "50ed7b50a9",
            "Code": "d9ee0221124d58c5100e2d3869df21",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Ettore Merlo",
            "Affiliation": "Polytechnique Montréal, Canada",
            "Key": "Merlo-Ettore-Polytechnique-Montreal--Canada",
            "Id": "919c9830e1",
            "Code": "1a876765cbe622558a6de47f2f3553",
            "Bio": "",
            "URLhp": "http://www.polymtl.ca/recherche/rc/en/professeurs/details.php?NoProf=123",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Barton P. Miller",
            "Affiliation": "University of Wisconsin-Madison, USA",
            "Key": "Miller-Barton-P.-University-of-Wisconsin-Madison--USA",
            "Id": "6652dfcd99",
            "Code": "ec35057b98babb43d6c6614634597b",
            "Bio": "Barton Miller is Professor of Computer Sciences at the University of Wisconsin, Madison. He directs the Paradyn Tools project, which is investigating program scalability and binary program analysis and instrumentation technologies for use in HPC, systems design, and cyber-security. Miller is Chief Scientist of the DHS-funded Software Assurance Marketplace (SWAMP) research center, a joint effort between the Morgridge Institute of Research, University of Wisconsin Computer Sciences Department, Indiana University, and the University of Illinois. He also directs the vulnerability assessment and training program for the NSF Cybersecurity Center of Excellence, the Center for Trustworthy Scientific Cyberinfrastructure. He also co-directs the MIST software vulnerability assessment project in collaboration with his colleagues at the Autonomous University of Barcelona. His research interests include tools for high-performance computing systems, binary code analysis and instrumentation, computer security, and scalable distributed systems.          In 1988, Miller founded the field of Fuzz random software testing, which is the foundation of many security and software engineering disciplines. In 1992, Miller (working with his then-student, Prof. Jeffrey Hollingsworth), founded the field of dynamic binary code instrumentation and coined the term &quot;dynamic instrumentation&quot;.          Miller co-chaired Shonan Meetings on &quot;Grid and Cloud Security: A Confluence&quot; in 2012 and 2014, co-chaired the Supercomputing 2008 Tutorials Technical Program and Supercomputing 2003 Papers Technical Program. He was Program co-Chair of the 1998 ACM/SIGMETRICS Symposium on Parallel and Distributed Tools, and General Chair of the 1996 ACM/SIGMETRICS Symposium on Parallel and Distributed Tools. He was co-chair of the 2009 Dagstuhl Seminar on Program Development for Extreme-Scale Computing, co-chaired the 2007 Dagstuhl Seminar on Code Instrumentation &#38; Modeling for Parallel Performance Analysis and the 2005 Dagstuhl Seminar on Automated Performance Analysis (as well as several previous Dagstuhl seminars). He also twice chaired the ACM/ONR Workshop on Parallel and Distributed Debugging. Miller has been on the editorial board of IEEE Transactions on Parallel Distributed Systems, the International Journal of Parallel Processing, Concurrency and Computation Practice &#38; Experience, and the Journal of Computing Systems. Miller has chaired numerous other workshops and has been on a variety of conference program committees. He is also a member of the IEEE Technical Committee on Parallel Processing.          Miller was the chair of the IDA Center for Computing Sciences Program Review Committee, was a member of the Los Alamos National Laboratory Computing, Communications and Networking Division Review Committee, and has been on the U.S. Secret Service Electronic Crimes Task Force (Chicago Area), the Advisory Committee for Tuskegee University&#39;s High Performance Computing Program, and the Advisory Board for the International Summer Institute on Parallel Computer Architectures, Languages, and Algorithms in Prague. Miller is an active participant in the European Union APART performance tools initiative.          Miller received his Ph.D. degree in Computer Science from the University of California, Berkeley in 1984. He is a Fellow of the ACM.",
            "URLhp": "http://www.cs.wisc.edu/~bart/",
            "URLphoto": "http://pages.cs.wisc.edu/~bart/Bart-May2011.jpg",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Manishankar Mondal",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "Mondal-Manishankar-University-of-Saskatchewan--Canada",
            "Id": "9b729a8b04",
            "Code": "825288750dd90f8b3e501d3ec353df",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Martin Monperrus",
            "Affiliation": "KTH, Sweden",
            "Key": "Monperrus-Martin-KTH--Sweden",
            "Id": "6db47b6716",
            "Code": "b1f412d6a444cdf437de375fd8e66f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Taiza Montenegro",
            "Affiliation": "Federal University of Rio Grande do Norte, Brazil",
            "Key": "Montenegro-Taiza-Federal-University-of-Rio-Grande-do-Norte--Brazil",
            "Id": "aef9546973",
            "Code": "d38c63b9aa8495db67495c31c8c28c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sergio Mover",
            "Affiliation": "University of Colorado at Boulder, USA",
            "Key": "Mover-Sergio-University-of-Colorado-at-Boulder--USA",
            "Id": "5d9127ea7b",
            "Code": "575ba328271bd4c9d7317144a729de",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Edmilson Campos Neto",
            "Affiliation": "Instituto Federal do Rio Grande do Norte, Brazil",
            "Key": "Neto-Edmilson-Campos-Instituto-Federal-do-Rio-Grande-do-Norte--Brazil",
            "Id": "8c8850af55",
            "Code": "361fbe50e0a10cb6f0a131b011f4cf",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Anh Tuan Nguyen",
            "Affiliation": "n.n., n.n.",
            "Key": "Nguyen-Anh-Tuan-n.n.--n.n.",
            "Id": "bb0b3374e0",
            "Code": "6e572d880d71f9bcb1cd623b7af9b4",
            "Bio": "He finished his BEng and MSc program at Hanoi University of Science and Technology.     He was awarded PhD degree in ECE by Iowa State University in May, 2016.     He is now working at Fossil/Misfit in Vietnam, focusing on applications of deep learning for real-time computer vision tasks.",
            "URLhp": "http://home.engineering.iastate.edu/~anhnt/",
            "URLphoto": "https://scholar.google.com.vn/citations?view_op=medium_photo&user=gq6kTEYAAAAJ&citpid=2",
            "URLgs": "https://scholar.google.com.vn/citations?user=gq6kTEYAAAAJ&hl=vi",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "https://www.facebook.com/tanhnguyena",
            "URLli": "https://www.linkedin.com/in/anh-nguyen-ba386676"
        },
        {
            "Name": "Hoan Anh Nguyen",
            "Affiliation": "Iowa State University, USA",
            "Key": "Nguyen-Hoan-Anh-Iowa-State-University--USA",
            "Id": "e2d3e25bd6",
            "Code": "9703191c334c0220bc4da88e1138b4",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hung Viet Nguyen",
            "Affiliation": "Google, USA",
            "Key": "Nguyen-Hung-Viet-Google--USA",
            "Id": "02142abc36",
            "Code": "9ca8014ad1cd8c8476ffa3307b1053",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Tien N. Nguyen",
            "Affiliation": "University of Texas at Dallas, USA",
            "Key": "Nguyen-Tien-N.-University-of-Texas-at-Dallas--USA",
            "Id": "c85aaa6782",
            "Code": "a7ceafd0de953dd87592e27f7bc650",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Trong Nguyen",
            "Affiliation": "Iowa State University, USA",
            "Key": "Nguyen-Trong-Iowa-State-University--USA",
            "Id": "4e6fb28cbf",
            "Code": "25daa80bb7a435565edfd287199738",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Manuel Nonnenmacher",
            "Affiliation": "TU Munich, Germany",
            "Key": "Nonnenmacher-Manuel-TU-Munich--Germany",
            "Id": "7f6950af37",
            "Code": "eb5ba1a51cea5a39e7efeb136d0b82",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Niels Groot Obbink",
            "Affiliation": "Vrije Universiteit Amsterdam, Netherlands",
            "Key": "Obbink-Niels-Groot-Vrije-Universiteit-Amsterdam--Netherlands",
            "Id": "8ce6ea54a6",
            "Code": "214c41ffa1576824c07870a480fc3f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Rhys Olsen",
            "Affiliation": "University of Colorado at Boulder, USA",
            "Key": "Olsen-Rhys-University-of-Colorado-at-Boulder--USA",
            "Id": "62f34c2310",
            "Code": "bf8823abb7f7bb4c26d9ce84e82318",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Fabio Palomba",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Palomba-Fabio-Delft-University-of-Technology--Netherlands",
            "Id": "86c470898d",
            "Code": "d4ae71194ee01c984959576f581ea9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Fabio Palomba",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Palomba-Fabio-University-of-Zurich--Switzerland",
            "Id": "47b72dea50",
            "Code": "6147e323cf8cbdb2a0aa66c63f3efa",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Katerina Paltoglou",
            "Affiliation": "Athens University of Economics and Business, Greece",
            "Key": "Paltoglou-Katerina-Athens-University-of-Economics-and-Business--Greece",
            "Id": "c761967641",
            "Code": "6d64c8aaf0980a8a200736bb25239e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sebastiano Panichella",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Panichella-Sebastiano-University-of-Zurich--Switzerland",
            "Id": "51acaf8b77",
            "Code": "b1450558ad84a5075b3763b36a1757",
            "Bio": "Sebastiano Panichella was born in Isernia (Italy), he received (cum laude) the Laurea in Computer Science from the University of Salerno (Italy) in 2010 defending a thesis on IR-based Traceability Recovery, advised by Prof. Andrea De Lucia.           He received the PhD in Computer Science from the University of Sannio (Department of Engineering) in 2014 defending the thesis entitled &#39;&#39;Supporting Newcomers in Open Source Software Development Projects&#39;&#39; (http://dx.doi.org/10.1109/ICSM.2015.7332519) .           Currently he is a Research Associate at University of Zurich working in the Software Evolution and Architecture Lab of Prof. Harald Gall. He is a member of IEEE. His research interests include Mining Software Repositories, Code Review, IR-based Traceability Recovery, Machine Learning (applied to SE problems), Textual Analysis, Continuos Delivery (with special attention to Continuos Integration Problems), Software maintenance and evolution and Empirical Software Engineering. For more information have a look on his CV (https://www.scribd.com/document/330612875/Sebastiano-Panichella-CV).          His research is funded by two Swiss National Science Foundation Grants.",
            "URLhp": "http://www.ifi.uzh.ch/seal/people/panichella.html",
            "URLphoto": "http://www.ifi.uzh.ch/seal/people/panichella/s_panichella.png",
            "URLgs": "https://scholar.google.ch/citations?user=HiNuBFgAAAAJ&hl=it&oi=ao",
            "URLmsa": "",
            "URLtw": "https://twitter.com/spanichella?lang=it",
            "URLgp": "",
            "URLfb": "https://www.facebook.com/sebastiano.panichella",
            "URLli": "https://www.linkedin.com/profile/view?id=AAIAAAgtQtcBXPwDtXdkadeASeM4RgjGP3wo0l4&trk=nav_responsive_tab_profile_pic"
        },
        {
            "Name": "Dhvani Patel",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Patel-Dhvani-University-of-Alberta--Canada",
            "Id": "71e1064dec",
            "Code": "67548cf128eb3f6a96219aaf3c772f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xin Peng",
            "Affiliation": "Fudan University, China",
            "Key": "Peng-Xin-Fudan-University--China",
            "Id": "a5feaa61cb",
            "Code": "d916a703288e0bc9c606006252dc45",
            "Bio": "Xin Peng is a full professor of the School of Computer Science at Fudan University, China. He received his BSc degree and PhD degree from Fudan University in 2001 and 2006 respectively. His research interests include self-adaptive system, mobile and cloud computing, software maintenance and evolution. He serves     on several program committees of prestigious international conferences in software engineering area such as ICSM, RE, ICSR, SPLC, ICPC. His work won the Best Paper Award at the 27th International Conference on Software Maintenance (ICSM11).",
            "URLhp": "http://www.se.fudan.edu.cn/pengxin/",
            "URLphoto": "http://www.se.fudan.edu.cn/getPhoto?userCode=pengxin",
            "URLgs": "http://scholar.google.com/citations?user=wATYGXEAAAAJ&hl=en",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": "https://www.linkedin.com/in/xin-peng-09641a15"
        },
        {
            "Name": "Hung Phan",
            "Affiliation": "Iowa State University, USA",
            "Key": "Phan-Hung-Iowa-State-University--USA",
            "Id": "9526526e8c",
            "Code": "89bc7416e274f2eaa8708901a38f5f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Martin Pinzger",
            "Affiliation": "University of Klagenfurt, Austria",
            "Key": "Pinzger-Martin-University-of-Klagenfurt--Austria",
            "Id": "a6b578ee90",
            "Code": "d220537e0f88199b2b589c1f34ac28",
            "Bio": "",
            "URLhp": "http://serg.aau.at/bin/view/MartinPinzger/",
            "URLphoto": "http://serg.aau.at/pub/MartinPinzger/WebHome/MartinDec2013_bw_small.jpg",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sebastian Proksch",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Proksch-Sebastian-University-of-Zurich--Switzerland",
            "Id": "2f37144cbf",
            "Code": "1fe688bb804446558f599ab1dbfc83",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Simone Romano",
            "Affiliation": "University of Basilicata, Italy",
            "Key": "Romano-Simone-University-of-Basilicata--Italy",
            "Id": "e04cf97d65",
            "Code": "c972f214d2af99ddfbc2aa7055b595",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Chanchal K. Roy",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "Roy-Chanchal-K.-University-of-Saskatchewan--Canada",
            "Id": "57812d6e89",
            "Code": "121910bf272aefcd8ab27e52e02e2c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jason Ruchti",
            "Affiliation": "GrammaTech, USA",
            "Key": "Ruchti-Jason-GrammaTech--USA",
            "Id": "90cbdf1a74",
            "Code": "8ddd78a3390cc51e612fc177c9b24a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Sriram Sankaranarayanan",
            "Affiliation": "University of Colorado at Boulder, USA",
            "Key": "Sankaranarayanan-Sriram-University-of-Colorado-at-Boulder--USA",
            "Id": "1ace65967d",
            "Code": "561857708fefbb253a55b872d6aaaa",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eddie Antonio Santos",
            "Affiliation": "University of Alberta, Canada",
            "Key": "Santos-Eddie-Antonio-University-of-Alberta--Canada",
            "Id": "76d77f045f",
            "Code": "b642c7840bf141b07cf4d15cb591c1",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Giuseppe Scanniello",
            "Affiliation": "University of Basilicata, Italy",
            "Key": "Scanniello-Giuseppe-University-of-Basilicata--Italy",
            "Id": "0ba1159e81",
            "Code": "c5ba38088e2a969da4ddc072bae264",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jean-Guy Schneider",
            "Affiliation": "Swinburne University of Technology, Australia",
            "Key": "Schneider-Jean-Guy-Swinburne-University-of-Technology--Australia",
            "Id": "8f260c3626",
            "Code": "72ef6d8a3336315c642130bf1ed5af",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Kevin A. Schneider",
            "Affiliation": "University of Saskatchewan, Canada",
            "Key": "Schneider-Kevin-A.-University-of-Saskatchewan--Canada",
            "Id": "205ddba4a8",
            "Code": "b5340b6508ffdc85a3ca982f8aa5cc",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eric Schulte",
            "Affiliation": "GrammaTech, USA",
            "Key": "Schulte-Eric-GrammaTech--USA",
            "Id": "6e6c3ab8a0",
            "Code": "2cf097d897486b7be28b8c898ed6ea",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Gian Luca Scoccia",
            "Affiliation": "Gran Sasso Science Institute, Italy",
            "Key": "Scoccia-Gian-Luca-Gran-Sasso-Science-Institute--Italy",
            "Id": "47a4b40f64",
            "Code": "21e0b3c94f6f06fe464dcb8f29778c",
            "Bio": "",
            "URLhp": "http://cs.gssi.infn.it/people/scoccia/",
            "URLphoto": "http://cs.gssi.infn.it/wp-content/uploads/gianluca.png",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": "https://it.linkedin.com/in/gianlucascoccia"
        },
        {
            "Name": "Victor Sobreira",
            "Affiliation": "Federal University of Uberlândia, Brazil",
            "Key": "Sobreira-Victor-Federal-University-of-Uberlandia--Brazil",
            "Id": "46be765d18",
            "Code": "5bca501bae7fa2e05eb6eb5d3c9ee2",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Mauricio Soto",
            "Affiliation": "Carnegie Mellon University, USA",
            "Key": "Soto-Mauricio-Carnegie-Mellon-University--USA",
            "Id": "a6b7f0c8f2",
            "Code": "5a581bf3eba33daddf0057ccecefa9",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Marco Tulio Valente",
            "Affiliation": "Federal University of Minas Gerais, Brazil",
            "Key": "Valente-Marco-Tulio-Federal-University-of-Minas-Gerais--Brazil",
            "Id": "cda7fdddf8",
            "Code": "80e697e46d21b95f3a09e6eaade687",
            "Bio": "Marco Tulio Valente received his PhD degree in Computer Science from the Federal University of Minas Gerais, Brazil (2002), where he is an assistant professor in the Computer Science Department, since 2010. His research interests include software architecture and modularity, software maintenance and evolution, and software quality analysis. He is a “Researcher I-D” of the Brazilian National Research Council (CNPq). He also holds a “Researcher from Minas Gerais State” scholarship, from FAPEMIG. Valente has co-authored more than 100 0 refereed papers in international conferences and journals. Currently, he heads the Applied Software Engineering Research Group (ASERG), at DCC/UFMG. Contact him at mtov@dcc.ufmg.br, or visit http://aserg.labsoft.dcc.ufmg.br/",
            "URLhp": "http://homepages.dcc.ufmg.br/~mtov/",
            "URLphoto": "http://homepages.dcc.ufmg.br/~mtov/mtov7.jpg",
            "URLgs": "https://scholar.google.com.br/citations?user=0vFkqMIAAAAJ",
            "URLmsa": "",
            "URLtw": "https://twitter.com/mtov",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Eduard Van der Bent",
            "Affiliation": "Utrecht University, Netherlands",
            "Key": "Van-der-Bent-Eduard-Utrecht-University--Netherlands",
            "Id": "a584d18c93",
            "Code": "a8dc980838f3e84a2293ddf54ae5e0",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Carmine Vassallo",
            "Affiliation": "University of Zurich, Switzerland",
            "Key": "Vassallo-Carmine-University-of-Zurich--Switzerland",
            "Id": "cc4cdfad95",
            "Code": "c8e57873000b6fdaf5d2f889790c87",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Steve Versteeg",
            "Affiliation": "CA Technologies, Australia",
            "Key": "Versteeg-Steve-CA-Technologies--Australia",
            "Id": "c145a6bcd3",
            "Code": "bf00c6fa9a9a7b9a7a9efd46670179",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Joost Visser",
            "Affiliation": "Software Improvement Group, Netherlands",
            "Key": "Visser-Joost-Software-Improvement-Group--Netherlands",
            "Id": "d3d39714f6",
            "Code": "a4037b688f7ea1521a83af0a229a04",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Shuo Wang",
            "Affiliation": "Institute of Software at Chinese Academy of Sciences, China",
            "Key": "Wang-Shuo-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
            "Id": "28a597df9b",
            "Code": "eaa6847fa4d20183ff3486ebbb095e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Jun Wei",
            "Affiliation": "Institute of Software at Chinese Academy of Sciences, China",
            "Key": "Wei-Jun-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
            "Id": "0f0809334b",
            "Code": "78481a747de047cea7a00b9854138a",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Laerte Xavier",
            "Affiliation": "Federal University of Minas Gerais, Brazil",
            "Key": "Xavier-Laerte-Federal-University-of-Minas-Gerais--Brazil",
            "Id": "dd4376b087",
            "Code": "65c11ca52408e7d69e1523e0458640",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Bing Xie",
            "Affiliation": "Peking University, China",
            "Key": "Xie-Bing-Peking-University--China",
            "Id": "b457df2497",
            "Code": "57b02fb9ddce4fec5e3a26e76389e4",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Zhenchang Xing",
            "Affiliation": "Australian National University, Australia",
            "Key": "Xing-Zhenchang-Australian-National-University--Australia",
            "Id": "6792ff386f",
            "Code": "224c4e41102c8e4daad8fd8b8b7fb1",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Baowen Xu",
            "Affiliation": "Nanjing University, China",
            "Key": "Xu-Baowen-Nanjing-University--China",
            "Id": "061e3015b9",
            "Code": "eccf7e60ba0b71ab76c0ca8e76142c",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Liang Xu",
            "Affiliation": "Institute of Software at Chinese Academy of Sciences, China",
            "Key": "Xu-Liang-Institute-of-Software-at-Chinese-Academy-of-Sciences--China",
            "Id": "9adebaa50a",
            "Code": "603527200b85410cd89587b75bc5c0",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Yongrui Xu",
            "Affiliation": "Wuhan University, China",
            "Key": "Xu-Yongrui-Wuhan-University--China",
            "Id": "12961c1211",
            "Code": "e99737219639ee04cad3afff1b4800",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Zhou Xu",
            "Affiliation": "Wuhan University, China",
            "Key": "Xu-Zhou-Wuhan-University--China",
            "Id": "f882fc9590",
            "Code": "1c0daf8a78016a9f56a00423a471db",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Bo Yang",
            "Affiliation": "North China University of Technology, China",
            "Key": "Yang-Bo-North-China-University-of-Technology--China",
            "Id": "fb8cf6b947",
            "Code": "eb7760a352b44a89a4b5ae437c6b65",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Min Yang",
            "Affiliation": "Fudan University, China",
            "Key": "Yang-Min-Fudan-University--China",
            "Id": "a663049f6a",
            "Code": "c4e47f089b9f6af684c6e3671eb73e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Zhemin Yang",
            "Affiliation": "Fudan University, China",
            "Key": "Yang-Zhemin-Fudan-University--China",
            "Id": "48beeba27d",
            "Code": "f65d4fa6da6e91499bf231bd2f3ddb",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Vassilis E. Zafeiris",
            "Affiliation": "Athens University of Economics and Business, Greece",
            "Key": "Zafeiris-Vassilis-E.-Athens-University-of-Economics-and-Business--Greece",
            "Id": "486053b21a",
            "Code": "97a48a8aff88a82a0dc3d0eb72dd7f",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Andy Zaidman",
            "Affiliation": "Delft University of Technology, Netherlands",
            "Key": "Zaidman-Andy-Delft-University-of-Technology--Netherlands",
            "Id": "29e46f90d8",
            "Code": "fa234ae0fc6c04362bcf5439462881",
            "Bio": "Andy Zaidman is an Associate Professor at the Delft University of Technology, the Netherlands. He obtained his MSc (2002) and PhD degree (2006) in Computer Science from the University of Antwerp, Belgium. His main research interests are software evolution, program comprehension, mining software repositories, and software testing. He was the general chair of the 15th Working Conference on Reverse Engineering (WCRE 2008) held in Antwerp, Belgium, program co-chair of WCRE 2009 held in Lille, France, and program co-chair of VISSOFT 2014 held in Victoria, BC, Canada. In 2013, Andy Zaidman was the laureate of a NWO Vidi career grant.",
            "URLhp": "http://www.st.ewi.tudelft.nl/~zaidman/",
            "URLphoto": "http://www.st.ewi.tudelft.nl/~zaidman/andy.jpg",
            "URLgs": "https://scholar.google.be/citations?user=CDTfcG4AAAAJ&hl=en&oi=ao",
            "URLmsa": "",
            "URLtw": "https://www.twitter.com/azaidman",
            "URLgp": "",
            "URLfb": "",
            "URLli": "https://www.linkedin.com/in/andyzaidman"
        },
        {
            "Name": "Tao Zhang",
            "Affiliation": "Harbin Engineering University, China",
            "Key": "Zhang-Tao-Harbin-Engineering-University--China",
            "Id": "6bd809ce9d",
            "Code": "b63f99aa986ab9726a6b2d4dc4ef3e",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Xiaohan Zhang",
            "Affiliation": "Fudan University, China",
            "Key": "Zhang-Xiaohan-Fudan-University--China",
            "Id": "128cf31c08",
            "Code": "abd8a75d3b5e35a76bc49e3320bd41",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Yuan Zhang",
            "Affiliation": "Fudan University, China",
            "Key": "Zhang-Yuan-Fudan-University--China",
            "Id": "b9eba4f0f9",
            "Code": "273078aa70a3aa032138d705399c44",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Wenyun Zhao",
            "Affiliation": "Fudan University, China",
            "Key": "Zhao-Wenyun-Fudan-University--China",
            "Id": "5bcbc9aa60",
            "Code": "54af88ef9c0ac06713a914440fa6cf",
            "Bio": "",
            "URLhp": "",
            "URLphoto": "",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        },
        {
            "Name": "Hao Zhong",
            "Affiliation": "Shanghai Jiao Tong University, China",
            "Key": "Zhong-Hao-Shanghai-Jiao-Tong-University--China",
            "Id": "acb9bc3a08",
            "Code": "92e5b2c3a63ab941965e0dd7ac2a59",
            "Bio": "",
            "URLhp": "http://www.cs.sjtu.edu.cn/~zhonghao/",
            "URLphoto": "http://www.cs.sjtu.edu.cn/~zhonghao/photo.jpg",
            "URLgs": "http://scholar.google.com/citations?user=Vhe3-JsAAAAJ&hl=en&oi=ao",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": "https://www.linkedin.com/in/hao-zhong-7a705025"
        },
        {
            "Name": "Yuming Zhou",
            "Affiliation": "Nanjing University, China",
            "Key": "Zhou-Yuming-Nanjing-University--China",
            "Id": "1a239af502",
            "Code": "2e58adb86e41aab39407f989ed5e6c",
            "Bio": "",
            "URLhp": "http://cs.nju.edu.cn/zhouyuming",
            "URLphoto": "http://cs.nju.edu.cn/zhouyuming/pic/image001.png",
            "URLgs": "",
            "URLmsa": "",
            "URLtw": "",
            "URLgp": "",
            "URLfb": "",
            "URLli": ""
        }
    ]
}